[{"link":"https://nz.indeed.com/rc/clk?jk=116c874d8a8318f3&fccid=83927230253a564d&vjs=3","name":"React.js Developer","companyName":"Orion Health Group","time":"12 days ago","location":"Auckland","area":"Auckland City","country":"New Zealand","description":"<div><p>Healthcare is experiencing a global shift, opening up exciting new opportunities in technology. In the world of software engineering, there are few areas where you can have more impact. Your work will assist doctors, lab techs, pharmacists, nurses, and others involved in helping patients improve their health. The products you work on play a material role in saving lives and improving patient care, and the quality of those solutions is key.</p><br>\n<p></p>\n<p><b>\nAbout the role</b></p>\n<p>\nWe&#x2019;re looking for an experienced full-stack developer to join our Auckland team. You&#x2019;ll be building functional, intuitive and beautiful web-based user interfaces working initially on two very exciting internal projects. As a React.js Developer, you will be involved from conception to completion with projects that are technologically sound and aesthetically impressive.</p>\n<p>\nImmersed in a culture of collaboration, learning and software engineering excellence, you&#x2019;ll quickly extend your Front End and UI skills within strong cross discipline project teams. You will also work closely with the Digital Marketing Manager to ensure our web presence stands out from the competition.</p>\n<p>\nDeveloping a flexible and well-structured front-end architecture, along with the APIs to support it, you&#x2019;ll be confident using UI/UX designs and wireframes to create the respective code and application. You&#x2019;ll enjoy optimising components for maximum performance across a vast array of web-capable devices and browsers.</p><br>\n<p></p>\n<p><b>\nAbout You</b></p>\n<p>\nYou like to get stuck in and have a positive, open minded and energetic attitude. You have an eye for detail, enjoy understanding how things work under the hood, excellent verbal and written communication skills, and thrive in a collaborative, professional work environment.</p>\n<p>\nYou&#x2019;ll have solid experience of the following tools and techniques:</p>\n<ul>\n<li>Sound knowledge of modern front-end build pipelines and tools</li>\n<li>Experience with code versioning tools such as Git</li>\n<li>Experience with popular React.js workflows (such as Flux or Redux)</li>\n<li>Familiarity with GatsbyJS</li>\n<li>In-depth knowledge of Javascript, CSS, HTML and front-end languages</li>\n<li>Knowledge of REACT tools</li>\n<li>Excellent troubleshooting skills</li>\n<li>Good project management skills</li><br>\n</ul><p></p>\n<p><b>\nIn return, Orion Health offers</b></p>\n<ul>\n<li>Defined career paths for all roles and across business functions</li>\n<li>Be supported by mentoring and coaching systems</li>\n<li>Competitive salary package</li>\n<li>Breakfast, fruit, freshly ground coffee daily</li>\n<li>Flexible and social, but professional company culture</li>\n<li>Unique learning, travel and career growth prospects</li><br>\n</ul><p></p>\n<p><b>\nIf this sounds like you, we&#x2019;d love to hear from you!</b></p></div>"},{"link":"https://nz.indeed.com/rc/clk?jk=930e0d61d7b0f97a&fccid=75018a27cbdffdac&vjs=3","name":"Front End React.js / Redux Developer","companyName":"Talent Army","time":"13 days ago","location":"Wellington","area":"Wellington City","country":"New Zealand","description":"<div><ul><li>Great tech in a start-up environment</li>\n<li>Work with high performance technology, including Blazor</li>\n<li>Early phase, with great industry support</li><br>\n</ul>\n<br>\n<div>An awesome SaaS startup in Wellington is heading into their first round of recruitment, and looking for a Front End Developer with strong React.js / Redux knowledge, and potentially interested in moving to a Blazor environment in the future. With that comes the opportunity to get elbows deep at an early stage, where you can have huge exposure and work directly with a very strong technical leadership team. Seriously punching above their weight in ID and credential management, they have been recognised by both Microsoft and the NZ energy industry, bringing huge opportunities in both execution and market share.<br>\n<br>\nDigitising a manual training records process, they bring a huge amount of additional support, security and confidence to the energy industry, with a scalable SaaS application with heaps more space to grow. Locally built, and backed by a big player in the global ID market, they have the best of both worlds, small enough to make a difference and with the scope to be something really special.<br>\n<br>\n<b>What will I be doing?</b><br>\n<ul><li>Making good looking, accessible and awesome user experiences</li>\n<li>Support and enhance our web applications</li>\n<li>Diagnosing and resolve front end workflow, usability and code issues</li>\n<li>Continuously improve our solutions</li>\n<li>Documentation for our applications\n</li></ul><b>What do I need to know?</b><br>\n<ul><li>Specialist knowledge of front end technologies, including JavaScript and DOM manipulation, React.js, Redux, HTML/CSS and NPM. If you are looking to widen your skills, they are already looking at Blazor as their &#x201C;next generation&#x201D; Front End platform</li>\n<li>Contemporary knowledge API/REST interfaces (such as using Swagger) including modern authentication such as OpenID and Oauth utilising JWT, JWS</li>\n<li>Familiarity with modern code management, build pipelines and tools with Azure DevOps and Git being our primary toolset for this</li>\n<li>Microsoft Azure services in general such as App services and functions for serverless applications. Knowledge of Azure Service bus would be an advantage</li>\n<li>Data exchange standards, formats and schemas such as JSON Schema, web hooks etc</li>\n<li>Even more of a bonus if you have done any work with Web Assembly; including PWAs</li>\n</ul>We&#x2019;d love to see some of this, but it&#x2019;s not a dealbreaker<br>\n<ul><li>They are a .Net shop some so knowledge of C# and will be preferable so you can read the code and can contribute to discussions.</li>\n<li>Knowledge of Identity standards such as W3C Verifiable credentials, DID and any wider knowledge of the self-sovereign identity ecosystem</li>\n</ul>If you want to work in a tight, high performing team with some cutting edge technologies and a project with a huge future, then drop us a line here or email peter@talent.army to set up a discreet chat.</div></div>"}]