[{"link":"https://au.indeed.com/company/Spare-Staff/jobs/Node-Js-Web-Developer-cddf14a785d2b64e?fccid=0bf3899ffad8d675&vjs=3","name":"Node JS web developer","companyName":"Spare Staff","time":"6 days ago","area":"Enmore NSW","country":"Australia","description":"<p><b>Our Company</b></p><p>We are a new startup business that is looking to create a new online marketplace that never existed before.</p><p><b>The Role</b></p><p>We are looking for a passionate, experienced NodeJS web developer to join our team to build an eCommerce online marketplace website. This position is for 6 months with option to extend to a permanent full-time position.</p><p>You will be joining our main developer to build the site based on existing HTML design.</p><p>You must have 2+ years of experience NodeJS, Javascript, React, either through projects, or freelancing work that you&#x2019;ve done, or through past work experience.</p><p>You must have great passion for coding, web development, a team player with excellent communication skills.</p><p>You will need to demonstrate your experience and skills by showcasing your portfolio of previous sites that you have built, explaining and showing what tools you used to build the sites..</p><p>You will contribute to building both front and back end of the site, including creating SQL databases.</p><p>It is an advantage if you are familiar with Amazon AWS hosting, server-less application, and have experience with integrating websites with Stripe payment gateway.</p><p><b>Only candidates who are Australian permanent resident or citizen will be considered.</b></p><p><b>The site</b></p><p>Is an online marketplace for users to hire items from each other. Users can sign up for an account and log in; Search, find, read reviews, check other user profile, send messages to other users, and hire listed item from another user. The user can list multiple items for hire (available on which day and from the time it is available on each day). User can hire the listed item and select the days and time that he wants to hire. When the item is hired, our platform will process payment through Stripe payment gateway.</p><p>Part-time hours: 20-30 per week</p><p>Expected Start Date: 12/10/2020</p><p>Job Types: Part-time, Temporary, Permanent</p><p>Salary: $30.00 &#x2013; $35.00 per hour</p><p>Experience:</p><ul><li>Node JS web developer: 2 years (Preferred)</li><li>javascript: 2 years (Preferred)</li></ul><p>Work Eligibility:</p><ul><li>Permitted to work permanently with no restriction on hours (e.g. citizen, permanent resident) (Required)</li></ul><p>Work Remotely:</p><ul><li>No</li></ul>"},{"link":"https://au.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0CIodzRyOwMfVg4scQsdRG2CEjSZ-y-OPaM_IkxM84zTcFAhpkB9ckrE3-xoENJzpmxMhbrj9RVi4RHAX_Fu336Ob6zne0HdEz9cnWlnSRZ9RccnRbGEvpYe9b1wA6nNKmKJsCwxjZcy9bfFkKOUTWCeoN2d8kIfFz0R2oC16rTCdrDwEeEN0wu9pRXMs49kKombLGhuJl22Oaiv1pdIuU48AUw9ak0YUvRzAUeLpQ4wxKFN5x0Aj31sFDoS-Wjml20d3oITGTWxO87vbzfH7PAeHlI55Yf9-7x_OBswPCyaJ-qLaZwacpTMrWcd3JUvOGMyLJivpn4UclChv-6U_a4MmUgjRhP5xyCaWTSYdifhJ-DKs4drVx8h4t7GPfUgoiS79WmwyIvBMbTyp61h6sqXellNwhZlyj7yDNbPd1RQZO5Z-kOHKAhNf326gfCwybtXNqqqr-yG8bcPMl8qb1O0JmHo8Yf10zWQxdZ_tdMbQ==&p=1&fvj=1&vjs=3","name":"Fullstack Javascript Developer | React/Node.js","companyName":"Canibuild","time":"10 days ago","area":"Bella Vista NSW","country":"Australia","description":"<p><b>About us: </b></p><p>Canibuild (www.canibuild.com) helps the residential construction industry automate and improve how construction is sold, designed, and approved.<br>Work alongside a mix of embedded construction professionals and leading software developers to research and develop cutting edge applications.<br>Today, we are a growing SaaS start-up with a rapid subscriber user base from around the world including Australia, NZ, Canada, and the United States.</p><p><b>The Position: </b></p><p>We require a experienced Full-stack Developer to join a dynamic team of passionate programmers working on world-first technology. In this position, you will have the opportunity to develop innovative applications using various cutting-edge technologies and following Agile practices.<br>You&apos;ll be part of an agile and effective team as you build the product and integrate it into a disruptive SaaS application.</p><p><b>What technical skills will you need to succeed in this role?</b></p><ul><li>2+ years of Full Stack Development experience, using ReactJS/Redux/Hooks and Node.js/Express/Typescript</li><li>Solid experience with JavaScript, ES6, HTML5, CSS3 and responsive application design</li><li>Cross-browser, cross-platform, cross-device compatibility issues and ways to work around them</li><li>Rapidly prototype web applications to showcase new concepts and ideas</li><li>Suggests new technologies and approaches</li><li>Estimate the duration and level of effort of development tasks</li><li>Experience working with Agile methodologies</li><li>Understand modern development practices (CI/CD, Cloud, etc.)</li><li>Excellent problem-solving skills</li><li>Ability to meet deadlines, and work independently and within a team, with clear reporting and focused on results</li></ul><p><b>Desirable Experience: </b></p><p>Interactive map libraries such as Leaflet.js, GIS data handling (GeoJSON, shapefiles, etc.) and AWS</p><p>Job Types: Full-time, Permanent</p><p>Salary: $100,000.00 &#x2013; $140,000.00 per year</p><p>Experience:</p><ul><li>Javascript: 3 years (Preferred)</li><li>Full Stack: 2 years (Preferred)</li></ul><p>Work Eligibility:</p><ul><li>Permitted to work permanently with no restriction on hours (e.g. citizen, permanent resident) (Required)</li></ul>"},{"link":"https://au.indeed.com/company/Bookipi/jobs/Fullstack-Javascript-Developer-React-Node-Js-0fdd95d6bc31121b?fccid=b3a5d64c682dbf1f&vjs=3","name":"Fullstack Javascript Developer | React/Node.js","companyName":"Bookipi","time":"8 days ago","area":"North Strathfield NSW","country":"Australia","description":"<p><b>About Us: </b><br>Bookipi (Bookipi.com) is a leading business software company based in Sydney. Our apps are used by over 780,000 businesses across 179 countries and growing everyday.<br>We have an amazing team and aim to be the top in each category we compete in. Technical ability and culture fit are key across the team. We&apos;re excited to see what you&apos;ve got.</p><p><b>Job Role: </b></p><p><i>If you don&apos;t have one of the requirements, let us know why it doesn&apos;t matter.</i></p><p>We are looking for the right fullstack developer to join our fast growing team. We are looking for an exceptional problem solver who can deliver a top class code base.</p><p>In this position, you will develop innovative applications using cutting-edge technologies and learn from a diverse and experienced team.</p><p><b>Technical Requirements: </b></p><ul><li>Excellent ability to code in:</li></ul><p>ReactJS or React Native<br>Javascript<br>Node.JS<br>MongoDB</p><ul><li>3 years experience</li><li>Formal computer science or software engineering qualification is preferred but not required.</li><li>Experience debugging using popular JavaScript-based tools like Chrome Developer Console</li><li>Demonstrated experience and knowledge in server development and management</li></ul><p><b>Key Actions</b></p><ul><li>An ability to deliver in a fast-paced environment and continue to raise the bar at a high performing company.</li><li>Complete technical verification of design and architecture</li><li>Perform code reviews</li><li>Direct junior developers in their code development</li><li>Work with the team to solve technical difficulties and ascertain the best deployment approach when needed</li></ul><p><b>About you</b></p><ul><li>A desire and the ability to build something great.</li><li>An ability to effectively execute designated sprint schedules.</li><li>The willingness to learn and adapt your methodologies, and the ability to share your learnings with the team.</li><li>A team player who can communicate appropriately for the role.</li></ul><p><b>Do you fit?</b></p><p>We&apos;re seeking a suitably qualified and experienced full stack developer desired for immediate start.</p><p>You will work in a team responsible for delivering top-of-class software and testing services.</p><p>This is an opportunity to bring your skills and experience to an environment where you will make a difference. You are encouraged to take an innovative and proactive approach to your work with the support of a great team.</p><p>Expected Start Date: 12/10/2020</p><p>Job Types: Full-time, Permanent</p><p>Experience:</p><ul><li>javascript: 3 years (Preferred)</li></ul><p>Work Eligibility:</p><ul><li>Permitted to work permanently with no restriction on hours (e.g. citizen, permanent resident) (Preferred)</li></ul><p>Work Remotely:</p><ul><li>Temporarily due to COVID-19</li></ul>"},{"link":"https://au.indeed.com/rc/clk?jk=3e45559ead91e15b&fccid=cbf3e3191bef0f2d&vjs=3","name":"Javascript / Node JS Developer $150K+super","companyName":"Command Group","time":"9 days ago","area":"Melbourne VIC","country":"Australia","description":"<div><ul><li>Senior Full Stack React Developer</li>\n<li>Senior Front-end Javascript Graph QL</li>\n<li>Government Department Melbourne CBD</li>\n</ul>\n<br>\n<b>Javascript / Node JS Developer $150K+super</b><br>\n<br>\nSenior React / Full-stack Developer needed for this awesome Digital Startup company. Lots of perks here and no red tape holding you back.<br>\n<br>\n<b>Strong JavaScript and React along with any NODE or other back-end tech.</b><br>\n<br>\nYou will be required to build a new UI / Frontend by well funded and fast growing scale up company.<br>\n<br>\n<b><i>Key Skills:</i></b><br>\n<ul><li>Strong core JavaScript skills and NODE JS</li>\n<li>Proven development skills with modern JavaScript frameworks ideally React / ReactJS or (Vue.js or AngularJS) who would like to work with React</li>\n<li>HTML5/CSS3</li><br>\n</ul><br>\n<br>\n<b>APPLY! Perm + Equity + Bonus. $150K+super Melbourne CBD</b></div>"},{"link":"https://au.indeed.com/rc/clk?jk=c7860d2e5d10aa50&fccid=c90e910978217fed&vjs=3","name":"Senior Node.JS Developer Brisbane | Permanent - Full time","companyName":"Peoplebank","time":"12 days ago","area":"South Brisbane QLD","country":"Australia","description":"<div><p>We&apos;re exclusively hiring for Coviu, a fast growth and well-funded start-up who provide a global telehealth platform, allowing doctors to run their practices whilst consulting seamlessly and securely with patients online. They have been steadily growing, however the Covid 19 outbreak has seen them grow rapidly from hundreds of customers per week signing up, to now thousands. At the current customer growth rate, they expect to have 50,000 customers using their product in the coming weeks.</p><p>\nWe are looking for a superstar who can cope with the significant high demands of this rapidly growing business and help them approach best practices and implement solutions fast to help scale their platform.</p><p>\nCoviu was first created within the Australian research organisation CSIRO as part of research into telehealth delivery platforms. Working closely with clinicians, they found that existing consumer video calling software and corporate video conferencing applications were not appropriate for healthcare services. Not only did they not satisfy the stringent security and privacy requirements of healthcare businesses, but they missed important business functions such as collecting payments, making appointment bookings, and gathering patient consent.</p><p><b>\nThe Tech:</b></p><p>\nAs a full stack developer, you&apos;ll be working across the front-end and back-end software stack, with a focus on back-end.</p><p>\nThe back-end is Node.js primarily, with some servers using Scala and Haskell. They follow a micro services architecture since the backend services that power video consultations scale in a diverse manner. Everything is built around APIs. The local development environment is spun up using Docker images to allow you full control. They follow a continuous integration and continuous delivery approach with a vast automated test suite and an automated deployment pipeline into AWS. You&apos;ll be working across most of the Coviu platform components, including their WebRTC based video conferencing solution, third party integrations, and their internal and external applications.</p><p>\nCoviu&apos;s client facing web application is built with a particular focus on a top notch user experience. Built on the React and Mercury frameworks, they follow modern responsive design principles. Mobile apps are build using react-native.</p><p>\nYou&apos;ll also be helping to build Coviu&apos;s engineering culture by identifying and communicating best practices, and participating in code reviews.</p><p>\n</p><p><b>What we&apos;re looking for:</b></p><p>\nAs Coviu&apos;s stack is heavily based on Javascript technologies, you will have:</p><ul><li>\nExperience as a full stack engineer delivering production ready systems using modern Javascript</li><li>\nA deep understanding of software engineering fundamentals</li><li>\nProven debugging and troubleshooting skills</li><li>\nExcellent communication skills and the ability to contribute as part of a team</li><li>\nA love of clean, maintainable code</li><li>\nBe able to build simple, elegant solutions that strike the balance between perfection and shipping things quickly.</li></ul><p>\n</p><p>They are looking for engineers who love to learn and are keen to get stuck in, while taking</p><p>\nresponsibility for delivering a quality product.</p><p>\n</p><p>This opportunity is an excellent opportunity for an outstanding Senior Developer/Lead developer to join one of Australia&apos;s leading telehealth platforms, and apply your skills to make a real difference. You will be making a huge contribution and helping the greater community by making these consults more accessible.</p><p>\nYou will contribute to the growth and development of this business. Please contact <b>Bharti</b> on <b>07 3003 7643</b> quoting reference number #202466 for more information, or click the link to apply!</p></div>"},{"link":"https://au.indeed.com/rc/clk?jk=27f83b07a7f4c114&fccid=31670bef3ae6497b&vjs=3","name":"Node JS Developer","companyName":"HAYS","time":"10 days ago","area":"Melbourne City Centre VIC","country":"Australia","description":"<div>Are you looking for your next exciting change?<p><br>\n<b>\nYour new company</b>\n<br>\nThis growing financial institution prides itself on revolutionising how people borrow money - moving to an insight-led, tech-driven offer that helps their customers enjoy easier money freedom.<br>\n<br>\n<b>Your new role</b>\n<br>\nIn this role you will be a part of a motivated agile team to drive innovation through digital development.<br>\nYou will have extensive knowledge and experience in:\n</p><ul>\n<li>Node.JS Development</li>\n<li>Golang\n</li></ul><ul><li>Python</li>\n<li>Maintain high quality software in AWS</li>\n<li>Building and maintaining Microservices</li><br>\n</ul>\n<div><br>\n</div><ul><li>Financial Services preferred but not essential - all candidates with relevant experience are encouraged to apply</li></ul><br>\n<br>\n<b>What you need to do now</b><br>\nIf you&apos;re interested in this role, click &apos;apply now&apos; to forward an up-to-date copy of your CV to sarah.sherriff@hays.com.au<br>\nIf this job isn&apos;t quite right for you but you are looking for a new position, please contact us for a confidential discussion on your career.<br>\n<br>\n<b>LHS 297508</b> #2424126</div>"},{"link":"https://au.indeed.com/rc/clk?jk=93cba1908c105459&fccid=5385a960d1cfded8&vjs=3","name":".Net /Node.Js Lead","companyName":"Firesoft People","time":"9 days ago","area":"Sydney Central Business District NSW","country":"Australia","description":"<div><p><b>.Net/Node.js Development Lead</b>\n</p><ul><li>Exciting new greenfield project in a newly created lead role</li>\n<li>Heavily funded global fintech company with remote and onshore teams</li>\n<li>Great benefits and flexibility located in the Sydney CBD</li>\n</ul>\n<p><b>The opportunity:</b></p>\n<p>\nIn this exciting and upbeat opportunity, we are calling for a driven, Senior .Net developer to step into the Lead role on a very exciting product. The platform and accompanying mobile application are currently on its second year and is a Greenfields project looking to release in several months.</p>\n<p>\nYou are an experienced leader with strong practice throughout the SDLC, someone who has been deep in the trenches building stable and consistent applications. With a desire to consistently adhere to Best practices and a burning passion for new technology and cloud-native applications, you will strive for excellence in every aspect of this build. You will be required to provide extensive experience with the architectural implementation input to the developers as well as be a link between the business analyst team to transfer domain knowledge and requirements effectively into development.</p>\n<p>\n<b>Responsibilities and Values that will help:</b>\n</p><ul><li>A strong and transparent communicator who can adapt to working and coordinating teams worldwide</li>\n<li>Proactive approach with an inquisitive mindset.</li>\n<li>Ability to prioritize and leverage technologies and platforms to understand which components work better</li>\n<li>Managing releases and day to day requirements to support all teams in your vertical</li>\n<li>Continuously improving and maintaining the CI/CD pipeline</li>\n<li>Working with different product teams to drive and deliver continuous quality control and improvements</li>\n</ul>\n<p><b>Key Skills</b>\n</p><ul><li>Deep understanding and architectural knowledge working with a Microsoft stack.</li>\n<li>Ability to effectively analyze workflow patterns and distribute work efficiently as the Node.JS serverless solutions and .Net development team.</li>\n<li>Experience working with disbursed quality testing teams, having a solid understanding of best practices and tooling, both automation and manual functional Testing.</li>\n<li>Proven experience designing, building and managing applications on Azure and AWS.</li>\n<li>Experience working with Databases that are Relation or Non-relational</li>\n<li>SQL Server experience or any other relevant technologies as well as depth of experience working with AWS.</li>\n<li>Design and build API&apos;s as well as automating and maintaining documentation to support them.</li>\n</ul>\n<p>If you are interested in a new upbeat opportunity where you will oversee some of the biggest changes and greatest improvements come to life, then Apply Now through the direct link above as applications will be shortlisted immediately</p></div><p></p>"},{"link":"https://au.indeed.com/rc/clk?jk=f78eec565a3c74fa&fccid=a1981174903a7c67&vjs=3","name":"node.JS Developer","companyName":"Milestone IT","time":"10 days ago","area":"Melbourne VIC","country":"Australia","description":"<div><ul><li>True Career Opportunity</li><li>\nImmidiate Start</li><li>\nFantastic Working Environment</li></ul><p>\nMilestone IT is currently working with this brilliant global business who right now has an exciting opportunity for an experienced node.JS Developer to join a great team.</p><p><b>\nKey Responsibilities include:</b></p><ul><li>\nProvide well documented, high performance, reliable, maintainable codes</li><li>\nYou will be involved in delivering APIs and maintain backend services</li><li>\nContinually perform code reviews and knowledge transfers to other developers</li><li>\nProvide technical research and advice to the technical lead</li><li>\nAdhere to the team&#x2019;s agile practices</li><li>\nImprove the performance, security, reliability, and maintenance of the platform</li><li>\nBuilding backend services for IOS and Android apps</li><li>\nMicroservice design &amp; architecture experience</li><li>\nProvide a solution architecture for small features</li></ul><p><b>\nSkills we are looking for:</b></p><ul><li>\nYou must have a node.JS development experience</li><li>\nUsing your skills to develop in node.JS / React/ Javascript</li><li>\nExperience in integrating with external/partner APIs and systems</li><li>\nUnderstanding of key concepts of modern web development</li><li>\nSomeone who has 2-7 years of web development experience</li><li>\nSomeone looking for a role that allows them to learn the new technologies</li><li>\nWell presented, hardworking and enjoys working in a Team</li><li>\nPossess great written and verbal communication skills.</li><li>\nWork well independently and productively within a small team environment.</li></ul><p>\n</p><p>This is a fantastic opportunity for someone looking for a challenging and exciting opportunity. Please note, candidates will receive an immediate response.</p><p>\n</p><p>To apply online, please click on the appropriate link below. Alternatively, for a confidential discussion, please contact [Sam Menon] on [03-96706682].</p></div><p></p>"},{"link":"https://au.indeed.com/rc/clk?jk=a61a406ba9d52119&fccid=c90e910978217fed&vjs=3","name":"Node.js AWS | Full Stack Developer","companyName":"Peoplebank","time":"5 days ago","area":"Redfern NSW","country":"Australia","description":"<p></p><div><p>A growing start-up with significant funding and strong customer base is currently looking for a talented fullstack developer to help build a wide range of core application builds including their cloud platform and data and automated data analytics/insights platforms. This is an environment of true innovation, where you will work as part of a team to design and build many of these solutions from scratch.\n</p><p><b>Key technology requirements:</b></p><ul><li>\nExpertise in Node.js</li><li>\nExperience in javascript, ES6 and at least one framework but not limited toVue.js or React</li><li>\nExperience with NoSQL and SQL databases such as MongoDB, Redis, Postgres</li><li>\nExpertise in AWS and cloud</li><li>\nUnderstanding of microservice architecture</li><li>\nUnderstanding of how to build performant, decoupled, testable, maintainable code</li><li>\nExperience with JSON, RESTful</li><li>\nExperience in HTML5, CSS3, UI Framework such as Bootstrap</li><li>\nExperience in responsive design</li><li>\nExperience with GIT and continuous integration</li></ul><p>\nThis is a chance for an outstanding developer to work in an environment or true innovation, with a great team who enjoy ownership and autonomy in building new solutions. If you have the right experience, please apply now. Job #205117</p></div>"},{"link":"https://au.indeed.com/rc/clk?jk=65f454f9a9de4dc3&fccid=9d71ff1a85603fbf&vjs=3","name":"Node JS Engineer","companyName":"Preacta Recruitment","time":"9 days ago","area":"Sydney NSW","country":"Australia","description":"<div><ul><li>$100K-$120K + Super</li>\n<li>Fintech</li>\n<li>Flixible working and relaxed environment</li>\n</ul>\n<br>\nAn exciting company who has new products built and is thriving in the fintech markets. Were are looking for people who want to be hands on and executing using emerging technologies. We are not robots we want people to enjoy what they are doing and have fun while there doing it. We are dog friendly and enjoy a beer on a Friday.<br>\n<br>\nCurrent tech stack we use:<br>\n<ul><li>JavaScript - Node &amp; React</li>\n<li>Typescript</li>\n<li>AWS</li>\n<li>MongoDB</li>\n<li>GraphQL</li>\n<li>Kubernetes would be nice but not essential</li>\n</ul>We are collaborative, open company and love everyone to have a voice in the business. We love to share ideas and help each other grow in both personal and professional development. We love change and how people can handle it.<br>\n<br>\nIf this sounds like you we would love to hear from you!</div>"},{"link":"https://au.indeed.com/rc/clk?jk=51a71cf61a2d428f&fccid=31bd0f43a987f25b&vjs=3","name":"Front End Technical Lead / JS Engineer - React & Node","companyName":"Limelight Consulting Group Pty Ltd","time":"5 days ago","area":"Sydney NSW","country":"Australia","description":"<div><ul><li>Central CBD Location &amp; Excellent Salary</li>\n<li>Exciting Career Opportunity</li>\n<li>Highly Progressive Technical Environment</li>\n</ul>\n<br>\nAn Exciting &amp; Innovative FinTech SaaS Business Are Seeking A Technical Lead To Spearhead Their Front End Platforms across their varied product stack. Extensive knowledge across Javascript frameworks are key. Ideally - React.JS / Redux, but knowledge across Angular, Vue or Ember is well regarded.<br>\n<br>\nThis opportunity is centered around large re-platforming program of work and building out the key architecture and their front end frameworks. These cutting edge platforms will allow for much improved engagements with customers. This is a highly strategic role, with the successful person being a front end technologist, with a flair for delivery and building high quality frameworks and components.<br>\n<br>\nAs Tech Lead you will have responsibility for the platform, product road-map, architectural design, and the development environment. You&#x2019;ll bring a blend of leadership and strategic skills needed to be applied in a technical context. You will be hands-on in this role, while coordinating project teams across and being involved in the overall strategy for the front end standards and components.<br>\n<br>\nThis is an exciting role and offers the right person a very interesting space to carve out an exciting career. The right person to fill this role, will really help take this business to the next level.<br>\n<br>\n<b>Key Skills Experience:</b><br>\n<br>\n<ul><li>Highly experienced in Javascript, ES6+ development and building web applications</li><li>Have worked extensively with APIs and Micro Services Architectures. Plus knowledge around serverless architecture, design, building, testing, and deployment automation.</li><li>A solid grounding in Javascript frameworks. Ideally React.js and Redux. Other frameworks are well regarded - Angular / Ember</li><li>Have lead technical teams on medium to large sized project</li><li>Expert level CSS3 &amp; HTML5</li><li>Exposure to GraphQL is very advantageous</li><li>Any Agile knowledge is well regarded</li><li>Strong skills in Linux, MongoDB or CouchDB advantageous</li><li>Very strong communication skills - Written and oral</li></ul><br>\n<b>\nNice to Have:</b><br>\n<br>\n<ul><li>Have been involved in digital transformation transitions</li><li>Have experience working in SaaS Fintechs or Wealth Management environments</li></ul><br>\nTo find out more about this opportunity; please email: ds@limelightpeople.com.au or call: 02 8458 2626</div>"}]