[{"link":"https://au.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0CIodzRyOwMfVg4scQsdRG2CEjSZ-y-OPaM_IkxM84zTcFAhpkB9ckrE3-xoENJzpmxMhbrj9RVi4RHAX_Fu336Ob6zne0HdEz9cnWlnSRZ9RccnRbGEvpYe9b1wA6nNKmKJsCwxjZcy9bfFkKOUTWCeoN2d8kIfFz0R2oC16rTCd6372kEyhe7TYUGAkH_zfcvGYh1YRyFOXh28MRKGGYEMnEU_WVi278idI6QhuaT9t-m2endGMCDi1v36wjge7ZruV8M3SettilRFSNPV-xRXrD3yNpw2NU4KB6UqneT9VyJ9M5FZc1ylXtZ2GgfVLUOEtHinA0WrZh8u2rMq3Uol9AF1xT4KgBq_Hngvno8wVNivSMJwAKW-OqZsjf1J0mz1L3HTOlKdoWu8fmxap9MWIx3K5TVQz7PZJqhnvBflD4KIt94mHCW4IOMpAX9Zj0q_x9PKhVWHpHTWX17EE5MZePBeTI7OEk=&p=0&fvj=1&vjs=3","name":"Fullstack Javascript Developer | React/Node.js","companyName":"Canibuild","time":"10 days ago","area":"Bella Vista NSW","country":"Australia","description":"<p><b>About us: </b></p><p>Canibuild (www.canibuild.com) helps the residential construction industry automate and improve how construction is sold, designed, and approved.<br>Work alongside a mix of embedded construction professionals and leading software developers to research and develop cutting edge applications.<br>Today, we are a growing SaaS start-up with a rapid subscriber user base from around the world including Australia, NZ, Canada, and the United States.</p><p><b>The Position: </b></p><p>We require a experienced Full-stack Developer to join a dynamic team of passionate programmers working on world-first technology. In this position, you will have the opportunity to develop innovative applications using various cutting-edge technologies and following Agile practices.<br>You&apos;ll be part of an agile and effective team as you build the product and integrate it into a disruptive SaaS application.</p><p><b>What technical skills will you need to succeed in this role?</b></p><ul><li>2+ years of Full Stack Development experience, using ReactJS/Redux/Hooks and Node.js/Express/Typescript</li><li>Solid experience with JavaScript, ES6, HTML5, CSS3 and responsive application design</li><li>Cross-browser, cross-platform, cross-device compatibility issues and ways to work around them</li><li>Rapidly prototype web applications to showcase new concepts and ideas</li><li>Suggests new technologies and approaches</li><li>Estimate the duration and level of effort of development tasks</li><li>Experience working with Agile methodologies</li><li>Understand modern development practices (CI/CD, Cloud, etc.)</li><li>Excellent problem-solving skills</li><li>Ability to meet deadlines, and work independently and within a team, with clear reporting and focused on results</li></ul><p><b>Desirable Experience: </b></p><p>Interactive map libraries such as Leaflet.js, GIS data handling (GeoJSON, shapefiles, etc.) and AWS</p><p>Job Types: Full-time, Permanent</p><p>Salary: $100,000.00 &#x2013; $140,000.00 per year</p><p>Experience:</p><ul><li>Javascript: 3 years (Preferred)</li><li>Full Stack: 2 years (Preferred)</li></ul><p>Work Eligibility:</p><ul><li>Permitted to work permanently with no restriction on hours (e.g. citizen, permanent resident) (Required)</li></ul>"},{"link":"https://au.indeed.com/company/Bookipi/jobs/Fullstack-Javascript-Developer-React-Node-Js-0fdd95d6bc31121b?fccid=b3a5d64c682dbf1f&vjs=3","name":"Fullstack Javascript Developer | React/Node.js","companyName":"Bookipi","time":"8 days ago","area":"North Strathfield NSW","country":"Australia","description":"<p><b>About Us: </b><br>Bookipi (Bookipi.com) is a leading business software company based in Sydney. Our apps are used by over 780,000 businesses across 179 countries and growing everyday.<br>We have an amazing team and aim to be the top in each category we compete in. Technical ability and culture fit are key across the team. We&apos;re excited to see what you&apos;ve got.</p><p><b>Job Role: </b></p><p><i>If you don&apos;t have one of the requirements, let us know why it doesn&apos;t matter.</i></p><p>We are looking for the right fullstack developer to join our fast growing team. We are looking for an exceptional problem solver who can deliver a top class code base.</p><p>In this position, you will develop innovative applications using cutting-edge technologies and learn from a diverse and experienced team.</p><p><b>Technical Requirements: </b></p><ul><li>Excellent ability to code in:</li></ul><p>ReactJS or React Native<br>Javascript<br>Node.JS<br>MongoDB</p><ul><li>3 years experience</li><li>Formal computer science or software engineering qualification is preferred but not required.</li><li>Experience debugging using popular JavaScript-based tools like Chrome Developer Console</li><li>Demonstrated experience and knowledge in server development and management</li></ul><p><b>Key Actions</b></p><ul><li>An ability to deliver in a fast-paced environment and continue to raise the bar at a high performing company.</li><li>Complete technical verification of design and architecture</li><li>Perform code reviews</li><li>Direct junior developers in their code development</li><li>Work with the team to solve technical difficulties and ascertain the best deployment approach when needed</li></ul><p><b>About you</b></p><ul><li>A desire and the ability to build something great.</li><li>An ability to effectively execute designated sprint schedules.</li><li>The willingness to learn and adapt your methodologies, and the ability to share your learnings with the team.</li><li>A team player who can communicate appropriately for the role.</li></ul><p><b>Do you fit?</b></p><p>We&apos;re seeking a suitably qualified and experienced full stack developer desired for immediate start.</p><p>You will work in a team responsible for delivering top-of-class software and testing services.</p><p>This is an opportunity to bring your skills and experience to an environment where you will make a difference. You are encouraged to take an innovative and proactive approach to your work with the support of a great team.</p><p>Expected Start Date: 12/10/2020</p><p>Job Types: Full-time, Permanent</p><p>Experience:</p><ul><li>javascript: 3 years (Preferred)</li></ul><p>Work Eligibility:</p><ul><li>Permitted to work permanently with no restriction on hours (e.g. citizen, permanent resident) (Preferred)</li></ul><p>Work Remotely:</p><ul><li>Temporarily due to COVID-19</li></ul>"},{"link":"https://au.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0CIodzRyOwMfVg4scQsdRG2CEjSZ-y-OPaM_IkxM84zTcFAhpkB9ckr7EdbXau_qoVGam-QvNKEoO_WzhK71XwIuCVSXsgnYsvgY7bfdsy4KWbWdlRWNpONUVSQqQH4UczcjzzQtReONYZ369Y7hE1MMev7yWvyI2Fpq1HQP80K1BgupqJJMGYfiPUhvlldFqKhu76rcrXgxSA89gkZe0gm0DmiRMuPJfwVbjxEGrSJVYf93K1ojHM1iKWRpHzsVERc8YiSRwzB_-UzlG0mNEdne8wDW-EcV8sAoZ21aJBdKhmIHu4Rl2sNQjbkvs3R5t370k8S2voaJCr4szLILNd4hs38JGNouulubvct2ZgIFA3hIEMYLSHj4ASaL68ib05YDgN2EeJbPD716_P_Omid1nc2FVo6NCLvelUEPPqtboJPAZ_d8wg8KT0AQbIiuFnQj5EIn27ZDQXmz7iPAYah&p=2&fvj=1&vjs=3","name":"Senior Front End Developer | React","companyName":"Canibuild","time":"11 days ago","area":"Bella Vista NSW","country":"Australia","description":"<p>About us:</p><p>Canibuild (www.canibuild.com) helps the residential construction industry automate and improve how construction is sold, designed, and approved.</p><p>Work alongside a mix of embedded construction professionals and leading software developers to research and develop cutting edge applications.</p><p>Today, we are a growing SaaS start-up with a rapid subscriber user base from around the world including Australia, NZ, Canada, and the United States.</p><p>The Position:</p><p>We require a Senior React Frontend Developer to join a dynamic team of passionate programmers working on world-first technology. The role includes collaborating in the development of rich web interfaces as well as an interactive map-based interface.</p><p>What you will do:</p><p>As a Senior Developer, you will become the subject matter expert; providing technical expertise and leadership in UI development; demonstrating advanced HTML, CSS, JavaScript, React skills along with other related technologies, libraries and build systems. Deliver pixel-perfect UIs. Be able to rapid prototype ideas in an agile team with quickly evolving requirements.<br>What you have:</p><ul><li>Bachelor&apos;s degree</li><li>Strong React experience along with Node.js, ES6, Redux-Thunk, React Hooks, Styled-Components, CSS3, JSS, HTML5, DOM and Material UI</li><li>Good understanding of REST APIs and JSON</li><li>Have an eye for design/UX.</li><li>Understand modern development practices (CI/CD, Cloud, etc.).</li><li>Excellent problem-solving skills</li><li>A conceptual thinker who can articulate and execute their vision from concept to production</li><li>Proven ability to juggle multiple priorities in a fast-paced environment</li><li>Positive team player</li></ul><p>Desirable Experience:</p><p>Interactive map libraries such as Leaflet.js GIS data handling (GeoJSON, shapefiles, etc.) Node.js AWS</p><p>So, if you are a good fit for this position, please apply today!</p><p>Job Types: Full-time, Permanent</p><p>Salary: $100,000.00 &#x2013; $130,000.00 per year</p><p>Experience:</p><ul><li>javascript: 3 years (Required)</li></ul><p>Education:</p><ul><li>Bachelor Degree (Preferred)</li></ul><p>Work Eligibility:</p><ul><li>Permitted to work permanently with no restriction on hours (e.g. citizen, permanent resident) (Required)</li></ul><p>Work Remotely:</p><ul><li>Temporarily due to COVID-19</li></ul>"},{"link":"https://au.indeed.com/company/Spare-Staff/jobs/Node-Js-Web-Developer-cddf14a785d2b64e?fccid=0bf3899ffad8d675&vjs=3","name":"Node JS web developer","companyName":"Spare Staff","time":"6 days ago","area":"Enmore NSW","country":"Australia","description":"<p><b>Our Company</b></p><p>We are a new startup business that is looking to create a new online marketplace that never existed before.</p><p><b>The Role</b></p><p>We are looking for a passionate, experienced NodeJS web developer to join our team to build an eCommerce online marketplace website. This position is for 6 months with option to extend to a permanent full-time position.</p><p>You will be joining our main developer to build the site based on existing HTML design.</p><p>You must have 2+ years of experience NodeJS, Javascript, React, either through projects, or freelancing work that you&#x2019;ve done, or through past work experience.</p><p>You must have great passion for coding, web development, a team player with excellent communication skills.</p><p>You will need to demonstrate your experience and skills by showcasing your portfolio of previous sites that you have built, explaining and showing what tools you used to build the sites..</p><p>You will contribute to building both front and back end of the site, including creating SQL databases.</p><p>It is an advantage if you are familiar with Amazon AWS hosting, server-less application, and have experience with integrating websites with Stripe payment gateway.</p><p><b>Only candidates who are Australian permanent resident or citizen will be considered.</b></p><p><b>The site</b></p><p>Is an online marketplace for users to hire items from each other. Users can sign up for an account and log in; Search, find, read reviews, check other user profile, send messages to other users, and hire listed item from another user. The user can list multiple items for hire (available on which day and from the time it is available on each day). User can hire the listed item and select the days and time that he wants to hire. When the item is hired, our platform will process payment through Stripe payment gateway.</p><p>Part-time hours: 20-30 per week</p><p>Expected Start Date: 12/10/2020</p><p>Job Types: Part-time, Temporary, Permanent</p><p>Salary: $30.00 &#x2013; $35.00 per hour</p><p>Experience:</p><ul><li>Node JS web developer: 2 years (Preferred)</li><li>javascript: 2 years (Preferred)</li></ul><p>Work Eligibility:</p><ul><li>Permitted to work permanently with no restriction on hours (e.g. citizen, permanent resident) (Required)</li></ul><p>Work Remotely:</p><ul><li>No</li></ul>"},{"link":"https://au.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0BZcAN6AM95-AyIjQcPtmx_RSRI_ayTqEAqPn59yo4KlMU5EaGdg6nToA1phKyxcTdQKTthULGSI76ITeV2aProgZC5DzhR6kd6EEl3mcM3Q1RDZwQLh2rTIJGarVpm654C934z-mIR55Obgkjz_4j27dWNcArmL9t5xy005NzC_lSCd82uo5TlQpx5C6t7d9DfakXs_sA7ArOQ03gmTTjmrdmq_zqPVuIlcw_IjeDsOL3fKV-Wv0XcPYNbcvBoOJnJzZhSkMKXq22mi1PkMbt5RjtPwh3tCyO8acQQ_9d9su1hNQRH9VoRPYNFylOwJGgFRsm84qokkB14l2008OxwOIyO3pW5C-r7xETgvIj_Wfc41U0GyACCRzeyTGsq6czSxdUD8_Erf4nYVMzg1KB6OQVQtLAZe6dyvNitxXGKw_ates72bJNDDiOpwDilfuRlkQWKd3TboL2iYkwRj0Yp&p=4&fvj=1&vjs=3","name":"Senior Front-End React Developer","companyName":"PredictWise Pty Limited","time":"5 days ago","area":"Sydney NSW","country":"Australia","description":"<p>The Position:</p><p>Our client in Sydney is looking for a Senior Front-End React Developer for a short contract which may extend based on the business requirements and individual performance. The role includes collaborating in the development of the rich web as well as an interactive map-based interface.</p><p>What you will do:</p><p>As a Senior Developer, you will provide technical expertise and leadership in UI development; demonstrating advanced HTML, CSS, JavaScript, React skills along with other related technologies, libraries, build systems and delivering pixel-perfect UIs. Be able to rapid prototype ideas in an agile team with quickly evolving requirements.</p><p>Skills Required:</p><p>Strong React experience along with Node.js, ES6, Redux-Thunk, React Hooks, Styled-Components, CSS3, JSS, HTML5, DOM and Material UI<br>Good understanding of REST APIs and JSON<br>Have an eye for design/UX.<br>A conceptual thinker who can articulate and execute their vision from concept to production<br>Proven ability to juggle multiple priorities in a fast-paced environment<br>Positive team player</p><p>Desirable Experience:</p><p>Interactive map libraries such as Leaflet.js GIS data handling (GeoJSON, shapefiles, etc.) Node.js</p><p>Experience Required:</p><p>Minimum 5 years or above.</p><p>Job Types: Full-time, Contract</p><p>Salary: $60.00 &#x2013; $80.00 per hour</p><p>Work Eligibility:</p><ul><li>Permitted to work permanently with no restriction on hours (e.g. citizen, permanent resident) (Preferred)</li></ul><p>Work Remotely:</p><ul><li>Temporarily due to COVID-19</li></ul>"},{"link":"https://au.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0D0yzha0SzxrkluqSu_7KcBwaEX4S0HCLCxHwrkPccZ5lUkdHsev7jJ3_yuOXMdi-3J7k5Ea4d8wRpCqpRu4WSrFHRmnx2fZPJDeMPRz_0F4XGtME1EG0pZSwyf8QC9AVNUQ-gZi2FQGTMxUOIZFE3D8xS6e58tXiPGrfOpPD5JrKFmFXiGkAAD9OYeKjiNj9BltucllDKTRkWQ5N-gHtLXEeyD0RnySL_48GtMybcG2_BRPdSDZzVv_Whdyp_1EKGd8H-BG4ZcFQjWu2WOIo01EwNxNloWY2mg3-H4PIxKOIJZPOMF_rbfJ0aw3jWJSu9ikwO1x5qK3Zd733Bb5l336p7zOCXqEYT2FJjK7wq_9qMhUh2DPfASRQcKGI38VxItzgLLomNZvjPOyWptVkzF2WDWXnQeo2EYXvFntjbjHZun0-B1javklug53IdXboo=&p=5&fvj=1&vjs=3","name":"Software Engineer","companyName":"Oberix Group","time":"1 day ago","area":"Melbourne VIC","country":"Australia","description":"<p>About us:</p><p>We are a diversified building technologies group who, in Australia, have developed a building integration and energy management that is enjoying both domestic and international growth. We work on the leading edge of technology and are highly respected in this field. Our team of experts are involved in developing and integrating the various software applications to provide customised solutions.</p><p>The role:</p><p>We currently have an opportunity for a driven, enthusiastic and highly independent developer to join our existing team in our Burwood office. You will be working in a dynamic, challenging and fast paced environment and will be supporting and developing a system currently deployed locally and internationally. You will get exposure to the full development life-cycle and provide support to our team of engineers where required.</p><p>About you:</p><p>You will have a background and a true passion for software/computer science preferably with a degree or similar in a relevant field, Strong programming knowledge, problem solving and versatility will see you succeed in this role. .</p><p>As a minimum, you will:</p><ul><li>3 years post graduate experience in software development in relevant/similar industry</li><li>Sound experience developing in Typescript or Javascript.</li><li>Strong experience with state management services such as Redux or Mobx</li><li>Confident within HTML5, CSS3 and Javascript in general</li><li>Experience with development and management tools such as Jira, Jenkins, Bitbucket and more.</li><li>Be highly organised and logical</li><li>Be able to assess needs and design goals of products</li><li>Be a pragmatic thinker who truly seeks to find solutions beyond the norm.</li><li>Have a high level of passion and dedication.</li></ul><p>Other skills preferred:</p><ul><li>Experience and/or certification with cloud based development services such as AWS or GCP</li><li>React experience</li><li>Experience within a support environment</li><li>Other programming languages/frameworks such as Java, C, or Node.js.</li></ul><p>If you are excited and passionate about technology, have a willingness to continue to learn and grow your skill set within a collaborative team environment then please apply online submitting a cover letter and a current CV. <i>Please note that due to the high volume of applications expected only those shortlisted will be contacted for a phone screen.</i></p><p>Job Types: Full-time, Permanent</p><p>Salary: $60,000.00 &#x2013; $75,000.00 per year</p><p>Experience:</p><ul><li>software development: 2 years (Preferred)</li></ul><p>Work Eligibility:</p><ul><li>Permitted to work permanently with no restriction on hours (e.g. citizen, permanent resident) (Preferred)</li></ul><p>Work Remotely:</p><ul><li>No</li></ul>"},{"link":"https://au.indeed.com/rc/clk?jk=3e45559ead91e15b&fccid=cbf3e3191bef0f2d&vjs=3","name":"Javascript / Node JS Developer $150K+super","companyName":"Command Group","time":"9 days ago","area":"Melbourne VIC","country":"Australia","description":"<div><ul><li>Senior Full Stack React Developer</li>\n<li>Senior Front-end Javascript Graph QL</li>\n<li>Government Department Melbourne CBD</li>\n</ul>\n<br>\n<b>Javascript / Node JS Developer $150K+super</b><br>\n<br>\nSenior React / Full-stack Developer needed for this awesome Digital Startup company. Lots of perks here and no red tape holding you back.<br>\n<br>\n<b>Strong JavaScript and React along with any NODE or other back-end tech.</b><br>\n<br>\nYou will be required to build a new UI / Frontend by well funded and fast growing scale up company.<br>\n<br>\n<b><i>Key Skills:</i></b><br>\n<ul><li>Strong core JavaScript skills and NODE JS</li>\n<li>Proven development skills with modern JavaScript frameworks ideally React / ReactJS or (Vue.js or AngularJS) who would like to work with React</li>\n<li>HTML5/CSS3</li><br>\n</ul><br>\n<br>\n<b>APPLY! Perm + Equity + Bonus. $150K+super Melbourne CBD</b></div>"},{"link":"https://au.indeed.com/company/Avocado-Consulting/jobs/Full-Stack-Developer-dd73b29d2178de26?fccid=1b94b7b3af4a9ccc&vjs=3","name":"Full-Stack Developer (Java and React)","companyName":"Avocado Consulting","time":"10 days ago","area":"Sydney NSW","country":"Australia","description":"<ul><li>Government Industry &#x2013; Big digital project</li><li>Sydney CBD location/ Work from Home options</li><li>3-month initial contract (View to extend for another 6 months)</li></ul><p>At Avocado we truly believe there is no limit to our clients and consultants potential. Our professional services and tailored IT solutions help organisations to optimise, accelerate and transform their IT to increase productivity, reduce costs and deliver exceptional customer experiences.<br>We are looking for a Full-Stack Java Developer to join a new development team for one of our main state government clients. You will join a team of developers, testers, UX designers and product managers for a major digital project.</p><p>Your technical skills will include:</p><ul><li>Java, Spring Framework and Spring Boot</li><li>Experience using Hibernate</li><li>Proficient in HTML5, CSS3 and responsive design</li><li>Basic understanding of Git for source control</li><li>Experience with TDD (Test Driven Development)</li><li>Comfortable with Paired Programming</li><li>Experience with React or Node.JS or Golang is a bonus but not essential</li><li>Exposure to MySQL/MariaDB</li><li>Experience in an Agile environment</li></ul><p>If you are interested in this Java Full-stack development role, then hit the &quot;APPLY Now&quot; button. Please be advised that we need the ideal candidate to be able to start work in the next 1-2 weeks.</p><p>Contract length: 3 months</p><p>Job Types: Full-time, Contract</p><p>Salary: $750.00 &#x2013; $800.00 per day</p><p>Work Eligibility:</p><ul><li>Permitted to work permanently with no restriction on hours (e.g. citizen, permanent resident) (Preferred)</li></ul><p>Work Remotely:</p><ul><li>Temporarily due to COVID-19</li></ul>"},{"link":"https://au.indeed.com/rc/clk?jk=e760a02ab15f3570&fccid=71e4cc8ec29fd251&vjs=3","name":"Full stack engineer","companyName":"Linktree","time":"11 days ago","area":"Remote","country":"Australia","description":"<div><p>There are a lot of things we think are great about working at Linktree but we are biased, so here are the answers to the things we get asked most by Engineers when we are hiring at Linktree:<br>\n<br>\n<b>What is your tech stack?</b><br>\nThe below doesn&apos;t mean we expect everyone to have all of the below, our primary languages are react, node.js with some legacy PHP so that is great to have as a starting point.<br>\nThe rest of our stack includes React, Node.js, Typescript, Storybook, Elasticsearch, REST APIs, PostgreSQL, GraphQL, AWS (Lambda), Kubernetes, Terraform and Snowflake. Our first build was in PHP so that is in our legacy code but React/Node is where the stack is headed.<br>\n</p>\n<p><b>\nWhat do you look for in engineers?</b></p>\n<p>\nGreat problem solvers who enjoy collaborating with others (not just engineers) that value well written and tested code. A match with our current tech stack and the ongoing desire to continue to learn new skills and share yours with others. Experience in similar startup environments can be good as you are used to this style of working but we care more about you and your skills over what names are on your CV.<br>\n<br>\n<b>Where is this role based?</b><br>\n</p>\n<p>\nWe are mostly based in Melbourne but currently have engineers in Perth, Tasmania, Newcastle, Queensland, country Victoria, and Ireland. Our CTO Mitch Malone is also fully remote so you could be anywhere really. We are still all working from home due to COVID but plan on being a mixed remote and on-site company beyond that.<br>\n<br>\n<b>What is your dev environment like?</b><br>\nLinktree has grown a lot and quite quickly, which means our structures and processes aren&apos;t perfect, yet. That should be ok with you and if anything, appeal to you so you can contribute to the design of those systems.<br>\nWe are agile with one of our Lead Engineers also an agile coach and cross-functional. We don&apos;t have BA&apos;s or have any intention of hiring in the near future, as we expect our Engineers to do requirements analysis and work closely with Product Managers and Designers on developing user stories. Our Engineering team writes unit, integration and e2e tests and we have a DevOps specialist building out DevOps practices.<br>\n<br>\n<b>What is your company culture like?</b><br>\n</p>\n<p>\nLinktree&apos;s company culture and values are based around collaboration, diversity, inclusion, and flexibility. Those are all nice words but to give you some more specific examples:</p><br>\n<p></p><ul><li>\nWe are family-friendly and flexible work environment with our team with a number of our team working hours around school and home commitments</li><li>\nWe have several diversity and inclusion initiatives underway, including a D&amp;I council, training for all staff on neurodiversity and the incorporation of a transgender inclusion policy</li><li>\nOur team is diverse across age, gender, and race and we love that</li><li>\nDue to COVID we are all remote but even when COVID is behind us, we will be a mixed remote and in-office company. With our team already spread across 8 locations and 3 countries, we will always be some form of remote.</li><li>\nAll employees have free access to https://www.smilingmind.com.au/ &amp; https://uprise.co/, including 1:1 coaching sessions from qualified psychologists or counselors.<br>\n<br>\nWe have grown quickly in 2020, from 20 people to 40 in the past 6 months, and have more growth planned due to the continued expansion of our customer base around the world.</li></ul><br>\n<p></p><p><b>\nThe Linktree story&#x2026;</b></p><br>\n<p></p><p>\nThe Linktree journey begins in 2016, when co-founders Alex, Anthony and Nick were running a digital agency and using Instagram to make announcements about the artists they managed. Created as a side hustle to solve a simple problem, Linktree has well outgrown its roots, with over 7 million users worldwide, 20,000 + new signups every day, and over 120 million unique views per month. Paired with rapid growth, Linktree has recently garnered much attention in the tech world, earning 4th place on Fast Company&apos;s &quot;10 most innovative social media companies of 2020&quot;.</p><br>\n<p></p><p>\nThe Linktree audience is broad, spanning publications, artists, celebrities, fashion and beauty influencers, YouTube stars, sports teams and household brands, right the way through to individuals with a side hustle and micro-influencers. Linktree subscribers include Alicia Keys, Selena Gomez, Pharrell, Jamie Oliver, Vice, Red Bull, Adult Swim, Patreon, Naomi Campbell, Comedy Central, Gordon Ramsay, Billabong&#x2026;and many more!</p><br>\n<p></p><p>\nIf you&apos;re still reading this and feel like you&apos;re a match for us, please send your details through via the apply button or to mitch@linktr.ee</p></div>"},{"link":"https://au.indeed.com/rc/clk?jk=ce5ebebd917c567c&fccid=414e3518d9d6b338&vjs=3","name":"Junior- Mid React developer","companyName":"Harvey Nash","time":"3 days ago","area":"Sydney NSW","country":"Australia","description":"<div><ul><li>Financial services</li>\n<li>Sydney location</li>\n<li>Permanent position</li>\n</ul>\n<br>\nOur client is an<b> award-winning global </b>business and they are currently growing their team and looking for a<b> Senior React developer</b> in <b>Sydney.</b><br>\n<br>\nYou will design, develop and deploy <b>React applications</b> and continuously improve their product by innovating through the usage of <b>tests</b>. You will also work closely with other engineers and become a valued member of an autonomous, cross-functional team and take operational responsibility for the services that are owned by your team.<br>\n<br>\n<b>Requirements:</b><br>\n<ul><li>1+ years of experience <b>React - must</b></li>\n<li>Experience in <b>Node JS - beneficial</b></li>\n<li>Experience developing <b>commercial apps</b></li>\n<li>Knowledge or experience working in <b>Microservices</b> - Beneficial</li>\n<li>Experience working with <b>GIT, AWS </b>and<b> Docker - beneficial</b></li>\n<li>Experience using <b>Mongo DB</b>.</li>\n</ul><ul><li>It is a permanent position.</li></ul><br>\nPlease APPLY if interested and I will contact you to give more information about the role.</div>"},{"link":"https://au.indeed.com/rc/clk?jk=c7860d2e5d10aa50&fccid=c90e910978217fed&vjs=3","name":"Senior Node.JS Developer Brisbane | Permanent - Full time","companyName":"Peoplebank","time":"12 days ago","area":"South Brisbane QLD","country":"Australia","description":"<div><p>We&apos;re exclusively hiring for Coviu, a fast growth and well-funded start-up who provide a global telehealth platform, allowing doctors to run their practices whilst consulting seamlessly and securely with patients online. They have been steadily growing, however the Covid 19 outbreak has seen them grow rapidly from hundreds of customers per week signing up, to now thousands. At the current customer growth rate, they expect to have 50,000 customers using their product in the coming weeks.</p><p>\nWe are looking for a superstar who can cope with the significant high demands of this rapidly growing business and help them approach best practices and implement solutions fast to help scale their platform.</p><p>\nCoviu was first created within the Australian research organisation CSIRO as part of research into telehealth delivery platforms. Working closely with clinicians, they found that existing consumer video calling software and corporate video conferencing applications were not appropriate for healthcare services. Not only did they not satisfy the stringent security and privacy requirements of healthcare businesses, but they missed important business functions such as collecting payments, making appointment bookings, and gathering patient consent.</p><p><b>\nThe Tech:</b></p><p>\nAs a full stack developer, you&apos;ll be working across the front-end and back-end software stack, with a focus on back-end.</p><p>\nThe back-end is Node.js primarily, with some servers using Scala and Haskell. They follow a micro services architecture since the backend services that power video consultations scale in a diverse manner. Everything is built around APIs. The local development environment is spun up using Docker images to allow you full control. They follow a continuous integration and continuous delivery approach with a vast automated test suite and an automated deployment pipeline into AWS. You&apos;ll be working across most of the Coviu platform components, including their WebRTC based video conferencing solution, third party integrations, and their internal and external applications.</p><p>\nCoviu&apos;s client facing web application is built with a particular focus on a top notch user experience. Built on the React and Mercury frameworks, they follow modern responsive design principles. Mobile apps are build using react-native.</p><p>\nYou&apos;ll also be helping to build Coviu&apos;s engineering culture by identifying and communicating best practices, and participating in code reviews.</p><p>\n</p><p><b>What we&apos;re looking for:</b></p><p>\nAs Coviu&apos;s stack is heavily based on Javascript technologies, you will have:</p><ul><li>\nExperience as a full stack engineer delivering production ready systems using modern Javascript</li><li>\nA deep understanding of software engineering fundamentals</li><li>\nProven debugging and troubleshooting skills</li><li>\nExcellent communication skills and the ability to contribute as part of a team</li><li>\nA love of clean, maintainable code</li><li>\nBe able to build simple, elegant solutions that strike the balance between perfection and shipping things quickly.</li></ul><p>\n</p><p>They are looking for engineers who love to learn and are keen to get stuck in, while taking</p><p>\nresponsibility for delivering a quality product.</p><p>\n</p><p>This opportunity is an excellent opportunity for an outstanding Senior Developer/Lead developer to join one of Australia&apos;s leading telehealth platforms, and apply your skills to make a real difference. You will be making a huge contribution and helping the greater community by making these consults more accessible.</p><p>\nYou will contribute to the growth and development of this business. Please contact <b>Bharti</b> on <b>07 3003 7643</b> quoting reference number #202466 for more information, or click the link to apply!</p></div>"},{"link":"https://au.indeed.com/rc/clk?jk=f78eec565a3c74fa&fccid=a1981174903a7c67&vjs=3","name":"node.JS Developer","companyName":"Milestone IT","time":"10 days ago","area":"Melbourne VIC","country":"Australia","description":"<div><ul><li>True Career Opportunity</li><li>\nImmidiate Start</li><li>\nFantastic Working Environment</li></ul><p>\nMilestone IT is currently working with this brilliant global business who right now has an exciting opportunity for an experienced node.JS Developer to join a great team.</p><p><b>\nKey Responsibilities include:</b></p><ul><li>\nProvide well documented, high performance, reliable, maintainable codes</li><li>\nYou will be involved in delivering APIs and maintain backend services</li><li>\nContinually perform code reviews and knowledge transfers to other developers</li><li>\nProvide technical research and advice to the technical lead</li><li>\nAdhere to the team&#x2019;s agile practices</li><li>\nImprove the performance, security, reliability, and maintenance of the platform</li><li>\nBuilding backend services for IOS and Android apps</li><li>\nMicroservice design &amp; architecture experience</li><li>\nProvide a solution architecture for small features</li></ul><p><b>\nSkills we are looking for:</b></p><ul><li>\nYou must have a node.JS development experience</li><li>\nUsing your skills to develop in node.JS / React/ Javascript</li><li>\nExperience in integrating with external/partner APIs and systems</li><li>\nUnderstanding of key concepts of modern web development</li><li>\nSomeone who has 2-7 years of web development experience</li><li>\nSomeone looking for a role that allows them to learn the new technologies</li><li>\nWell presented, hardworking and enjoys working in a Team</li><li>\nPossess great written and verbal communication skills.</li><li>\nWork well independently and productively within a small team environment.</li></ul><p>\n</p><p>This is a fantastic opportunity for someone looking for a challenging and exciting opportunity. Please note, candidates will receive an immediate response.</p><p>\n</p><p>To apply online, please click on the appropriate link below. Alternatively, for a confidential discussion, please contact [Sam Menon] on [03-96706682].</p></div><p></p>"},{"link":"https://au.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0Bq3KIkuztGbb3PuofszmmO5MErqo0frURjvhurDL6Of9IjBGkv7DUmsKoeyovPaDt1JT0VZalJy_TLZfdJ6OVNlu_1kvAvhRUSaGXZjYF_Lxj3PFERINMtkR9JgbGb-5bvvxnFSEhK8GUeIaT_wT2r5czAOceO7HrkitIdPPYyyvoydbLoCtwrm9gxi1h3TGi08s_x2GxHJ-E2zYesI123-aAvu_XeFsTgmiwoAJt7Q2WOsrP_1Dxj7cpNpqJrBdRGXOFtvfaepmzupQpv1Dm0PaezJVDiGoxB5_GPTxZ_hpwzVvz_IxMm7MUAdmEhZ6qcbYBWvkgbdjbZ3uTCgW7mdxTVNvJRokRpQBQVqCrpbsJfC_pxgivyaRJ6BDjhicEm_MSqahUX12vZiapRzihHPaGtG1BWSCcF9LCEjGxVXaeuA6GSqVHh2NlNLWX_RQgJCBjMmrdEUQ==&p=12&fvj=1&vjs=3","name":"Senior Software Engineer","companyName":"Tornelo","time":"1 day ago","area":"Melbourne VIC","country":"Australia","description":"<p>Tornelo was created in 2008, but relaunched in March 2020 when Covid-19 changed the way the world thought about chess tournaments. We are seeing rapid growth as we hit developmental and business milestones. In August 2020 we secured a endorsement as the official Event Management Platform of the European Chess Union, representing ~70% of the world&apos;s FIDE rated chess players.</p><p>We&apos;re firmly focused on ensuring Tornelo becomes the most used chess tournament management platform around the world, be that for online, offline or hybrid tournaments.</p><p>In order to do this, we must ensure the whole of Tornelo&apos;s web experience and presence is top-notch, seamless, delightful to the customer, and built on a scalable platform and infrastructure to ensure mission critical, real-time live event stability.</p><p>In this role, not only will you be able to get your hands on a wide range of web technologies within a small, high performance team - you will also have an impact across the business while working to ensure we&apos;re creating, developing and continuing to deliver the rich web experience our users know and love.</p><p>Responsibilities</p><ul><li>Improve and build out brand-new features in Tornelo</li><li>Refactor, extend or improve aspects of Tornelo&apos;s event management application, online games platform and rating system to meet business requirements</li><li>Bring new ideas to the table concerning everything from feature development, process improvement, and product suggestions</li><li>Develop solutions you&#x2019;ve designed from the ground up through to deployment into production</li><li>Identifying and addressing performance bottlenecks within the application and broader infrastructure</li><li>Provide mentorship and guidance to junior devs</li><li>Participate in interviews, code reviews, business planning and strategy sessions</li><li>Performance debugging, benchmarking, and building awesome things in general</li><li>Potentially, to lead a small dev team as we grow</li></ul><p>Requirements</p><ul><li>Experience building complex and high-traffic based web portals, applications, and products.</li><li>Strong collaboration and communication skills.</li><li>Extensive experience working in a full stack environment and specific experience with:</li></ul><p>- TypeScript / React<br>- Node JS<br>- Docker / AWS</p><ul><li>Demonstrated timely delivery of project results</li></ul><p>Nice-to-haves</p><ul><li>Passion for chess or other games</li><li>Experience playing in tournaments</li><li>Rails</li><li>Websockets</li></ul><p>Job Types: Full-time, Permanent</p><p>Salary: $95,000.00 &#x2013; $161,193.00 per year</p><p>Work Eligibility:</p><ul><li>Permitted to work permanently with no restriction on hours (e.g. citizen, permanent resident) (Preferred)</li></ul>"},{"link":"https://au.indeed.com/rc/clk?jk=c7777cbbe6365ce4&fccid=f01c2f55ec3054bf&vjs=3","name":"Senior Front End Engineer - Angular.js/React.js","companyName":"Robert Walters","time":"2 days ago","area":"Sydney Central Business District NSW","country":"Australia","description":"<p></p><div><ul><li>Greenfield Projects in the Biosecurity Sector</li>\n<li>3D Computer Vision, UI, Image Processing</li>\n<li>AngularJS, Node.js, Elasticsearch, Docker/Kubernetes</li>\n</ul><p></p><p>\nOur Science and Technology team are looking to build a new team of Software Engineers tasked with developing X-Ray machines focusing on inspection, identification, detection of illegal goods through border security. The Software, Algorithm and Deep Learning team have been filled up and now we are looking to bring on Full-Stack and CI/CD Engineers.\n</p><p></p><p><b>1. Project 1</b></p>\n<ul>\n<li>Full Stack - Entirely greenfield.\n</li><li>Node.js, AngularJS, Elasticsearch, Docker, Kubernetes</li>\n<li>3D and build UI work-flow, utilise elasticsearch and dashboard technology, single page applications</li>\n<li>Work on Docker/Kubernetes integration on Linux and Windows operating systems</li>\n</ul>\n<p><b>2. Project 2</b></p>\n<ul>\n<li>C++, Python</li>\n<li>Computer Vision, Image Processing, Deep Learning</li>\n<li>Work with high performance imaging systems to meet real-time application performance requirements</li>\n<li>Cloud (AWS or Azure)</li>\n<li>CI/CD &amp; Containers (Docker/Kubernetes) Deployment</li>\n<li>Cyber Security &#x2013; platforms &amp; applications</li>\n</ul>\n<p><b>3. Project 3</b></p>\n<ul>\n<li>Deep Learning and Algorithms\n</li><li>Develop leading image quality, automated segmentation and classification algorithms based on analysis of x-ray images (single, dual and multi-energy multi-view transmission, backscatter, Computed Tomography, etc.) to meet real-time system performance requirements.</li>\n<li>Deep learning and machine vision, segmentation, feature extraction, statistical analysis, classifiers, hidden Markov models, wavelets or neural networks.</li>\n<li>Deep learning frameworks, image processing development toolkits (e.g. OpenCV, MATLAB) and open-source libraries desired.</li>\n</ul><p></p><p>\nAboriginal and Torres Strait Islander Peoples are encouraged to apply. To apply please click apply or call Ben Leighton on +61 2 82893139 for a confidential discussion.</p></div>\n<br>\n<ul><li>Greenfield Projects in the Biosecurity Sector</li>\n<li>3D Computer Vision, UI, Image Processing</li>\n<li>AngularJS, Node.js, Elasticsearch, Docker/Kubernetes</li></ul>"},{"link":"https://au.indeed.com/rc/clk?jk=98038da894af830c&fccid=a1981174903a7c67&vjs=3","name":"Fullstack web developer (Node/react)","companyName":"Milestone IT","time":"3 days ago","area":"Melbourne VIC","country":"Australia","description":"<div><ul><li>True Career Opportunity</li><li>\nImmidiate Start</li><li>\nFantastic Working Environment</li></ul><p>\nMilestone IT is currently working with this brilliant global business who right now has an exciting opportunity for an experienced node.JS Developer to join a great team.</p><p><b>\nKey Responsibilities include:</b></p><ul><li>\nProvide well documented, high performance, reliable, maintainable codes</li><li>\nYou will be involved in delivering APIs and maintain backend services</li><li>\nContinually perform code reviews and knowledge transfers to other developers</li><li>\nProvide technical research and advice to the technical lead</li><li>\nAdhere to the team&#x2019;s agile practices</li><li>\nImprove the performance, security, reliability, and maintenance of the platform</li><li>\nBuilding backend services for IOS and Android apps</li><li>\nMicroservice design &amp; architecture experience</li><li>\nProvide a solution architecture for small features</li></ul><p><b>\nSkills we are looking for:</b></p><ul><li>\nYou must have a node.JS development experience</li><li>\nUsing your skills to develop in node.JS / React/ Javascript</li><li>\nExperience in integrating with external/partner APIs and systems</li><li>\nUnderstanding of key concepts of modern web development</li><li>\nSomeone who has 2-7 years of web development experience</li><li>\nSomeone looking for a role that allows them to learn the new technologies</li><li>\nWell presented, hardworking and enjoys working in a Team</li><li>\nPossess great written and verbal communication skills.</li><li>\nWork well independently and productively within a small team environment.</li></ul><p>\n</p><p>This is a fantastic opportunity for someone looking for a challenging and exciting opportunity. Please note, candidates will receive an immediate response.</p><p>\n</p><p>To apply online, please click on the appropriate link below. Alternatively, for a confidential discussion, please contact [Sam Menon] on [03-96706682].</p></div><p></p>"},{"link":"https://au.indeed.com/rc/clk?jk=e76caf75a9507024&fccid=f779b32d75dd6409&vjs=3","name":"Node.JS Developer","companyName":"Invenco","time":"9 days ago","location":"Auckland","area":"Auckland City","country":"Australia","description":"<div><p><b>About the role</b></p><p>\nWe have a lot happening at Invenco, and continue to grow in North America, APAC &amp; Europe. Our Software team are building new applications to support our customer - and it is a great time to join as a developer.<br>\n</p><p></p><br>\n<p>We are currently on the look out for a Node.JS Developer - this role will be responsible to design, build and maintain software solutions with a commitment to delivering quality solutions on time that meet or exceed the needs of our internal and external customers. The Node.JS Developer will be actively involved in:</p><ul>\n<li>Software development</li>\n<li>Software documentation</li>\n<li>Software testing</li>\n<li>Team mentoring</li>\n</ul><p><b>Skills &amp; Experience</b><br>\nWe are looking for a Node.JS Developer who is experienced in working on RESTful APIs in a service architecture, and experienced working in a cloud (ideally AWS) environment. The ideal candidate must understand Promises and Generators in addition to the traditional callback methodology. Experience using the Restify (as opposed to Express) package to facilitate the REST interfaces would be a must have. In addition to this, the right candidate will have:</p><ul>\n<li>Tertiary qualification in Computer Science or Information Technology, or equivalent practical experience.</li>\n<li>Advanced knowledge and experience in the following: JavaScript, - Node.js using Restify, - RESTful APIs, - PostgreSQL and Asynchronous programming techniques, Code versioning and revision systems such as GitHub</li>\n<li>Writing secure code that complies with appropriate standards and regulations</li>\n<li>Knowledge around PostreSQL for data, or other relational databases\n</li><li>Experience working within a Continuous Integration and Continuous Deployment environment.</li>\n<li>AWS, Azure or similar cloud technology experience</li>\n<li>Code versioning and revision systems such as GitHub</li>\n<li>If you have some Angular/React experience that will help our website guys, however this is not a primary focus</li>\n</ul><p></p><p><b>Please Note:</b><br>\nAs part of our recruitment process, a technical online test must be completed.\n</p><p>We will be considering applicants based locally due to the nature and urgency of this hiring. Citizenship, PR, Work visa or a Working Holiday Visa is required to apply.<br>\n<br>\n<br>\n</p><p><b>About Invenco\n</b><br>\nInvenco uniquely builds highly complex end-to-end payment solutions from hardware through the firmware and middleware stack plus cloud &#x2013; all under one roof. In revolutionising the global customer payment experience it&#x2019;s one of New Zealand&#x2019;s most awarded tech-companies &#x2013; including being named 2018 NZ Hi-Tech company of the year. We continue to attract world-class talent as Invenco faces exponential growth in APAC, EMEA, the US and Canada. There has never been a better time to join us as we expand our global development and applications team.</p><p></p><p><b>\nBenefits</b><br>\nWe&#x2019;re based on Auckland&#x2019;s North Shore just minutes from the Northern Motorway.<br>\nOur benefits include working with a great team, performance-based pay, training and development opportunities, challenging work, flexible work hours, paid birthday leave, discounted medical insurance, onsite gym and access to EAP services. We have a lot happening at Invenco and it&apos;s an exciting time to join as we expand globally.<br>\nwww.invenco.com</p></div>"},{"link":"https://au.indeed.com/rc/clk?jk=d67b29a4560c0b86&fccid=2ee6e0ffa01f6f80&vjs=3","name":"Senior Full Stack React / C#.Net Developer","companyName":"Sunstone Talent","time":"4 days ago","location":"Canterbury","area":"Christchurch","country":"Australia","description":"<div><div>An interesting client is looking for a Senior Full Stack React / C#.Net Developer to work on software product development in Christchurch.<br>\n<br>\nSolid C#.Net skills?<br>\n<br>\nLove React &amp; React Native?<br>\n<br>\nWhat you&#x2019;ll bring:<br>\n<br>\n<ul><li>BSc in Computer Science or BEng in Software Engineering or similar or not</li><li>5-6 years full stack software engineering experience in C#.Net / JavaScript</li><li>React &amp; Node.js experience</li><li>Docker &amp; Azure experience</li><li>Enjoy working in an Agile / Scrum team developing software products</li><li>Unit testing approach</li><li>Enjoy design / architecture conversations</li></ul>\n<br>\nWhat you&#x2019;ll get:<br>\n<br>\n<ul><li>Work on global software product development</li><li>Modern web application stack in the cloud</li><li>Very cool product suite&#x2026;apply to learn more</li><li>Excellent benefits package + training + flexible working</li></ul>\n<br>\nJoin a React web apps team working on an interesting product stack get in touch with Paul<br>\n<br>\nPlease send your CV with a short note to paul@sunstonetalent.com</div>\n<div><div><p>\nReturn to top IT Job List</p></div></div></div>"},{"link":"https://au.indeed.com/rc/clk?jk=2174493e1b824318&fccid=22f7ba07f9b31a96&vjs=3","name":"Senior Software Engineer","companyName":"Vacasa","time":"12 days ago","location":"Auckland","area":"Auckland City","country":"Australia","description":"<div><h3 class=\"jobSectionHeader\"><b>Why Vacasa</b></h3>\n<p>\nWe started with just one home and an idea: to bring homeowners and renters together with smart technology and caring local teams. Today, we&apos;re the largest full-service vacation rental company in the US thanks to the people who give us their best every day. You&apos;ll fit right in here if you&apos;re curious, collaborative, innovative, and thrive in a rapid-growth environment.</p>\n<h3 class=\"jobSectionHeader\"><b>\nWhy Software Engineering at Vacasa</b></h3>\n<p>\nDo you want to be part of an NZ team helping the largest vacation property management company in the US solve problems on a global scale? Are you excited to explore the benefits of scalability and performance by leveraging modern, cloud-based technologies? At Vacasa, we are constantly experimenting and fine-tuning our products. We value stability, security, and scalability.</p>\n<h3 class=\"jobSectionHeader\"><b>\nWhat we are looking for</b></h3>\n<p>\nVacasa is looking for passionate Senior Software Engineers for our fast-growing engineering organization. At Vacasa, we value team independence and ownership, rapid delivery and continuous improvement.</p>\n<p>\nIn this role, you would be part of a cross-functional team building scalable, cloud-native solutions to high-impact business problems. You&apos;ll be working with Node.js for back-end services and with React for front-end applications.</p>\n<h3 class=\"jobSectionHeader\"><b>\nWhat you&apos;ll do with your team</b></h3>\n<p>\nAs a Senior Software Engineer, you&apos;ll be a key member of your team, solving mission-critical problems and being a hands-on contributor to our ever-evolving systems. We believe to shine in this role, you&apos;re good at:</p>\n<ul>\n<li>Designing, architecting, and building software; applying current technology thinking and patterns to our business problems</li>\n<li>Guiding developers via code reviews, discussion and modeling of code that is easy to evolve and read</li>\n<li>Continuously learning new technologies and validating concepts in order to pick the right tool for the job</li>\n<li>Utilizing DevOps tools and practices for building, deploying, and maintaining software in production environments</li>\n<li>Participating and building a collaborative, productive culture around product-focused goals</li>\n<li>Building towards high quality standards and working with your team to create robust testing approaches</li>\n</ul><h3 class=\"jobSectionHeader\"><b>Skills you&apos;ll need</b></h3>\n<ul><li>5+ years of professional experience using two or more languages and working with multiple back-end data storage technologies</li>\n<li>Ability to write high-quality, well-tested code that places maintainability over cleverness; know when and what to optimize for in a given situation</li>\n<li>Adept at guiding technical direction within a cross-functional engineering team</li>\n<li>Experience in cloud platforms with Infrastructure as Code</li>\n<li>Experience and enthusiasm to mentor junior engineers</li>\n</ul><h3 class=\"jobSectionHeader\"><b>Nice to have</b></h3>\n<ul><li>Completed a B.S./M.S. in Computer Science (or equivalent work experience)</li>\n<li>Experience with React, Node.js, JavaScript/TypeScript</li>\n<li>AWS Serverless tech</li>\n<li>Mobile app development experience</li>\n<li>Experience in hospitality or travel industry</li>\n</ul><h3 class=\"jobSectionHeader\"><b>Working with us has its benefits</b></h3>\n<ul><li>Career advancement opportunities</li>\n<li>Flexible work environment</li>\n<li>A fancy new Macbook Pro</li>\n<li>Great colleagues and culture</li></ul></div>"},{"link":"https://au.indeed.com/rc/clk?jk=9747ef54bfbc9f0b&fccid=9955b58079548b77&vjs=3","name":"Senior Fullstack Developer","companyName":"Potentia","time":"9 days ago","location":"Auckland","area":"Auckland City","country":"Australia","description":"<div><div><p><b>Why you would like it:</b></p><ul><li><p>\nFintech product development, and your joining at the start of the journey!</p></li><li><p>\nBe front and center of a world first &amp; game changer!</p></li><li><p>\nFlexible and modern software development approach</p></li></ul><p><b>\nThe opportunity:</b><br>\n<br>\nYou will be joining a newly formed squad that has the backing to build a product from scratch that addresses a very interesting new marketplace in the financial services realm. You will be working closely with your team and the CTO, while helping to build production ready code and a highly scalable and secure product using modern JavaScript tools, frameworks and libraries.<br>\n<br>\nThis is the kind of product you can look back on in a few years and really feel like you have changed and positively contributed to the businesses landscape for the better.<br>\n<br>\n<b>Company profile:</b><br>\n<br>\nYou will most likely know Centrality for bringing together the brightest minds locally and internationally in the decentralised systems space. However, they also house and support the growth of a number of emerging startups (decentralised backing or not). Headquartered here in Auckland CBD, they are a modern product development shop with flexible working arrangements and a well grounded global culture.<br>\n<br>\n<b>The skillset:</b></p><ul><li><p>\nSenior level experience with:</p></li><ul><li><p>\nJavascript (Native)</p></li><li><p>\nReact (what they are currently using) - not worried if you can pivot quickly from another framework like Vue.js or Angular.js</p></li><li><p>\nNode.js</p></li><li><p>\nHTML, CSS</p></li><li><p>\nGood understanding and experience with Automated testing approaches</p></li><li><p>\nBonus: Can define and lead architectural conversations with minimal guidance</p></li></ul></ul><p><br>\nIf you are an open minded, motivated and practical Software Engineer with a particular flare for all things Fullstack JS and scalable products, then this opportunity will be one to go for!<br>\n<br>\nSend us your CV or if you meet the brief above and would like to ask some questions before applying, give Sam Nowell a call on 021673467.</p></div></div>\n<br><ul><li>Kaylee Robinson Executive Recruitment Assistant\n</li><li>kaylee@potentia.co.nz\n</li><li>09 600 3931</li></ul>"},{"link":"https://au.indeed.com/rc/clk?jk=6ddf673684af5a63&fccid=2ee6e0ffa01f6f80&vjs=3","name":"Intermediate Full Stack React / C#.Net Developer","companyName":"Sunstone Talent","time":"4 days ago","location":"Canterbury","area":"Christchurch","country":"Australia","description":"<div><div>An interesting client is looking for an Intermediate Full Stack React / C#.Net Developer to work on software product development in Christchurch.<br>\n<br>\nSolid C#.Net skills?<br>\n<br>\nLove React &amp; React Native?<br>\n<br>\nWhat you&#x2019;ll bring:<br>\n<br>\n<ul><li>BSc in Computer Science or BEng in Software Engineering or similar or not</li><li>3 years full stack software engineering experience in C#.Net / JavaScript</li><li>React &amp; Node.js experience</li><li>Docker &amp; Azure experience</li><li>Enjoy working in an Agile / Scrum team developing software products</li><li>Unit testing approach</li></ul>\n<br>\nWhat you&#x2019;ll get:<br>\n<br>\n<ul><li>Work on global software product development</li><li>Modern web application stack in the cloud</li><li>Very cool product suite&#x2026;apply to learn more</li><li>Excellent benefits package + training + flexible working</li></ul>\n<br>\nJoin a React web apps team working on an interesting product stack get in touch with Paul<br>\n<br>\nPlease send your CV with a short note to paul@sunstonetalent.com</div>\n<div><div><p>\nReturn to top IT Job List</p></div></div></div>"},{"link":"https://au.indeed.com/rc/clk?jk=a9eda0a3da55fd35&fccid=2ee6e0ffa01f6f80&vjs=3","name":"Lead Full Stack React / C#.Net Developer","companyName":"Sunstone Talent","time":"4 days ago","location":"Canterbury","area":"Christchurch","country":"Australia","description":"<div><div>An interesting client is looking for a Lead Full Stack React / C#.Net Developer to work on software product development in Christchurch.<br>\n<br>\nSolid C#.Net skills?<br>\n<br>\nLove React &amp; React Native?<br>\n<br>\nWhat you&#x2019;ll bring:<br>\n<br>\n<ul><li>BSc in Computer Science or BEng in Software Engineering or similar or not</li><li>6-8 years full stack software engineering experience in C#.Net / JavaScript</li><li>React &amp; Node.js experience</li><li>Docker &amp; Azure experience</li><li>Enjoy technical leadership, design &amp; architecture</li><li>Enjoy working in an Agile / Scrum team developing software products</li><li>Unit testing approach</li><li>Enjoy design / architecture conversations &amp; making technical decision making</li></ul>\n<br>\nWhat you&#x2019;ll get:<br>\n<br>\n<ul><li>Work on global software product development</li><li>Modern web application stack in the cloud</li><li>Very cool product suite&#x2026;apply to learn more</li><li>Excellent benefits package + training + flexible working</li></ul>\n<br>\nJoin a React web apps team working on an interesting product stack get in touch with Paul<br>\n<br>\nPlease send your CV with a short note to paul@sunstonetalent.com</div>\n<div><div><p>\nReturn to top IT Job List</p></div></div></div>"}]