[{"link":"https://nz.indeed.com/rc/clk?jk=e76caf75a9507024&fccid=f779b32d75dd6409&vjs=3","name":"Node.JS Developer","companyName":"Invenco","time":"10 days ago","location":"Auckland","area":"Auckland City","country":"New Zealand","description":"<div><p><b>About the role</b></p><p>\nWe have a lot happening at Invenco, and continue to grow in North America, APAC &amp; Europe. Our Software team are building new applications to support our customer - and it is a great time to join as a developer.<br>\n</p><p></p><br>\n<p>We are currently on the look out for a Node.JS Developer - this role will be responsible to design, build and maintain software solutions with a commitment to delivering quality solutions on time that meet or exceed the needs of our internal and external customers. The Node.JS Developer will be actively involved in:</p><ul>\n<li>Software development</li>\n<li>Software documentation</li>\n<li>Software testing</li>\n<li>Team mentoring</li>\n</ul><p><b>Skills &amp; Experience</b><br>\nWe are looking for a Node.JS Developer who is experienced in working on RESTful APIs in a service architecture, and experienced working in a cloud (ideally AWS) environment. The ideal candidate must understand Promises and Generators in addition to the traditional callback methodology. Experience using the Restify (as opposed to Express) package to facilitate the REST interfaces would be a must have. In addition to this, the right candidate will have:</p><ul>\n<li>Tertiary qualification in Computer Science or Information Technology, or equivalent practical experience.</li>\n<li>Advanced knowledge and experience in the following: JavaScript, - Node.js using Restify, - RESTful APIs, - PostgreSQL and Asynchronous programming techniques, Code versioning and revision systems such as GitHub</li>\n<li>Writing secure code that complies with appropriate standards and regulations</li>\n<li>Knowledge around PostreSQL for data, or other relational databases\n</li><li>Experience working within a Continuous Integration and Continuous Deployment environment.</li>\n<li>AWS, Azure or similar cloud technology experience</li>\n<li>Code versioning and revision systems such as GitHub</li>\n<li>If you have some Angular/React experience that will help our website guys, however this is not a primary focus</li>\n</ul><p></p><p><b>Please Note:</b><br>\nAs part of our recruitment process, a technical online test must be completed.\n</p><p>We will be considering applicants based locally due to the nature and urgency of this hiring. Citizenship, PR, Work visa or a Working Holiday Visa is required to apply.<br>\n<br>\n<br>\n</p><p><b>About Invenco\n</b><br>\nInvenco uniquely builds highly complex end-to-end payment solutions from hardware through the firmware and middleware stack plus cloud &#x2013; all under one roof. In revolutionising the global customer payment experience it&#x2019;s one of New Zealand&#x2019;s most awarded tech-companies &#x2013; including being named 2018 NZ Hi-Tech company of the year. We continue to attract world-class talent as Invenco faces exponential growth in APAC, EMEA, the US and Canada. There has never been a better time to join us as we expand our global development and applications team.</p><p></p><p><b>\nBenefits</b><br>\nWe&#x2019;re based on Auckland&#x2019;s North Shore just minutes from the Northern Motorway.<br>\nOur benefits include working with a great team, performance-based pay, training and development opportunities, challenging work, flexible work hours, paid birthday leave, discounted medical insurance, onsite gym and access to EAP services. We have a lot happening at Invenco and it&apos;s an exciting time to join as we expand globally.<br>\nwww.invenco.com</p></div>"},{"link":"https://nz.indeed.com/rc/clk?jk=85e48b45d10a99e7&fccid=9955b58079548b77&vjs=3","name":"Intermediate Developer","companyName":"Potentia","time":"8 days ago","location":"Auckland","area":"Auckland City","country":"New Zealand","description":"<div><div><p><b>Why you would like it:</b></p><ul><li><p>\nFintech product development, and your joining at the start of the journey!</p></li><li><p>\nBe front and center of a world first &amp; game changer!</p></li><li><p>\nFlexible and modern software development approach</p></li></ul><p><b>\nThe opportunity:</b><br>\n<br>\nYou will be joining a newly formed squad that has the backing to build a product from scratch that addresses a very interesting new marketplace in the financial services realm. You will be working closely with your team and the CTO, while helping to build production ready code and a highly scalable and secure product using modern JavaScript tools, frameworks and libraries.<br>\n<br>\nThis is the kind of product you can look back on in a few years and really feel like you have changed and positively contributed to the businesses landscape for the better.<br>\n<br>\n<b>Company profile:</b><br>\n<br>\nYou will most likely know Centrality for bringing together the brightest minds locally and internationally in the decentralised systems space. However, they also house and support the growth of a number of emerging startups (decentralised backing or not). Headquartered here in Auckland CBD, they are a modern product development shop with flexible working arrangements and a well grounded global culture.<br>\n<br>\n<b>The skillset:</b><br>\n<br>\nIntermediate level experience with:</p><ul><li><p>\nJavascript (Native)</p></li><li><p>\nReact (what they are currently using) - not worried if you can pivot quickly from another framework like Vue.js or Angular.js</p></li><li><p>\nNode.js</p></li><li><p>\nHTML, CSS</p></li><li><p>\nGood understanding and experience with Automated testing approaches</p></li></ul><p><br>\nIf you are an open minded, motivated and practical Software Engineer with a particular flare for all things Fullstack JS and scalable products, then this opportunity will be one to go for!<br>\n<br>\nSend us your CV or if you meet the brief above and would like to ask some questions before applying, give Sam Nowell a call on 021673467.</p></div></div>\n<br><ul><li>Kaylee Robinson Executive Recruitment Assistant\n</li><li>kaylee@potentia.co.nz\n</li><li>09 600 3931</li></ul>"},{"link":"https://nz.indeed.com/rc/clk?jk=a72eaf442faf6e84&fccid=41ddd2051fd057d1&vjs=3","name":"Full Stack Developer","companyName":"Open Polytechnic","time":"9 days ago","location":"Wellington","area":"Lower Hutt","country":"New Zealand","description":"<div><p><b>iQualify</b> is seeking an experienced <b>Full Stack Developer</b> who wants to be part of a successful and fast growing ed tech product. This role can be based in Lower Hutt or remotely.</p><p>\nWe&apos;re discovering how to make the world&apos;s most engaging vocational learning experience every day for hundreds of New Zealand businesses and hundreds of thousands of learners. Join the team that builds iQualify, New Zealand&apos;s fastest growing social learning platform.</p><p>\nBacked by 70 years of distance learning experience by The Open Polytechnic, New Zealand&apos;s specialist provider of open and distance learning, from certificate to diploma and degree level, and is internationally recognised in its field.</p><p><b>\nWhat&apos;s the role?</b></p><p>\nWe are looking for an experienced Full Stack Developer to join a broad product team with roles ranging from UX, visual design, learning design, customer experience and software development. You&apos;ll work with the team to ensure an engaging product is built and loved.</p><p><b>\nWhat you&apos;ll need:</b></p><ul><li>\nExtensive programming experience in web application development technologies including Angular, Node JS, Javascript, CSS, HTML(5)</li><li>\nExperience with lean, agile and XP development practices</li><li>\nExperience with NoSQL and other document databases</li><li>\nExperience with effective use of development platforms and tools</li><li>\nLoads of passion for helping build incredible learning experiences</li></ul><p><b>\nWe are looking for someone who:</b></p><ul><li>\nHas experience working with software platforms and tools to make people&apos;s lives easier</li><li>\nIs right at home troubleshooting and diagnosing potential issues. Diving into the technical detail is your thing.</li><li>\nHas well-developed problem solving skills - you&apos;ll need these every day</li><li>\nIs able to think proactively, anticipate problems and work with team members to implement innovative solutions</li><li>\nIs a results-orientated approach to initiative</li><li>\nHas great relationship building skills</li><li>\nLoves working with users to analyse, define and document requirements and specifications</li><li>\nHas excellent verbal and written communication skills that you&apos;ll demonstrate by writing an outstanding cover letter showing us why you&apos;re the person we&apos;re looking for. Wow us with your style.</li></ul><p><b>\nWhat&apos;s in it for you?</b></p><ul><li>\nWe provide a supportive and creative place to work developing learning solutions that help learners and our partners succeed</li><li>\nWe&apos;re equipped with coffee and frequent pet visitors</li><li>\nWe&apos;re located in the Hutt Valley if that&apos;s a bonus for you, or you can work from anywhere within NZ</li><li>\nYou&apos;ll be challenged and supported and be an integral part of a team developing the world&apos;s most engaging social learning platform.</li></ul><p>\nStill interested? We&apos;re keen for you to interview us. Hit the apply button.</p><p>\nApplications close midday Monday 5 October 2020. Please note only online applications will be accepted.</p></div>"},{"link":"https://nz.indeed.com/rc/clk?jk=724a808217b19204&fccid=41ddd2051fd057d1&vjs=3","name":"Site Reliability Engineer - Full Stack Developer","companyName":"Open Polytechnic","time":"6 days ago","location":"Wellington","area":"Lower Hutt","country":"New Zealand","description":"<div><p><b>iQualify</b> is seeking an experienced <b>Site Reliability Engineer - Full Stack Developer</b> who wants to be part of a successful and fast growing ed tech product. This role can be based in Lower Hutt or remotely.</p><p>\nWe&apos;re discovering how to make the world&apos;s most engaging vocational learning experience every day for hundreds of New Zealand businesses and hundreds of thousands of learners. Join the team that builds iQualify, New Zealand&apos;s fastest growing social learning platform.</p><p>\nBacked by 70 years of distance learning experience by The Open Polytechnic, New Zealand&apos;s specialist provider of open and distance learning, from certificate to diploma and degree level, and is internationally recognised in its field.</p><p><b>\nWhat&apos;s the role?</b></p><p>\nWe are looking for an experienced Site Reliability Engineer (SRE), to join a broad product team with roles ranging from UX, visual design, learning design, customer experience and software developers.</p><p><b>\nWhat you&apos;ll need:</b></p><ul><li>\nExtensive experience as a Full Stack Developer</li><li>\nExperience in production monitoring and service improvement</li><li>\nExperience in developing and delivering automation systems</li><li>\nExtensive programming experience in web application development technologies including Angular, Node JS, Javascript, CSS, HTML(5)</li><li>\nExperience with database application design and development in NoSQL and document data stores</li><li>\nExperience working within a team in applications development</li><li>\nExperience with effective use of development platforms and tools</li><li>\nGood experience with cloud platforms</li><li>\nExperience with lean, agile and XP development practices</li></ul><p>\n <b>We are looking for someone who:</b></p><ul><li>\nIs right at home troubleshooting and diagnosing potential issues. Diving into the technical detail is your thing</li><li>\nHas experience working with software platforms and tools to make people&apos;s lives easier</li><li>\nHas well-developed problem solving skills - you&apos;ll need these every day</li><li>\nIs able to think proactively, anticipate problems and work with team members to implement innovative solutions</li><li>\nHas plenty of opinions about how to make things better</li><li>\nIs a results-orientated approach to initiative</li><li>\nHas great relationship building skills</li><li>\nLoves working with users to analyse, define and document requirements and specifications</li><li>\nHas excellent verbal and written communication skills that you&apos;ll demonstrate by writing an outstanding cover letter showing us why you&apos;re the person we&apos;re looking for. Wow us with your style.</li></ul><p><b>\nWhat&apos;s in it for you?</b></p><ul><li>\nWe provide a supportive and creative place to work developing learning solutions that help learners and our partners succeed.</li><li>\nWe&apos;re equipped with coffee and frequent pet visitors.</li><li>\nWe&apos;re located out in the Hutt Valley if that&apos;s a bonus for you, or you can work from anywhere within NZ</li><li>\nYou&apos;ll be challenged and supported and be an integral part of a team developing the world&apos;s most engaging social learning platform.</li></ul><p>\nStill interested? We&apos;re keen for you to interview us. Hit the apply button.</p><p>\nApplications close midday Wednesday 7 October 2020. Please note only online applications will be accepted.</p></div>"},{"link":"https://nz.indeed.com/rc/clk?jk=2174493e1b824318&fccid=22f7ba07f9b31a96&vjs=3","name":"Senior Software Engineer","companyName":"Vacasa","time":"12 days ago","location":"Auckland","area":"Auckland City","country":"New Zealand","description":"<div><h3 class=\"jobSectionHeader\"><b>Why Vacasa</b></h3>\n<p>\nWe started with just one home and an idea: to bring homeowners and renters together with smart technology and caring local teams. Today, we&apos;re the largest full-service vacation rental company in the US thanks to the people who give us their best every day. You&apos;ll fit right in here if you&apos;re curious, collaborative, innovative, and thrive in a rapid-growth environment.</p>\n<h3 class=\"jobSectionHeader\"><b>\nWhy Software Engineering at Vacasa</b></h3>\n<p>\nDo you want to be part of an NZ team helping the largest vacation property management company in the US solve problems on a global scale? Are you excited to explore the benefits of scalability and performance by leveraging modern, cloud-based technologies? At Vacasa, we are constantly experimenting and fine-tuning our products. We value stability, security, and scalability.</p>\n<h3 class=\"jobSectionHeader\"><b>\nWhat we are looking for</b></h3>\n<p>\nVacasa is looking for passionate Senior Software Engineers for our fast-growing engineering organization. At Vacasa, we value team independence and ownership, rapid delivery and continuous improvement.</p>\n<p>\nIn this role, you would be part of a cross-functional team building scalable, cloud-native solutions to high-impact business problems. You&apos;ll be working with Node.js for back-end services and with React for front-end applications.</p>\n<h3 class=\"jobSectionHeader\"><b>\nWhat you&apos;ll do with your team</b></h3>\n<p>\nAs a Senior Software Engineer, you&apos;ll be a key member of your team, solving mission-critical problems and being a hands-on contributor to our ever-evolving systems. We believe to shine in this role, you&apos;re good at:</p>\n<ul>\n<li>Designing, architecting, and building software; applying current technology thinking and patterns to our business problems</li>\n<li>Guiding developers via code reviews, discussion and modeling of code that is easy to evolve and read</li>\n<li>Continuously learning new technologies and validating concepts in order to pick the right tool for the job</li>\n<li>Utilizing DevOps tools and practices for building, deploying, and maintaining software in production environments</li>\n<li>Participating and building a collaborative, productive culture around product-focused goals</li>\n<li>Building towards high quality standards and working with your team to create robust testing approaches</li>\n</ul><h3 class=\"jobSectionHeader\"><b>Skills you&apos;ll need</b></h3>\n<ul><li>5+ years of professional experience using two or more languages and working with multiple back-end data storage technologies</li>\n<li>Ability to write high-quality, well-tested code that places maintainability over cleverness; know when and what to optimize for in a given situation</li>\n<li>Adept at guiding technical direction within a cross-functional engineering team</li>\n<li>Experience in cloud platforms with Infrastructure as Code</li>\n<li>Experience and enthusiasm to mentor junior engineers</li>\n</ul><h3 class=\"jobSectionHeader\"><b>Nice to have</b></h3>\n<ul><li>Completed a B.S./M.S. in Computer Science (or equivalent work experience)</li>\n<li>Experience with React, Node.js, JavaScript/TypeScript</li>\n<li>AWS Serverless tech</li>\n<li>Mobile app development experience</li>\n<li>Experience in hospitality or travel industry</li>\n</ul><h3 class=\"jobSectionHeader\"><b>Working with us has its benefits</b></h3>\n<ul><li>Career advancement opportunities</li>\n<li>Flexible work environment</li>\n<li>A fancy new Macbook Pro</li>\n<li>Great colleagues and culture</li></ul></div>"},{"link":"https://nz.indeed.com/rc/clk?jk=d67b29a4560c0b86&fccid=2ee6e0ffa01f6f80&vjs=3","name":"Senior Full Stack React / C#.Net Developer","companyName":"Sunstone Talent","time":"4 days ago","location":"Canterbury","area":"Christchurch","country":"New Zealand","description":"<div><div>An interesting client is looking for a Senior Full Stack React / C#.Net Developer to work on software product development in Christchurch.<br>\n<br>\nSolid C#.Net skills?<br>\n<br>\nLove React &amp; React Native?<br>\n<br>\nWhat you&#x2019;ll bring:<br>\n<br>\n<ul><li>BSc in Computer Science or BEng in Software Engineering or similar or not</li><li>5-6 years full stack software engineering experience in C#.Net / JavaScript</li><li>React &amp; Node.js experience</li><li>Docker &amp; Azure experience</li><li>Enjoy working in an Agile / Scrum team developing software products</li><li>Unit testing approach</li><li>Enjoy design / architecture conversations</li></ul>\n<br>\nWhat you&#x2019;ll get:<br>\n<br>\n<ul><li>Work on global software product development</li><li>Modern web application stack in the cloud</li><li>Very cool product suite&#x2026;apply to learn more</li><li>Excellent benefits package + training + flexible working</li></ul>\n<br>\nJoin a React web apps team working on an interesting product stack get in touch with Paul<br>\n<br>\nPlease send your CV with a short note to paul@sunstonetalent.com</div>\n<div><div><p>\nReturn to top IT Job List</p></div></div></div>"},{"link":"https://nz.indeed.com/rc/clk?jk=9747ef54bfbc9f0b&fccid=9955b58079548b77&vjs=3","name":"Senior Fullstack Developer","companyName":"Potentia","time":"9 days ago","location":"Auckland","area":"Auckland City","country":"New Zealand","description":"<div><div><p><b>Why you would like it:</b></p><ul><li><p>\nFintech product development, and your joining at the start of the journey!</p></li><li><p>\nBe front and center of a world first &amp; game changer!</p></li><li><p>\nFlexible and modern software development approach</p></li></ul><p><b>\nThe opportunity:</b><br>\n<br>\nYou will be joining a newly formed squad that has the backing to build a product from scratch that addresses a very interesting new marketplace in the financial services realm. You will be working closely with your team and the CTO, while helping to build production ready code and a highly scalable and secure product using modern JavaScript tools, frameworks and libraries.<br>\n<br>\nThis is the kind of product you can look back on in a few years and really feel like you have changed and positively contributed to the businesses landscape for the better.<br>\n<br>\n<b>Company profile:</b><br>\n<br>\nYou will most likely know Centrality for bringing together the brightest minds locally and internationally in the decentralised systems space. However, they also house and support the growth of a number of emerging startups (decentralised backing or not). Headquartered here in Auckland CBD, they are a modern product development shop with flexible working arrangements and a well grounded global culture.<br>\n<br>\n<b>The skillset:</b></p><ul><li><p>\nSenior level experience with:</p></li><ul><li><p>\nJavascript (Native)</p></li><li><p>\nReact (what they are currently using) - not worried if you can pivot quickly from another framework like Vue.js or Angular.js</p></li><li><p>\nNode.js</p></li><li><p>\nHTML, CSS</p></li><li><p>\nGood understanding and experience with Automated testing approaches</p></li><li><p>\nBonus: Can define and lead architectural conversations with minimal guidance</p></li></ul></ul><p><br>\nIf you are an open minded, motivated and practical Software Engineer with a particular flare for all things Fullstack JS and scalable products, then this opportunity will be one to go for!<br>\n<br>\nSend us your CV or if you meet the brief above and would like to ask some questions before applying, give Sam Nowell a call on 021673467.</p></div></div>\n<br><ul><li>Kaylee Robinson Executive Recruitment Assistant\n</li><li>kaylee@potentia.co.nz\n</li><li>09 600 3931</li></ul>"},{"link":"https://nz.indeed.com/rc/clk?jk=6ddf673684af5a63&fccid=2ee6e0ffa01f6f80&vjs=3","name":"Intermediate Full Stack React / C#.Net Developer","companyName":"Sunstone Talent","time":"4 days ago","location":"Canterbury","area":"Christchurch","country":"New Zealand","description":"<div><div>An interesting client is looking for an Intermediate Full Stack React / C#.Net Developer to work on software product development in Christchurch.<br>\n<br>\nSolid C#.Net skills?<br>\n<br>\nLove React &amp; React Native?<br>\n<br>\nWhat you&#x2019;ll bring:<br>\n<br>\n<ul><li>BSc in Computer Science or BEng in Software Engineering or similar or not</li><li>3 years full stack software engineering experience in C#.Net / JavaScript</li><li>React &amp; Node.js experience</li><li>Docker &amp; Azure experience</li><li>Enjoy working in an Agile / Scrum team developing software products</li><li>Unit testing approach</li></ul>\n<br>\nWhat you&#x2019;ll get:<br>\n<br>\n<ul><li>Work on global software product development</li><li>Modern web application stack in the cloud</li><li>Very cool product suite&#x2026;apply to learn more</li><li>Excellent benefits package + training + flexible working</li></ul>\n<br>\nJoin a React web apps team working on an interesting product stack get in touch with Paul<br>\n<br>\nPlease send your CV with a short note to paul@sunstonetalent.com</div>\n<div><div><p>\nReturn to top IT Job List</p></div></div></div>"},{"link":"https://nz.indeed.com/rc/clk?jk=a9eda0a3da55fd35&fccid=2ee6e0ffa01f6f80&vjs=3","name":"Lead Full Stack React / C#.Net Developer","companyName":"Sunstone Talent","time":"4 days ago","location":"Canterbury","area":"Christchurch","country":"New Zealand","description":"<div><div>An interesting client is looking for a Lead Full Stack React / C#.Net Developer to work on software product development in Christchurch.<br>\n<br>\nSolid C#.Net skills?<br>\n<br>\nLove React &amp; React Native?<br>\n<br>\nWhat you&#x2019;ll bring:<br>\n<br>\n<ul><li>BSc in Computer Science or BEng in Software Engineering or similar or not</li><li>6-8 years full stack software engineering experience in C#.Net / JavaScript</li><li>React &amp; Node.js experience</li><li>Docker &amp; Azure experience</li><li>Enjoy technical leadership, design &amp; architecture</li><li>Enjoy working in an Agile / Scrum team developing software products</li><li>Unit testing approach</li><li>Enjoy design / architecture conversations &amp; making technical decision making</li></ul>\n<br>\nWhat you&#x2019;ll get:<br>\n<br>\n<ul><li>Work on global software product development</li><li>Modern web application stack in the cloud</li><li>Very cool product suite&#x2026;apply to learn more</li><li>Excellent benefits package + training + flexible working</li></ul>\n<br>\nJoin a React web apps team working on an interesting product stack get in touch with Paul<br>\n<br>\nPlease send your CV with a short note to paul@sunstonetalent.com</div>\n<div><div><p>\nReturn to top IT Job List</p></div></div></div>"}]