[{"link":"https://au.indeed.com/rc/clk?jk=600e4302e45f31cd&fccid=a480db32c2e9c674&vjs=3","name":"React.js Front End Developer","companyName":"Appscore","time":"5 days ago","area":"Melbourne VIC","country":"Australia","description":"<div><p>Appscore is a leading product, design and innovation consultancy providing services that help transform and empower businesses. We work with Australia&apos;s leading enterprise companies (including NAB, Australia Post, MYOB, Carsales, Fitness First and many more) to provide meaningful contribution and value since 2009 our mission has been to change lives through amazing digital experiences, revolutionize our customer&apos;s businesses by creating game-changing technology and drive digital adoption by creating user value in everything we create.</p>\n<p>\nWe are looking to hire 2x Front End Developers to join our team.</p>\n<p><b>\nResponsibilities:</b></p>\n<ul>\n<li>Collaborate with the team to identify and solve challenging development problems</li>\n<li>Working on multiple new and existing projects, assisting in identifying and resolving bugs, performance code maintenance and while producing clean and reliable code at an advanced level.</li>\n<li>Assist in improving code reliability and performance.</li>\n<li>Contribute ideas for new features and identify areas for improvement proactively.</li>\n</ul>\n<p><b>Technical Skills:</b></p>\n<ul>\n<li>Microsoft stack (C#)</li>\n<li>CSS Processing (Saas)</li>\n<li>React JS</li>\n<li>Version control/Git</li>\n<li>Javascript (ES+6) for large-scale software development easier</li>\n<li>HTML5 / CSS 3</li>\n<li>Typescript</li>\n<li>Experience working within an Agile framework</li>\n<li>Jira and confluence integration</li>\n</ul>\n<p>We are fully remote at the moment, but hope to return to the office one day and as such we are looking to hire people in Melbourne. All interviews and your onboarding will be done remotely.</p></div>"},{"link":"https://au.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0CIodzRyOwMfVg4scQsdRG2CEjSZ-y-OPaM_IkxM84zTcFAhpkB9ckrE3-xoENJzpmxMhbrj9RVi4RHAX_Fu336Ob6zne0HdEz9cnWlnSRZ9RccnRbGEvpYe9b1wA6nNKmKJsCwxjZcy9bfFkKOUTWCeoN2d8kIfFz0R2oC16rTCdrDwEeEN0wuorWqgwmOUx9P_X5P-iePKe_Q53que1nGQfelNXHcnD_rGC83t4tIgfawlxo05hdzOBlKdFRgtynjubIgTNT_gVDeh6NN5xkamMV_FbhN95EHh2KjWLhAhVim2HRKZ36yA53Ir6j1QzJ_NBthv_af-CCyMyUJgb35vzls-usAOrb0D3P_eKUV9ixTUilFkqnohkAA0Z4tFY5F7irDtXq-3VoTOt7dNJ4xz5p2DnRLQFHrkNp7JDgmquVlSPhiVaBSdRx5HM4b5di9hBifxEBlM8yBECU2foEhJBO1RhfH1adjFxurlmsaiw==&p=1&fvj=1&vjs=3","name":"Fullstack Javascript Developer | React/Node.js","companyName":"Canibuild","time":"10 days ago","area":"Bella Vista NSW","country":"Australia","description":"<p><b>About us: </b></p><p>Canibuild (www.canibuild.com) helps the residential construction industry automate and improve how construction is sold, designed, and approved.<br>Work alongside a mix of embedded construction professionals and leading software developers to research and develop cutting edge applications.<br>Today, we are a growing SaaS start-up with a rapid subscriber user base from around the world including Australia, NZ, Canada, and the United States.</p><p><b>The Position: </b></p><p>We require a experienced Full-stack Developer to join a dynamic team of passionate programmers working on world-first technology. In this position, you will have the opportunity to develop innovative applications using various cutting-edge technologies and following Agile practices.<br>You&apos;ll be part of an agile and effective team as you build the product and integrate it into a disruptive SaaS application.</p><p><b>What technical skills will you need to succeed in this role?</b></p><ul><li>2+ years of Full Stack Development experience, using ReactJS/Redux/Hooks and Node.js/Express/Typescript</li><li>Solid experience with JavaScript, ES6, HTML5, CSS3 and responsive application design</li><li>Cross-browser, cross-platform, cross-device compatibility issues and ways to work around them</li><li>Rapidly prototype web applications to showcase new concepts and ideas</li><li>Suggests new technologies and approaches</li><li>Estimate the duration and level of effort of development tasks</li><li>Experience working with Agile methodologies</li><li>Understand modern development practices (CI/CD, Cloud, etc.)</li><li>Excellent problem-solving skills</li><li>Ability to meet deadlines, and work independently and within a team, with clear reporting and focused on results</li></ul><p><b>Desirable Experience: </b></p><p>Interactive map libraries such as Leaflet.js, GIS data handling (GeoJSON, shapefiles, etc.) and AWS</p><p>Job Types: Full-time, Permanent</p><p>Salary: $100,000.00 &#x2013; $140,000.00 per year</p><p>Experience:</p><ul><li>Javascript: 3 years (Preferred)</li><li>Full Stack: 2 years (Preferred)</li></ul><p>Work Eligibility:</p><ul><li>Permitted to work permanently with no restriction on hours (e.g. citizen, permanent resident) (Required)</li></ul>"},{"link":"https://au.indeed.com/company/Bookipi/jobs/Fullstack-Javascript-Developer-React-Node-Js-0fdd95d6bc31121b?fccid=b3a5d64c682dbf1f&vjs=3","name":"Fullstack Javascript Developer | React/Node.js","companyName":"Bookipi","time":"8 days ago","area":"North Strathfield NSW","country":"Australia","description":"<p><b>About Us: </b><br>Bookipi (Bookipi.com) is a leading business software company based in Sydney. Our apps are used by over 780,000 businesses across 179 countries and growing everyday.<br>We have an amazing team and aim to be the top in each category we compete in. Technical ability and culture fit are key across the team. We&apos;re excited to see what you&apos;ve got.</p><p><b>Job Role: </b></p><p><i>If you don&apos;t have one of the requirements, let us know why it doesn&apos;t matter.</i></p><p>We are looking for the right fullstack developer to join our fast growing team. We are looking for an exceptional problem solver who can deliver a top class code base.</p><p>In this position, you will develop innovative applications using cutting-edge technologies and learn from a diverse and experienced team.</p><p><b>Technical Requirements: </b></p><ul><li>Excellent ability to code in:</li></ul><p>ReactJS or React Native<br>Javascript<br>Node.JS<br>MongoDB</p><ul><li>3 years experience</li><li>Formal computer science or software engineering qualification is preferred but not required.</li><li>Experience debugging using popular JavaScript-based tools like Chrome Developer Console</li><li>Demonstrated experience and knowledge in server development and management</li></ul><p><b>Key Actions</b></p><ul><li>An ability to deliver in a fast-paced environment and continue to raise the bar at a high performing company.</li><li>Complete technical verification of design and architecture</li><li>Perform code reviews</li><li>Direct junior developers in their code development</li><li>Work with the team to solve technical difficulties and ascertain the best deployment approach when needed</li></ul><p><b>About you</b></p><ul><li>A desire and the ability to build something great.</li><li>An ability to effectively execute designated sprint schedules.</li><li>The willingness to learn and adapt your methodologies, and the ability to share your learnings with the team.</li><li>A team player who can communicate appropriately for the role.</li></ul><p><b>Do you fit?</b></p><p>We&apos;re seeking a suitably qualified and experienced full stack developer desired for immediate start.</p><p>You will work in a team responsible for delivering top-of-class software and testing services.</p><p>This is an opportunity to bring your skills and experience to an environment where you will make a difference. You are encouraged to take an innovative and proactive approach to your work with the support of a great team.</p><p>Expected Start Date: 12/10/2020</p><p>Job Types: Full-time, Permanent</p><p>Experience:</p><ul><li>javascript: 3 years (Preferred)</li></ul><p>Work Eligibility:</p><ul><li>Permitted to work permanently with no restriction on hours (e.g. citizen, permanent resident) (Preferred)</li></ul><p>Work Remotely:</p><ul><li>Temporarily due to COVID-19</li></ul>"},{"link":"https://au.indeed.com/rc/clk?jk=c7777cbbe6365ce4&fccid=f01c2f55ec3054bf&vjs=3","name":"Senior Front End Engineer - Angular.js/React.js","companyName":"Robert Walters","time":"2 days ago","area":"Sydney Central Business District NSW","country":"Australia","description":"<p></p><div><ul><li>Greenfield Projects in the Biosecurity Sector</li>\n<li>3D Computer Vision, UI, Image Processing</li>\n<li>AngularJS, Node.js, Elasticsearch, Docker/Kubernetes</li>\n</ul><p></p><p>\nOur Science and Technology team are looking to build a new team of Software Engineers tasked with developing X-Ray machines focusing on inspection, identification, detection of illegal goods through border security. The Software, Algorithm and Deep Learning team have been filled up and now we are looking to bring on Full-Stack and CI/CD Engineers.\n</p><p></p><p><b>1. Project 1</b></p>\n<ul>\n<li>Full Stack - Entirely greenfield.\n</li><li>Node.js, AngularJS, Elasticsearch, Docker, Kubernetes</li>\n<li>3D and build UI work-flow, utilise elasticsearch and dashboard technology, single page applications</li>\n<li>Work on Docker/Kubernetes integration on Linux and Windows operating systems</li>\n</ul>\n<p><b>2. Project 2</b></p>\n<ul>\n<li>C++, Python</li>\n<li>Computer Vision, Image Processing, Deep Learning</li>\n<li>Work with high performance imaging systems to meet real-time application performance requirements</li>\n<li>Cloud (AWS or Azure)</li>\n<li>CI/CD &amp; Containers (Docker/Kubernetes) Deployment</li>\n<li>Cyber Security &#x2013; platforms &amp; applications</li>\n</ul>\n<p><b>3. Project 3</b></p>\n<ul>\n<li>Deep Learning and Algorithms\n</li><li>Develop leading image quality, automated segmentation and classification algorithms based on analysis of x-ray images (single, dual and multi-energy multi-view transmission, backscatter, Computed Tomography, etc.) to meet real-time system performance requirements.</li>\n<li>Deep learning and machine vision, segmentation, feature extraction, statistical analysis, classifiers, hidden Markov models, wavelets or neural networks.</li>\n<li>Deep learning frameworks, image processing development toolkits (e.g. OpenCV, MATLAB) and open-source libraries desired.</li>\n</ul><p></p><p>\nAboriginal and Torres Strait Islander Peoples are encouraged to apply. To apply please click apply or call Ben Leighton on +61 2 82893139 for a confidential discussion.</p></div>\n<br>\n<ul><li>Greenfield Projects in the Biosecurity Sector</li>\n<li>3D Computer Vision, UI, Image Processing</li>\n<li>AngularJS, Node.js, Elasticsearch, Docker/Kubernetes</li></ul>"},{"link":"https://au.indeed.com/rc/clk?jk=6b90130463b9334e&fccid=79a4f894c1383f39&vjs=3","name":"Frontend Lead (React.js)","companyName":"FRG Technology Consulting","time":"11 days ago","area":"Melbourne VIC","country":"Australia","description":"<div><ul><li>Permanent Position, up to $180k + Super</li><li>\nSaaS-based organisation with a strong client-base</li><li>\nWork from home post-COVID</li></ul><br>\nFRG Technology Consulting in collaboration with our client who are a SaaS-based organisation in Melbourne are currently looking for Lead Frontend Developers with strong React.js experience to join their growing team on a permanent basis.<br>\n<br>\nYou&apos;ll be working with the existing development using modern technology whilst being an integral part of the organisation and reporting directly to the CTO whilst working on the latest projects directly on their platform.<br>\n<br>\n<b>Responsibilities:</b><ul><li>\nCollaborate with the team to identify and solve challenging development problems whilst contributing to mobile development to the highest standards.</li><li>\nWorking on multiple new and existing projects, assisting in identifying and resolving bugs, performance code maintenance and while producing clean and reliable code at an advanced level.</li><li>\nAssist in improving code reliability and performance.</li><li>\nContribute ideas for new features and identify areas for improvement proactively.</li></ul><br>\n<br>\n<br>\n<b>Key Skills:</b><ul><li>\n7+ Years of industry experience in Web OR Software Development</li><li>\nProficiency working with <b>React.js (At least 3+ Years)</b></li><li>\nProficiency working with <b>HTML5, </b><b>CSS3/SCSS </b>and <b>SASS</b></li><li>\nFluency working with<b> Flexbox</b> is a must</li><li>\nExperience working with <b>AWS</b> a bonus</li><li>\nCapable of leading/mentoring teams of developers (previous leadership experience not essential)</li></ul><br>\n<br>\n<br>\n<b>Whats on offer:</b><ul><li>\nCentral location, conveniently located and easily accessible.</li><li>\nInternal career advancement opportunities.</li><li>\nWork with a tight-knit, highly technical team and energetic team.</li><li>\nChance to work with the latest technologies on a growing SaaS-product</li></ul><br>\nThis position is interviewing now and is available for an immediate start.<br>\n*Please mention your <b>VISA Status/Working Rights</b> in your Resume *<br>\n<br>\nNeros Gorges<br>\n(03) 8592 0507<br>\nn.gorges@frgconsulting.com\n<br>\nhttps://www.linkedin.com/in/nerosgorges/</div>"},{"link":"https://au.indeed.com/rc/clk?jk=3b4f74348259ad48&fccid=085760c105545d7c&vjs=3","name":"Software Engineering Manager | Java / Microservices / React....","companyName":"TheDriveGroup","time":"9 days ago","area":"Sydney NSW","country":"Australia","description":"<div><b>Java </b><b>Engineering Manager | Sydney</b><br>\n<br>\nThis is a rare opportunity for an Engineering Manager, Head of Engineering or CTO level individual to join an established tech-driven company who has become a household name here in Australia!<br>\n<br>\nDue to growth and success, they are looking to expand their digital team over the next 6 months as they start and power through a Digital Transformation journey.<br>\n<br>\nWe are looking for someone with a strong background in Software Engineering working with the modern Java Stack and you don&apos;t mind jumping into the code/architecture every now and then.<br>\n<br>\nThis is a key position so requires someone who has the technical experience, drive, and leadership acumen to help steer product development and technical delivery successfully through a lean/agile product development process.<br>\n<br>\n<br>\n<b>What they can offer:</b><br>\n<ul><li>Join a fast-growing tech-driven business!</li>\n<li>Digital Transformation Journey!</li>\n<li>Exposure to enterprise/large scale products!</li>\n<li>Well established and very well funded business with a start-up vibe!</li>\n<li>Inherit and expand a very high-performance team!</li>\n<li>New modern offices fully kitted out!</li>\n<li>WFH (until end of the year)</li>\n<li>Tech-driven culture with a fun/flexible work environment!</li>\n<li>Latest tech, tools, equipment etc!</li>\n<li>Plenty of career progression and future opportunities offer!</li>\n</ul><br>\n<b>The Role:</b><br>\n<br>\nYou will join as an &apos;Engineering Manager&apos; and inherit and grow a mid-sized team of Software Engineers working across Java &amp; React.js.<br>\n<br>\nTo be successful you will need to have a number of years under your belt as a Senior Java Dev/Tech Lead/Architect (as the role will be around 20% hands-on) and you must currently work in a managerial role leading a decent sized team of Software Engineers.<br>\n<br>\n<b>Experience / Skills:</b><br>\n<ul><li>Digital Transformations &amp; Building Tech Roadmaps</li>\n<li>Stakeholder Management or Customer Facing</li>\n<li>Solution Architecture &amp; Microservices</li>\n<li>Cloud Platforms (GCP, AWS or Azure)</li>\n<li>React.js / Public-Facing Applications</li>\n<li>Agile / CI/CD / TDD / DevOps / Kubernetes</li>\n<li>Scalability, Performance, Security</li>\n<li>eCommerce, Payments, Transactions or High Traffic Systems</li>\n<li>Big Data &amp; Analytics Tools</li>\n</ul><br>\nWe&#x2019;re looking for someone who&#x2019;s excited about the prospect of helping scale an engineering team, and define the next steps of the business whilst working somewhere that has funding to invest in significant growth, innovation, and R&amp;D!<br>\n<br>\nThis is a role signed off and ready to go and the start date is ideally in the next 1-2 months.<br>\n<br>\nThe salary (+bonus) will match the experience and skillset you bring to the table.<br>\n<br>\nWe are really looking for someone who lives and breathes tech and wants to help others learn, grow, develop and build great things with great people!<br>\n<br>\nIt&#x2019;s a seriously exciting time to join this business, so if you are a CTO, Head of Engineering, Head of Technology, VP of Engineering, Development Manager or Engineering Manager - and you are driven, passionate about new tech, loves to learn new things and want to help solve interesting problems - please get in touch today!<br>\n<br>\n<b>Please Note:</b> You must be Sydney based to apply for this role and have AU Citizenship or PR.<br>\n<br>\n<b>Follow Us On Linkedin:</b><br>\nhttps://www.linkedin.com/company/thedrivegroup for The Latest Tech News, New Jobs &amp; Our $1000 &apos;Introduce A Friend&apos; Referral Fee!</div>"},{"link":"https://au.indeed.com/rc/clk?jk=51a71cf61a2d428f&fccid=31bd0f43a987f25b&vjs=3","name":"Front End Technical Lead / JS Engineer - React & Node","companyName":"Limelight Consulting Group Pty Ltd","time":"5 days ago","area":"Sydney NSW","country":"Australia","description":"<div><ul><li>Central CBD Location &amp; Excellent Salary</li>\n<li>Exciting Career Opportunity</li>\n<li>Highly Progressive Technical Environment</li>\n</ul>\n<br>\nAn Exciting &amp; Innovative FinTech SaaS Business Are Seeking A Technical Lead To Spearhead Their Front End Platforms across their varied product stack. Extensive knowledge across Javascript frameworks are key. Ideally - React.JS / Redux, but knowledge across Angular, Vue or Ember is well regarded.<br>\n<br>\nThis opportunity is centered around large re-platforming program of work and building out the key architecture and their front end frameworks. These cutting edge platforms will allow for much improved engagements with customers. This is a highly strategic role, with the successful person being a front end technologist, with a flair for delivery and building high quality frameworks and components.<br>\n<br>\nAs Tech Lead you will have responsibility for the platform, product road-map, architectural design, and the development environment. You&#x2019;ll bring a blend of leadership and strategic skills needed to be applied in a technical context. You will be hands-on in this role, while coordinating project teams across and being involved in the overall strategy for the front end standards and components.<br>\n<br>\nThis is an exciting role and offers the right person a very interesting space to carve out an exciting career. The right person to fill this role, will really help take this business to the next level.<br>\n<br>\n<b>Key Skills Experience:</b><br>\n<br>\n<ul><li>Highly experienced in Javascript, ES6+ development and building web applications</li><li>Have worked extensively with APIs and Micro Services Architectures. Plus knowledge around serverless architecture, design, building, testing, and deployment automation.</li><li>A solid grounding in Javascript frameworks. Ideally React.js and Redux. Other frameworks are well regarded - Angular / Ember</li><li>Have lead technical teams on medium to large sized project</li><li>Expert level CSS3 &amp; HTML5</li><li>Exposure to GraphQL is very advantageous</li><li>Any Agile knowledge is well regarded</li><li>Strong skills in Linux, MongoDB or CouchDB advantageous</li><li>Very strong communication skills - Written and oral</li></ul><br>\n<b>\nNice to Have:</b><br>\n<br>\n<ul><li>Have been involved in digital transformation transitions</li><li>Have experience working in SaaS Fintechs or Wealth Management environments</li></ul><br>\nTo find out more about this opportunity; please email: ds@limelightpeople.com.au or call: 02 8458 2626</div>"}]