[{"link":"https://nz.indeed.com/rc/clk?jk=e76caf75a9507024&fccid=f779b32d75dd6409&vjs=3","name":"Node.JS Developer","companyName":"Invenco","time":"9 days ago","location":"Auckland","area":"Auckland City","country":"New Zealand","description":"<div><p><b>About the role</b></p><p>\nWe have a lot happening at Invenco, and continue to grow in North America, APAC &amp; Europe. Our Software team are building new applications to support our customer - and it is a great time to join as a developer.<br>\n</p><p></p><br>\n<p>We are currently on the look out for a Node.JS Developer - this role will be responsible to design, build and maintain software solutions with a commitment to delivering quality solutions on time that meet or exceed the needs of our internal and external customers. The Node.JS Developer will be actively involved in:</p><ul>\n<li>Software development</li>\n<li>Software documentation</li>\n<li>Software testing</li>\n<li>Team mentoring</li>\n</ul><p><b>Skills &amp; Experience</b><br>\nWe are looking for a Node.JS Developer who is experienced in working on RESTful APIs in a service architecture, and experienced working in a cloud (ideally AWS) environment. The ideal candidate must understand Promises and Generators in addition to the traditional callback methodology. Experience using the Restify (as opposed to Express) package to facilitate the REST interfaces would be a must have. In addition to this, the right candidate will have:</p><ul>\n<li>Tertiary qualification in Computer Science or Information Technology, or equivalent practical experience.</li>\n<li>Advanced knowledge and experience in the following: JavaScript, - Node.js using Restify, - RESTful APIs, - PostgreSQL and Asynchronous programming techniques, Code versioning and revision systems such as GitHub</li>\n<li>Writing secure code that complies with appropriate standards and regulations</li>\n<li>Knowledge around PostreSQL for data, or other relational databases\n</li><li>Experience working within a Continuous Integration and Continuous Deployment environment.</li>\n<li>AWS, Azure or similar cloud technology experience</li>\n<li>Code versioning and revision systems such as GitHub</li>\n<li>If you have some Angular/React experience that will help our website guys, however this is not a primary focus</li>\n</ul><p></p><p><b>Please Note:</b><br>\nAs part of our recruitment process, a technical online test must be completed.\n</p><p>We will be considering applicants based locally due to the nature and urgency of this hiring. Citizenship, PR, Work visa or a Working Holiday Visa is required to apply.<br>\n<br>\n<br>\n</p><p><b>About Invenco\n</b><br>\nInvenco uniquely builds highly complex end-to-end payment solutions from hardware through the firmware and middleware stack plus cloud &#x2013; all under one roof. In revolutionising the global customer payment experience it&#x2019;s one of New Zealand&#x2019;s most awarded tech-companies &#x2013; including being named 2018 NZ Hi-Tech company of the year. We continue to attract world-class talent as Invenco faces exponential growth in APAC, EMEA, the US and Canada. There has never been a better time to join us as we expand our global development and applications team.</p><p></p><p><b>\nBenefits</b><br>\nWe&#x2019;re based on Auckland&#x2019;s North Shore just minutes from the Northern Motorway.<br>\nOur benefits include working with a great team, performance-based pay, training and development opportunities, challenging work, flexible work hours, paid birthday leave, discounted medical insurance, onsite gym and access to EAP services. We have a lot happening at Invenco and it&apos;s an exciting time to join as we expand globally.<br>\nwww.invenco.com</p></div>"}]