[{"link":"https://nz.indeed.com/rc/clk?jk=116c874d8a8318f3&fccid=83927230253a564d&vjs=3","name":"React.js Developer","companyName":"Orion Health Group","time":"12 days ago","location":"Auckland","area":"Auckland City","country":"New Zealand","description":"<div><p>Healthcare is experiencing a global shift, opening up exciting new opportunities in technology. In the world of software engineering, there are few areas where you can have more impact. Your work will assist doctors, lab techs, pharmacists, nurses, and others involved in helping patients improve their health. The products you work on play a material role in saving lives and improving patient care, and the quality of those solutions is key.</p><br>\n<p></p>\n<p><b>\nAbout the role</b></p>\n<p>\nWe&#x2019;re looking for an experienced full-stack developer to join our Auckland team. You&#x2019;ll be building functional, intuitive and beautiful web-based user interfaces working initially on two very exciting internal projects. As a React.js Developer, you will be involved from conception to completion with projects that are technologically sound and aesthetically impressive.</p>\n<p>\nImmersed in a culture of collaboration, learning and software engineering excellence, you&#x2019;ll quickly extend your Front End and UI skills within strong cross discipline project teams. You will also work closely with the Digital Marketing Manager to ensure our web presence stands out from the competition.</p>\n<p>\nDeveloping a flexible and well-structured front-end architecture, along with the APIs to support it, you&#x2019;ll be confident using UI/UX designs and wireframes to create the respective code and application. You&#x2019;ll enjoy optimising components for maximum performance across a vast array of web-capable devices and browsers.</p><br>\n<p></p>\n<p><b>\nAbout You</b></p>\n<p>\nYou like to get stuck in and have a positive, open minded and energetic attitude. You have an eye for detail, enjoy understanding how things work under the hood, excellent verbal and written communication skills, and thrive in a collaborative, professional work environment.</p>\n<p>\nYou&#x2019;ll have solid experience of the following tools and techniques:</p>\n<ul>\n<li>Sound knowledge of modern front-end build pipelines and tools</li>\n<li>Experience with code versioning tools such as Git</li>\n<li>Experience with popular React.js workflows (such as Flux or Redux)</li>\n<li>Familiarity with GatsbyJS</li>\n<li>In-depth knowledge of Javascript, CSS, HTML and front-end languages</li>\n<li>Knowledge of REACT tools</li>\n<li>Excellent troubleshooting skills</li>\n<li>Good project management skills</li><br>\n</ul><p></p>\n<p><b>\nIn return, Orion Health offers</b></p>\n<ul>\n<li>Defined career paths for all roles and across business functions</li>\n<li>Be supported by mentoring and coaching systems</li>\n<li>Competitive salary package</li>\n<li>Breakfast, fruit, freshly ground coffee daily</li>\n<li>Flexible and social, but professional company culture</li>\n<li>Unique learning, travel and career growth prospects</li><br>\n</ul><p></p>\n<p><b>\nIf this sounds like you, we&#x2019;d love to hear from you!</b></p></div>"},{"link":"https://nz.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0BCMt9KzM7Syqna-6d2WDO0Y4Y0ZGXp7WWTX3UefgZTeAtgN0-iKAQh2VhgX0ge_p1hKPdYg12-GxB07dAu3U3957aKpGzls-h0Y5oNQkhb0M3XWP_1A4sL0lJNPywe1btUGAeBkkHShV9niaBeBU7umOkfI_YTC9Ga9FwbwRtyPPUSO0SNRaA-DT570oRe9NVkVE2lJJKyCLr_6Po4W-8FhRu7D7910FfJKyXWIPWDyo60hwHrJJtvklKove19p1UmaTu-wxWtM6_kUHUQABA54hx54Zr4D5wXDLSQ_R_Ri0dMSWWvwP_pm7rcX8s6DzTbd_crHbyypqPSl_MzdUqjZXz1agZJHOYrPFWSGFvzMmA1FaLDY3elIRYEwEj9HqGZ7gaIWAvGjxAegQMP5t8WLXc3oxn37ogvFgL8WDjC8vVHp47awAKd3lfjULZ5DXYN4gfLMy32NxAm0QAwZy7S&p=1&fvj=1&vjs=3","name":"Front-end React JavaScript Software Developer","companyName":"Skillsme","time":"9 days ago","location":"Auckland","area":"Auckland City","country":"New Zealand","description":"<p>Skillsme is looking to expand and as a result, we are looking for a talented React.js Developer to grow our platform.</p><p>The Role:</p><p>As an Intermediate Front-end React.js Developer.<br>Build high quality UI components using React and Redux<br>Use API calls.<br>Work in a collaborative environment with existing developers and other technical team members. Enhance existing functionalities and contribute new features.<br>Adapt changes and provide innovative solutions.<br>Develop &amp; design the new product and improve existing products.</p><p>Skill and Experience Prefer:</p><p>Strong, Intermediate commercial experience with Front End React Development.<br>Strong experience building Web applications.<br>Wider JavaScript framework experience is preferred.<br>Experience working in an Agile environment.<br>Strong attention to detail and analytical skills.<br>Ideally expertise across Redux, WebPack, Promises, Git.<br>Excellent communication skills.</p><p>Apply now on Indeed &amp; complete our online assessment at https://beta.myskillsme.com/sessions/signin</p><p>Job Types: Full-time, Permanent</p><p>Salary: $70,000.00 &#x2013; $80,000.00 per year</p><p>Experience:</p><ul><li>web development: 1 year (Preferred)</li></ul><p>Work Eligibility:</p><ul><li>Permitted to work permanently with no restriction on hours (e.g. citizen, permanent resident) (Preferred)</li></ul><p>Work Remotely:</p><ul><li>Yes</li></ul>"},{"link":"https://nz.indeed.com/rc/clk?jk=930e0d61d7b0f97a&fccid=75018a27cbdffdac&vjs=3","name":"Front End React.js / Redux Developer","companyName":"Talent Army","time":"13 days ago","location":"Wellington","area":"Wellington City","country":"New Zealand","description":"<div><ul><li>Great tech in a start-up environment</li>\n<li>Work with high performance technology, including Blazor</li>\n<li>Early phase, with great industry support</li><br>\n</ul>\n<br>\n<div>An awesome SaaS startup in Wellington is heading into their first round of recruitment, and looking for a Front End Developer with strong React.js / Redux knowledge, and potentially interested in moving to a Blazor environment in the future. With that comes the opportunity to get elbows deep at an early stage, where you can have huge exposure and work directly with a very strong technical leadership team. Seriously punching above their weight in ID and credential management, they have been recognised by both Microsoft and the NZ energy industry, bringing huge opportunities in both execution and market share.<br>\n<br>\nDigitising a manual training records process, they bring a huge amount of additional support, security and confidence to the energy industry, with a scalable SaaS application with heaps more space to grow. Locally built, and backed by a big player in the global ID market, they have the best of both worlds, small enough to make a difference and with the scope to be something really special.<br>\n<br>\n<b>What will I be doing?</b><br>\n<ul><li>Making good looking, accessible and awesome user experiences</li>\n<li>Support and enhance our web applications</li>\n<li>Diagnosing and resolve front end workflow, usability and code issues</li>\n<li>Continuously improve our solutions</li>\n<li>Documentation for our applications\n</li></ul><b>What do I need to know?</b><br>\n<ul><li>Specialist knowledge of front end technologies, including JavaScript and DOM manipulation, React.js, Redux, HTML/CSS and NPM. If you are looking to widen your skills, they are already looking at Blazor as their &#x201C;next generation&#x201D; Front End platform</li>\n<li>Contemporary knowledge API/REST interfaces (such as using Swagger) including modern authentication such as OpenID and Oauth utilising JWT, JWS</li>\n<li>Familiarity with modern code management, build pipelines and tools with Azure DevOps and Git being our primary toolset for this</li>\n<li>Microsoft Azure services in general such as App services and functions for serverless applications. Knowledge of Azure Service bus would be an advantage</li>\n<li>Data exchange standards, formats and schemas such as JSON Schema, web hooks etc</li>\n<li>Even more of a bonus if you have done any work with Web Assembly; including PWAs</li>\n</ul>We&#x2019;d love to see some of this, but it&#x2019;s not a dealbreaker<br>\n<ul><li>They are a .Net shop some so knowledge of C# and will be preferable so you can read the code and can contribute to discussions.</li>\n<li>Knowledge of Identity standards such as W3C Verifiable credentials, DID and any wider knowledge of the self-sovereign identity ecosystem</li>\n</ul>If you want to work in a tight, high performing team with some cutting edge technologies and a project with a huge future, then drop us a line here or email peter@talent.army to set up a discreet chat.</div></div>"},{"link":"https://nz.indeed.com/rc/clk?jk=d67b29a4560c0b86&fccid=2ee6e0ffa01f6f80&vjs=3","name":"Senior Full Stack React / C#.Net Developer","companyName":"Sunstone Talent","time":"4 days ago","location":"Canterbury","area":"Christchurch","country":"New Zealand","description":"<div><div>An interesting client is looking for a Senior Full Stack React / C#.Net Developer to work on software product development in Christchurch.<br>\n<br>\nSolid C#.Net skills?<br>\n<br>\nLove React &amp; React Native?<br>\n<br>\nWhat you&#x2019;ll bring:<br>\n<br>\n<ul><li>BSc in Computer Science or BEng in Software Engineering or similar or not</li><li>5-6 years full stack software engineering experience in C#.Net / JavaScript</li><li>React &amp; Node.js experience</li><li>Docker &amp; Azure experience</li><li>Enjoy working in an Agile / Scrum team developing software products</li><li>Unit testing approach</li><li>Enjoy design / architecture conversations</li></ul>\n<br>\nWhat you&#x2019;ll get:<br>\n<br>\n<ul><li>Work on global software product development</li><li>Modern web application stack in the cloud</li><li>Very cool product suite&#x2026;apply to learn more</li><li>Excellent benefits package + training + flexible working</li></ul>\n<br>\nJoin a React web apps team working on an interesting product stack get in touch with Paul<br>\n<br>\nPlease send your CV with a short note to paul@sunstonetalent.com</div>\n<div><div><p>\nReturn to top IT Job List</p></div></div></div>"},{"link":"https://nz.indeed.com/rc/clk?jk=1d8a1e84e50f442d&fccid=30ea0f19874492f0&vjs=3","name":"Senior .Net Developer","companyName":"Beyond Recruitment","time":"2 days ago","location":"Auckland","area":"Auckland City","country":"New Zealand","description":"South Auckland\n<br><br>\nPermanent\n<br><br>\n<b>About the Company:</b><br>\nOur client is a leading provider of software solutions globally. Catering for a niche market, they value hard work and reward their employees with long term benefits, challenging work and rewarding career pathways.\n<br><br>\n<b>About the Role:</b><br>\nSeeking a Senior .Net Developer who is experienced in supporting Desktop applications with a Windows environment. You will be comfortable working on both legacy and modern technology particularly with WinForms and WPF.\n<br><br>\n<b>Skills Required:</b><br>\nExperience delivering to full stack .Net solutions across desktop applications\n<br><br>\nStrong exposure to working in an ERP environment\n<br><br>\nStrong experience working with React or Angular JS\n<br><br>\nWinforms and WPF\n<br><br>\nExperience with .Net Core for enhancing existing solutions\n<br><br>\nExcellent communication skills - both written and verbal\n<br><br>\n<b>Note:</b> Must be eligible to work full-time in New Zealand.\n<br><br>\nApply now or get in touch with Sri Nanduri at sri.nanduri@beyond.co.nz or call 021 339 535 for more information.\n<br><br>\n<b>Essential:</b> Applicants need to have a right to work in New Zealand with a valid visa.\n<br><br>\n<b>Ref:</b> 105492\n<br><br>\nBeyond Recruitment Technology, Transformation and Digital, connecting IT talent with IT opportunities. Visit www.beyond.co.nz for more roles and information."},{"link":"https://nz.indeed.com/rc/clk?jk=85e48b45d10a99e7&fccid=9955b58079548b77&vjs=3","name":"Intermediate Developer","companyName":"Potentia","time":"8 days ago","location":"Auckland","area":"Auckland City","country":"New Zealand","description":"<div><div><p><b>Why you would like it:</b></p><ul><li><p>\nFintech product development, and your joining at the start of the journey!</p></li><li><p>\nBe front and center of a world first &amp; game changer!</p></li><li><p>\nFlexible and modern software development approach</p></li></ul><p><b>\nThe opportunity:</b><br>\n<br>\nYou will be joining a newly formed squad that has the backing to build a product from scratch that addresses a very interesting new marketplace in the financial services realm. You will be working closely with your team and the CTO, while helping to build production ready code and a highly scalable and secure product using modern JavaScript tools, frameworks and libraries.<br>\n<br>\nThis is the kind of product you can look back on in a few years and really feel like you have changed and positively contributed to the businesses landscape for the better.<br>\n<br>\n<b>Company profile:</b><br>\n<br>\nYou will most likely know Centrality for bringing together the brightest minds locally and internationally in the decentralised systems space. However, they also house and support the growth of a number of emerging startups (decentralised backing or not). Headquartered here in Auckland CBD, they are a modern product development shop with flexible working arrangements and a well grounded global culture.<br>\n<br>\n<b>The skillset:</b><br>\n<br>\nIntermediate level experience with:</p><ul><li><p>\nJavascript (Native)</p></li><li><p>\nReact (what they are currently using) - not worried if you can pivot quickly from another framework like Vue.js or Angular.js</p></li><li><p>\nNode.js</p></li><li><p>\nHTML, CSS</p></li><li><p>\nGood understanding and experience with Automated testing approaches</p></li></ul><p><br>\nIf you are an open minded, motivated and practical Software Engineer with a particular flare for all things Fullstack JS and scalable products, then this opportunity will be one to go for!<br>\n<br>\nSend us your CV or if you meet the brief above and would like to ask some questions before applying, give Sam Nowell a call on 021673467.</p></div></div>\n<br><ul><li>Kaylee Robinson Executive Recruitment Assistant\n</li><li>kaylee@potentia.co.nz\n</li><li>09 600 3931</li></ul>"},{"link":"https://nz.indeed.com/rc/clk?jk=2174493e1b824318&fccid=22f7ba07f9b31a96&vjs=3","name":"Senior Software Engineer","companyName":"Vacasa","time":"12 days ago","location":"Auckland","area":"Auckland City","country":"New Zealand","description":"<div><h3 class=\"jobSectionHeader\"><b>Why Vacasa</b></h3>\n<p>\nWe started with just one home and an idea: to bring homeowners and renters together with smart technology and caring local teams. Today, we&apos;re the largest full-service vacation rental company in the US thanks to the people who give us their best every day. You&apos;ll fit right in here if you&apos;re curious, collaborative, innovative, and thrive in a rapid-growth environment.</p>\n<h3 class=\"jobSectionHeader\"><b>\nWhy Software Engineering at Vacasa</b></h3>\n<p>\nDo you want to be part of an NZ team helping the largest vacation property management company in the US solve problems on a global scale? Are you excited to explore the benefits of scalability and performance by leveraging modern, cloud-based technologies? At Vacasa, we are constantly experimenting and fine-tuning our products. We value stability, security, and scalability.</p>\n<h3 class=\"jobSectionHeader\"><b>\nWhat we are looking for</b></h3>\n<p>\nVacasa is looking for passionate Senior Software Engineers for our fast-growing engineering organization. At Vacasa, we value team independence and ownership, rapid delivery and continuous improvement.</p>\n<p>\nIn this role, you would be part of a cross-functional team building scalable, cloud-native solutions to high-impact business problems. You&apos;ll be working with Node.js for back-end services and with React for front-end applications.</p>\n<h3 class=\"jobSectionHeader\"><b>\nWhat you&apos;ll do with your team</b></h3>\n<p>\nAs a Senior Software Engineer, you&apos;ll be a key member of your team, solving mission-critical problems and being a hands-on contributor to our ever-evolving systems. We believe to shine in this role, you&apos;re good at:</p>\n<ul>\n<li>Designing, architecting, and building software; applying current technology thinking and patterns to our business problems</li>\n<li>Guiding developers via code reviews, discussion and modeling of code that is easy to evolve and read</li>\n<li>Continuously learning new technologies and validating concepts in order to pick the right tool for the job</li>\n<li>Utilizing DevOps tools and practices for building, deploying, and maintaining software in production environments</li>\n<li>Participating and building a collaborative, productive culture around product-focused goals</li>\n<li>Building towards high quality standards and working with your team to create robust testing approaches</li>\n</ul><h3 class=\"jobSectionHeader\"><b>Skills you&apos;ll need</b></h3>\n<ul><li>5+ years of professional experience using two or more languages and working with multiple back-end data storage technologies</li>\n<li>Ability to write high-quality, well-tested code that places maintainability over cleverness; know when and what to optimize for in a given situation</li>\n<li>Adept at guiding technical direction within a cross-functional engineering team</li>\n<li>Experience in cloud platforms with Infrastructure as Code</li>\n<li>Experience and enthusiasm to mentor junior engineers</li>\n</ul><h3 class=\"jobSectionHeader\"><b>Nice to have</b></h3>\n<ul><li>Completed a B.S./M.S. in Computer Science (or equivalent work experience)</li>\n<li>Experience with React, Node.js, JavaScript/TypeScript</li>\n<li>AWS Serverless tech</li>\n<li>Mobile app development experience</li>\n<li>Experience in hospitality or travel industry</li>\n</ul><h3 class=\"jobSectionHeader\"><b>Working with us has its benefits</b></h3>\n<ul><li>Career advancement opportunities</li>\n<li>Flexible work environment</li>\n<li>A fancy new Macbook Pro</li>\n<li>Great colleagues and culture</li></ul></div>"},{"link":"https://nz.indeed.com/rc/clk?jk=3d4c9401e9953ec9&fccid=3a563d9c403ac485&vjs=3","name":"Junior Dynamics 365 Consultants","companyName":"Datacom","time":"5 days ago","location":"Auckland","area":"Auckland City","country":"New Zealand","description":"Our purpose\n<br>Here at Datacom we connect people and technology in order to solve challenges, create opportunities and discover new possibilities for the communities we live in.\n<br>Our team\n<br>Welcome to the team! Join New Zealand&#x2019;s biggest dedicated Dynamics 365 practice and work within New Zealand&#x2019;s biggest IT firm! Our scale and experience means we get to do the most interesting, complex and challenging Dynamics 365 projects that this country (&amp; Australia) has to offer. Don&#x2019;t be scared by our size, as our team exists and operates with autonomy within the wider Datacom business, giving us the best of both worlds, scale and support as well flexibility and the remit to carve a new path for ourselves. We&#x2019;re on the lookout for passionate, talented, smart and dedicated people to continue our growth and success.\n<br>About the Role\n<br>We&#x2019;re looking for a super switched on, driven Junior Consultants who would love to kick-start a career within our Dynamics 365 team. You&#x2019;ll have the support of our senior technical consultants and wider team to get you up to speed with what we do and how we do it. You&#x2019;ll have the opportunity to develop as a Technical Consultant or a Functional Consultant where you&#x2019;ll be responsible for understanding a customers problem, and delivering solutions to help them achieve their goals. This is a varied but challenging role to test your design, delivery, innovative thinking and technical abilities, and with challenge comes reward. Before no time, you&#x2019;ll be confident at leading technical discussion, eliciting requirements, crafting solutions and articulating complex technical CRM or ERP concepts.\n<br>In this role you&#x2019;ll be across multiple projects with high profile clients. Our projects are typically end to end deliveries, combing both CRM and ERP together and pairing with portals, mobile and deep integration to customer systems. If it&#x2019;s big and hairy challenges you are after, then we are the place for you!\n<br>What you&#x2019;ll bring\n<br>We&#x2019;re looking for savvy, confident candidates who come from Commerce, Accounting, Engineering or Computer Science degrees. We will provide a mentoring and learning framework to get you up to speed, but you&#x2019;ll need genuine interest to develop a career as a technical/functional consultant as you&#x2019;ll be constantly challenged to get up to speed &#x2013; working and presenting directly to clients. You&#x2019;ll be ready to step into a role where you&#x2019;ll be constantly challenged, and willing to grasp onto presenting and working directly with clients.\n<br>You&#x2019;ll be an expert at thinking creatively, investigating and coming up with solutions to complex and exciting problems. You may have graduated from any degree, but whatever it&#x2019;s likely to have included a technology and computer science bent. It&#x2019;s advantageous if you have familiarity with concepts of CRM or ERP systems, such as sales, marketing, accounting and supply chain.\n<br>For a technical role, you&#x2019;ll be familiar with .NET, C#, JavaScript, and React. In addition, front end development experience such as react, or JS is a bonus.\n<br>The Nitty Gritty\n<br>We have over 6,200 people across our global offices, and generate an annual revenue of over $1.2 billion, this makes us one of Australasia&#x2019;s largest professional IT services companies. We have extensive expertise in operating data centres, providing IT services, software engineering and application management, as well as payroll and customer service design and operations. With this comes a long list of significant clients Datacom is committed to hiring, developing and promoting the best talent from a diverse range of backgrounds. We are local at heart, yet world-class in capability.\n<br>If this sounds like the kick-start you&#x2019;re after, please apply online"},{"link":"https://nz.indeed.com/rc/clk?jk=e76caf75a9507024&fccid=f779b32d75dd6409&vjs=3","name":"Node.JS Developer","companyName":"Invenco","time":"10 days ago","location":"Auckland","area":"Auckland City","country":"New Zealand","description":"<div><p><b>About the role</b></p><p>\nWe have a lot happening at Invenco, and continue to grow in North America, APAC &amp; Europe. Our Software team are building new applications to support our customer - and it is a great time to join as a developer.<br>\n</p><p></p><br>\n<p>We are currently on the look out for a Node.JS Developer - this role will be responsible to design, build and maintain software solutions with a commitment to delivering quality solutions on time that meet or exceed the needs of our internal and external customers. The Node.JS Developer will be actively involved in:</p><ul>\n<li>Software development</li>\n<li>Software documentation</li>\n<li>Software testing</li>\n<li>Team mentoring</li>\n</ul><p><b>Skills &amp; Experience</b><br>\nWe are looking for a Node.JS Developer who is experienced in working on RESTful APIs in a service architecture, and experienced working in a cloud (ideally AWS) environment. The ideal candidate must understand Promises and Generators in addition to the traditional callback methodology. Experience using the Restify (as opposed to Express) package to facilitate the REST interfaces would be a must have. In addition to this, the right candidate will have:</p><ul>\n<li>Tertiary qualification in Computer Science or Information Technology, or equivalent practical experience.</li>\n<li>Advanced knowledge and experience in the following: JavaScript, - Node.js using Restify, - RESTful APIs, - PostgreSQL and Asynchronous programming techniques, Code versioning and revision systems such as GitHub</li>\n<li>Writing secure code that complies with appropriate standards and regulations</li>\n<li>Knowledge around PostreSQL for data, or other relational databases\n</li><li>Experience working within a Continuous Integration and Continuous Deployment environment.</li>\n<li>AWS, Azure or similar cloud technology experience</li>\n<li>Code versioning and revision systems such as GitHub</li>\n<li>If you have some Angular/React experience that will help our website guys, however this is not a primary focus</li>\n</ul><p></p><p><b>Please Note:</b><br>\nAs part of our recruitment process, a technical online test must be completed.\n</p><p>We will be considering applicants based locally due to the nature and urgency of this hiring. Citizenship, PR, Work visa or a Working Holiday Visa is required to apply.<br>\n<br>\n<br>\n</p><p><b>About Invenco\n</b><br>\nInvenco uniquely builds highly complex end-to-end payment solutions from hardware through the firmware and middleware stack plus cloud &#x2013; all under one roof. In revolutionising the global customer payment experience it&#x2019;s one of New Zealand&#x2019;s most awarded tech-companies &#x2013; including being named 2018 NZ Hi-Tech company of the year. We continue to attract world-class talent as Invenco faces exponential growth in APAC, EMEA, the US and Canada. There has never been a better time to join us as we expand our global development and applications team.</p><p></p><p><b>\nBenefits</b><br>\nWe&#x2019;re based on Auckland&#x2019;s North Shore just minutes from the Northern Motorway.<br>\nOur benefits include working with a great team, performance-based pay, training and development opportunities, challenging work, flexible work hours, paid birthday leave, discounted medical insurance, onsite gym and access to EAP services. We have a lot happening at Invenco and it&apos;s an exciting time to join as we expand globally.<br>\nwww.invenco.com</p></div>"},{"link":"https://nz.indeed.com/rc/clk?jk=31c2324436cd2e55&fccid=040ea0a6c197333e&vjs=3","name":"Senior Front End Developer","companyName":"Absolute IT Recruitment Specialists","time":"5 days ago","location":"Auckland","area":"Auckland City","country":"New Zealand","description":"<div><div><b>Senior Frontend Developer\n</b><br>\n<br>\n<ul><li><b>Up to $135,000 per annum (depending on experience)</b></li></ul><b>\n</b><b>&#x2022; Parking onsite and off street</b><br>\n<b>&#x2022; Flexi hours</b></div>\n<p><b>ABOUT THE COMPANY</b><br>\nInnovative organisation working on a digital and unique B2B solution. Very cool and new age company which is growing fast!<br>\n<br>\n<b>ABOUT THE ROLE</b><br>\nWe&#x2019;re looking for an experienced Senior Frontend Developer with a &#x201C;can-do&#x201D; attitude. The role will be a mix of coding, developing, support and maintenance as well as proposing new ideas to enhance the platform. The main project you&#x2019;ll be working on is a mobile app, however there will be other pieces of work you&#x2019;ll be contributing to.<br>\nThis organisation very much welcomes the thoughts of its employees and is after someone that can work autonomously and is comfortable running a dedicated project and taking all the responsibilities.<br>\n<br>\nResponsibilities:</p>\n<ul><li>Continuing the transitioning to their React frontend</li>\n<li>Collaborating on new features and the product vision</li>\n<li>Adding new and extending existing features</li>\n<li>Paying down technical debt by refactoring old code</li>\n<li>Improving frontend practices</li>\n<li>Championing automated testing</li>\n<li>Championing code reviews</li>\n<li>Championing Internal documentation</li>\n<li>Extending our Mobile (Flutter) app with the next set of features</li>\n</ul>\n<p><b>ABOUT YOU</b><br>\nYou are a seasoned frontend UX expert with solid commercial experience and knowledge of React, ES6, Typescript. You practice and preach unit/integration testing, enjoy reviewing PRs, working in a close-knit team and keeping up to date with your craft. You relish clean and well architectured code. You are pragmatic, results oriented, and get a strong sense of satisfaction knowing customers are using your UI to make their lives easier.<br>\nYou may not have any mobile cross platform development experience (eg RN, Flutter) but have an interest in doing so. Whilst your primary language is JS you are comfortable learning new languages and frameworks and probably have used a variety of other programming languages in a past lifetime which gives you wisdom beyond your years.\n</p><p><b>COMPANY CULTURE &amp; BENEFITS</b><br>\nFlexible working hours and ability to partly work from home. Smart casual dress-code. A great location and offices plus an amazing work environment. Be part of a fast-growing organisation!<br>\n<br>\n<br>\n<b>HOW TO APPLY</b><br>\nClick the APPLY button and include your resume and cover letter or for further information please call Regie on 093025312 or email to regie.saylo@absoluteit.co.nz<br>\n<br>\n<b>NOTE to overseas enquiries and non-NZ residents:</b><br>\nWhereas we welcome international enquiries, only applicants that are legally entitled to work in New Zealand and can make themselves available for interviews in New Zealand will be considered for advertised positions.<br>\nOthers may not necessarily be responded to.</p></div>"},{"link":"https://nz.indeed.com/rc/clk?jk=ada6c1c8433c580b&fccid=2dea608fa5e31841&vjs=3","name":"Senior Full Stack Developer","companyName":"RWA Technology People","time":"5 days ago","location":"Auckland","area":"Auckland City","country":"New Zealand","description":"<ul><li>Permanent opportunity</li>\n<li>Work on cutting edge technology projects!</li>\n<li>Fun team with a great office culture</li></ul>\n<br><div><b>About the role:</b><br>\n<br>\nWe are seeking an experienced Full-stack Developer with experience in C# .NET, latest JS frameworks and Databases and associated frameworks to be a part of this growing organisation and work on some of the latest tech projects!<br>\nIn this Senior .Net Developer role you will closely work with the leadership team and the Product/Feature Owner to produce exceptional digital products. You will champion a &apos;best practice&apos; development approach and will help define the architecture for the software products.<br>\n<br>\n<b>Skills/Experience required:</b><br>\n<ul><li>.NET Framework + Core</li>\n<li>SQL Server / Entity framework</li>\n<li>DevOps &#x2013; CI / CD experience</li>\n<li>Solid understanding of the latest MS stack in an Azure serverless cloud environment</li>\n<li>Hands-on experience with React</li>\n<li>Experience of Agile delivery methodologies</li>\n</ul><b>How to Apply:</b><br>\n<br>\nThis is a fantastic opportunity for someone who is passionate about development and enjoys contributing to the overall design, architecture, and strategy of products to help the business. If you think you are the right person for the job then click <b>Apply Now</b><br>\n<br>\nOnly people with the right to live and work in New Zealand may apply for this role. For this position, you must be available for an interview in Auckland.<br>\n<br>\nDon&apos;t forget to visit our website for more vacancies and job opportunities: <b>www.rwa.co.nz</b><br>\n<br>\n<b>Job reference:</b> SP-3171799</div>"},{"link":"https://nz.indeed.com/rc/clk?jk=a7ff81e7a386027f&fccid=a2e564fccca1d033&vjs=3","name":"Senior Front End Developer","companyName":"Resn","time":"10 days ago","area":"Mount Victoria 6011","country":"New Zealand","description":"<p></p><div><p>Resn is looking for a full time senior creative Javascript and CSS/HTML developer for our studio in Wellington, New Zealand.</p><p></p><br>\n<p>\nYou&apos;ll be working on the biggest and brightest international brands in global time zones (with a focus on APAC and USA). Your peerless development skills ensure that projects are completed to the highest standards, on time, within budget and with a smile on everyone&apos;s dials.</p><p></p><br>\n<p>\nWhat sets you apart is your ability to make the front end come to life through code driven animations, transitions and little touches of class. You have a keen visual eye and understand the importance of getting it to look amazing. You care as much about the visuals as you do about the code.</p><p></p><br>\n<p>\nYou possess a deep understanding about the limitations of browsers and devices as you try to squeeze every drop of performance out of them.</p><p><br>\nResponsibilities</p><ul><li>\nHands-on front-end development for multiple projects including, but not limited to, campaign microsites, web based applications, large scale complex Javascript mobile and desktop websites, 3D experiences, games, installations, experiments and AR/VR experiences.</li><li>\nDefining project front end requirements, assisting with technical design documentation, project budget estimates and assessing feasibility of technical deliverables with your esteemed Creative and Producer colleagues.</li><li>\nResearch and development into latest and greatest front end wizardry and processes.</li><li>\nProject tech leadership role as required.</li></ul><p></p><br>\n<p>\nSkills and Experience</p><ul><li>\n5+ years of development experience, ideally at senior or tech lead level.</li><li>\nBroad experience and solid understanding of interactive web technologies and front-end development using Javascript, HTML, CSS/LESS/SASS, Vue.js.</li><li>\nExperience working on large and complex interactive projects with multidisciplinary creative and technical teams.</li><li>\nExperience with short production timelines, hard deadlines, and moving targets.</li><li>\n A love of planning, scrumming combined with fantastic written and verbal communication skills.</li><li>\nThe ability to maintain composure and focus when the escalating demands of work rear up like a rampant wildebeest.</li><li>\nUnbounding optimism and the desire to achieve the impossible!</li></ul><p></p><br>\n<p>\nBonus Points</p><ul><li>\nExperience with Three.js / GLSL / React Native / Unity.</li><li>\nAny other visually driven development languages.</li></ul><p></p><br>\n<p>\nCheck us out</p><p>\nwww.resn.co.nz</p><p></p><br>\n<p>\n</p><p></p><br>\n<p>Powered by JazzHR</p><p>\neX5vdIcNjy</p></div>"},{"link":"https://nz.indeed.com/rc/clk?jk=84bcfb351697123f&fccid=a2e564fccca1d033&vjs=3","name":"Senior Back-End Developer","companyName":"Resn","time":"10 days ago","area":"Mount Victoria 6011","country":"New Zealand","description":"<p></p><div><p>Resn is looking for a full time Senior Back-End Developer for our studio in Wellington, New Zealand.</p><p></p><br>\n<p>\nYou&apos;ll be working on the biggest and brightest international brands in global time zones (with a focus on APAC and USA). Your peerless back-end development skills ensure that projects are completed to the highest standards, on time, within budget and with a smile on everyone&apos;s dials.</p><p></p><br>\n<p>\nYour developer experience stack is full, and you possess a deep understanding of web services and technologies.</p><p></p><br>\n<p>\nResponsibilities</p><ul><li>\nLead back-end development for multiple projects including, but not limited to, campaign microsites, web based applications, large scale complex Javascript mobile and desktop websites, 3D experiences, games, installations, experiments and AR/VR experiences.</li><li>\nDefining project back end requirements, assisting with technical design documentation, project budget estimates and assessing feasibility of technical deliverables with your esteemed Creative and Producer colleagues.</li><li>\nServe as a technical contact for third-party vendors and production partners, identifying and documenting integration points with third party solutions.</li><li>\nWork closely with clients technical teams to effectively manage integration with client infrastructures and compliance with security systems.</li><li>\nHands-on implementation of development infrastructure</li><li>\nHosting recommendations / set-up / Deployment Implementation / Overall management</li><li>\nResearch and development into latest and greatest back end systems and processes</li></ul><p></p><br>\n<p>\nSkills and Experience</p><ul><li>\n5+ years of development experience, ideally at senior or tech lead level.</li><li>\nExperience setting up and maintaining development and deployment pipelines, including familiarity with Webpack, Rollup, npm, gulp, GIT, Yarn and Bitbucket Pipelines.</li><li>\nDeep understanding of hosting and domain setup and management, network infrastructures and protocols, web security, server-side architectures and back-end strategies for a wide variety of situations, with familiarity with AWS and GCP.</li><li>\nExperience working on large and complex interactive projects with multidisciplinary creative and technical teams.</li><li>\nExperience with short production timelines, hard deadlines, and moving targets.</li><li>\nWorking with and processing server-side media content, e.g. video compositing with ffmpeg, audio processing sox, image processing, streaming video.</li><li>\nA love of planning, scrumming combined with fantastic written and verbal communication skills.</li><li>\nThe ability to maintain composure and focus when the escalating demands of work rear up like a rampant wildebeest.</li><li>\nUnbounding optimism and the desire to achieve the impossible!</li></ul><p></p><br>\n<p>\nBonus Points</p><ul><li>\nBroad experience and solid understanding of interactive web technologies and front-end development using Javascript, HTML, CSS/LESS/SASS, Vue.js.</li></ul><ul><li>\nExperience with Three.js / GLSL / React Native / Unity.</li><li>\nAny other visually driven development languages.</li></ul><p></p><br>\n<p>\nCheck us out</p><p></p><br>\n<p>\nwww.resn.co.nz</p><p></p><br>\n<p>\n</p><p></p><br>\n<p>Powered by JazzHR</p><p>\nhetdehChz7</p></div>"},{"link":"https://nz.indeed.com/rc/clk?jk=6ddf673684af5a63&fccid=2ee6e0ffa01f6f80&vjs=3","name":"Intermediate Full Stack React / C#.Net Developer","companyName":"Sunstone Talent","time":"4 days ago","location":"Canterbury","area":"Christchurch","country":"New Zealand","description":"<div><div>An interesting client is looking for an Intermediate Full Stack React / C#.Net Developer to work on software product development in Christchurch.<br>\n<br>\nSolid C#.Net skills?<br>\n<br>\nLove React &amp; React Native?<br>\n<br>\nWhat you&#x2019;ll bring:<br>\n<br>\n<ul><li>BSc in Computer Science or BEng in Software Engineering or similar or not</li><li>3 years full stack software engineering experience in C#.Net / JavaScript</li><li>React &amp; Node.js experience</li><li>Docker &amp; Azure experience</li><li>Enjoy working in an Agile / Scrum team developing software products</li><li>Unit testing approach</li></ul>\n<br>\nWhat you&#x2019;ll get:<br>\n<br>\n<ul><li>Work on global software product development</li><li>Modern web application stack in the cloud</li><li>Very cool product suite&#x2026;apply to learn more</li><li>Excellent benefits package + training + flexible working</li></ul>\n<br>\nJoin a React web apps team working on an interesting product stack get in touch with Paul<br>\n<br>\nPlease send your CV with a short note to paul@sunstonetalent.com</div>\n<div><div><p>\nReturn to top IT Job List</p></div></div></div>"},{"link":"https://nz.indeed.com/rc/clk?jk=a9eda0a3da55fd35&fccid=2ee6e0ffa01f6f80&vjs=3","name":"Lead Full Stack React / C#.Net Developer","companyName":"Sunstone Talent","time":"4 days ago","location":"Canterbury","area":"Christchurch","country":"New Zealand","description":"<div><div>An interesting client is looking for a Lead Full Stack React / C#.Net Developer to work on software product development in Christchurch.<br>\n<br>\nSolid C#.Net skills?<br>\n<br>\nLove React &amp; React Native?<br>\n<br>\nWhat you&#x2019;ll bring:<br>\n<br>\n<ul><li>BSc in Computer Science or BEng in Software Engineering or similar or not</li><li>6-8 years full stack software engineering experience in C#.Net / JavaScript</li><li>React &amp; Node.js experience</li><li>Docker &amp; Azure experience</li><li>Enjoy technical leadership, design &amp; architecture</li><li>Enjoy working in an Agile / Scrum team developing software products</li><li>Unit testing approach</li><li>Enjoy design / architecture conversations &amp; making technical decision making</li></ul>\n<br>\nWhat you&#x2019;ll get:<br>\n<br>\n<ul><li>Work on global software product development</li><li>Modern web application stack in the cloud</li><li>Very cool product suite&#x2026;apply to learn more</li><li>Excellent benefits package + training + flexible working</li></ul>\n<br>\nJoin a React web apps team working on an interesting product stack get in touch with Paul<br>\n<br>\nPlease send your CV with a short note to paul@sunstonetalent.com</div>\n<div><div><p>\nReturn to top IT Job List</p></div></div></div>"},{"link":"https://nz.indeed.com/rc/clk?jk=13dedc22c8478505&fccid=30ea0f19874492f0&vjs=3","name":"Solution Architect/Lead Developer","companyName":"Beyond Recruitment","time":"3 days ago","location":"Bay of Plenty","area":"Tauranga","country":"New Zealand","description":"Tauranga\n<br><br>\nFlexible working options\n<br><br>\n<b>About the role:</b><br>\nThe Solution Architect/Lead Developer is responsible for working with the development teams, providing technical advice, architectural guidance to deliver high quality solutions for customers. This role does not have any HR responsibilities. The role is focused on the technical implementation, design, and delivery of solutions. The role is envisaged to be made up of 25% architecture, 25% presales support / prototyping / 50% hands on development as part of the team. You will be part of the senior technical team and report to the Head of Development.\n<br><br>\n<b>Skills required for this role:</b><br>\n5+ years of solid hands-on experience in Microsoft C#, ASP.Net (Web Forms &amp; MVC), .Net Core, MS SQL AND / OR Java Spring, Spring Boot, PostgresSQL etc\n<br><br>\nSolid knowledge of databases and data structures used in modern web and mobile application context\n<br><br>\n3+ years of experience designing and working with API driven applications\n<br><br>\n3+ years of solution architecture experience\n<br><br>\nGood understanding of client-side languages, technologies and practices; HTML, CSS, JavaScript, jQuery, AngularJs and or React JS, W3C compliance and accessibility experience\n<br><br>\nCloud Architecture experience with AWS and or Azure cloud platforms\n<br><br>\nSolution Architecture experience\n<br><br>\nExperience designing scalable, cloud first solutions\n<br><br>\nExperience with event and messaging systems (RabbitMQ, Kafka, SMS, SQS)\n<br><br>\nSolid experience in continuous integration and automated deployment\n<br><br>\nExcellent understanding of software development methodologies, including KISS, DRY and SOLID\n<br><br>\nExcellent attention to detail\n<br><br>\nStrong communication skills in all disciplines including written, oral, email and presentation\n<br><br>\nCapable of hands on problem-solving, with ability to generate ideas and solutions\n<br><br>\nAbility to travel to client sites where required\n<br><br>\nWe&apos;d love to hear from you, if this is the right role for you - APPLY now or contact Clare Saunders on 09 374 0876 or Mignon Green on 027 582 1129 or a confidential discussion.\n<br><br>\nPlease note that you must be located in New Zealand to be considered for this contract role.\n<br><br>\n<b>Ref:</b> 105963\n<br><br>\nBeyond Recruitment - Technology, Transformation &amp; Digital, connecting IT talent with IT opportunities. Visit www.beyond.co.nz for more roles and information."},{"link":"https://nz.indeed.com/rc/clk?jk=9747ef54bfbc9f0b&fccid=9955b58079548b77&vjs=3","name":"Senior Fullstack Developer","companyName":"Potentia","time":"9 days ago","location":"Auckland","area":"Auckland City","country":"New Zealand","description":"<div><div><p><b>Why you would like it:</b></p><ul><li><p>\nFintech product development, and your joining at the start of the journey!</p></li><li><p>\nBe front and center of a world first &amp; game changer!</p></li><li><p>\nFlexible and modern software development approach</p></li></ul><p><b>\nThe opportunity:</b><br>\n<br>\nYou will be joining a newly formed squad that has the backing to build a product from scratch that addresses a very interesting new marketplace in the financial services realm. You will be working closely with your team and the CTO, while helping to build production ready code and a highly scalable and secure product using modern JavaScript tools, frameworks and libraries.<br>\n<br>\nThis is the kind of product you can look back on in a few years and really feel like you have changed and positively contributed to the businesses landscape for the better.<br>\n<br>\n<b>Company profile:</b><br>\n<br>\nYou will most likely know Centrality for bringing together the brightest minds locally and internationally in the decentralised systems space. However, they also house and support the growth of a number of emerging startups (decentralised backing or not). Headquartered here in Auckland CBD, they are a modern product development shop with flexible working arrangements and a well grounded global culture.<br>\n<br>\n<b>The skillset:</b></p><ul><li><p>\nSenior level experience with:</p></li><ul><li><p>\nJavascript (Native)</p></li><li><p>\nReact (what they are currently using) - not worried if you can pivot quickly from another framework like Vue.js or Angular.js</p></li><li><p>\nNode.js</p></li><li><p>\nHTML, CSS</p></li><li><p>\nGood understanding and experience with Automated testing approaches</p></li><li><p>\nBonus: Can define and lead architectural conversations with minimal guidance</p></li></ul></ul><p><br>\nIf you are an open minded, motivated and practical Software Engineer with a particular flare for all things Fullstack JS and scalable products, then this opportunity will be one to go for!<br>\n<br>\nSend us your CV or if you meet the brief above and would like to ask some questions before applying, give Sam Nowell a call on 021673467.</p></div></div>\n<br><ul><li>Kaylee Robinson Executive Recruitment Assistant\n</li><li>kaylee@potentia.co.nz\n</li><li>09 600 3931</li></ul>"}]