[{"link":"https://www.monsterindia.com/seeker/job-details?id=1638760&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Software Engineer","companyName":"Wells Fargo","time":"an hour ago","location":"Hyderabad / Secunderabad","area":null,"country":"India","description":"<br>Job Description :<br>About Wells Fargo<br>Wells Fargo &amp; Company (NYSE: WFC) is a leading global financial services company headquartered in San Francisco (United States). Wells Fargo has offices in over 30 countries and territories. Our business outside of the U.S. mostly focuses on providing banking services for large corporate, government and financial institution clients. We have worldwide expertise and services to help our customers improve earnings, manage risk, and develop opportunities in the global marketplace. Our global reach offers many opportunities for you to develop a career with Wells Fargo. Join our diverse and inclusive team where you will feel valued and inspired to contribute your unique skills and experience. We are looking for talented people who will put our customers at the center of everything we do. Help us build a better Wells Fargo. It all begins with outstanding talent. It all begins with you.<br>Market Job Description<br><strong><br>About Wells Fargo India<br></strong><br>enables global talent capabilities for Wells Fargo Bank NA., by supporting business lines and staff functions across Technology, Operations, Risk, Audit, Process Excellence, Automation and Product, Analytics and Modeling. We are operating in Hyderabad, Bengaluru and Chennai locations.<br><strong><br>About the Role<br></strong><br><li><br>This position will be an integral part of Wholesale Enrollments team within the CCIBT - TMPS technology group. Acts as a Sr. Developer in providing application coding, design guidance and consultation, utilizing a thorough understanding of applicable technology, tools and existing designs. Provides coding direction to team and develops highly complex original code. Oversees the preparation of test data, testing and debugging of programs. </li><br><strong><br>Responsibilities<br></strong><br><li><br>As a senior team member, ability understand the requirements, design documents and convert them into secure code by using <strong>Java/J2EE stack.</strong></li><li><strong><br>Capable of providing technical solutions</strong><br>to the business problems</li><li><br>Ability talk to different partners in understanding different systems and be able to negotiate and provide direction to business on technology and other partners.</li><li><br>Understand the risks and make all the stakeholders informed of the risks, plan and mitigate them on a timely basis.</li><li><br>Should have <strong>guided and mentored</strong> the junior team members in the technology.</li><li><br>Troubleshoot and tune for performance</li><br><strong><br>Essential Qualifications<br></strong><br><li><strong><br>Bachelor/Master</strong><br>degree with <strong>9+ years of IT</strong> experience <strong>in </strong><strong>application development and implementation experience using </strong><strong>Java/J2EE</strong><strong> stack with deeper knowledge in </strong><strong>Spring Core, Spring MVC, Spring Boot</strong><strong> Framework and API’s.</strong></li><li><strong><br>Considerable</strong><strong><br>experience and hands on with Cloud Management and services pertaining to PCF and AWS</strong></li><li><br>6+ years of hands-on IT experience in developing complex, highly integrated, web-based applications using Angular/React JS frameworks and worked in Agile teams.</li><li><strong><br>3+ years of </strong><strong><br>JAX-WS, Axis, SOAP, REST</strong><strong><br>web services development</strong><strong><br>experience</strong></li><li><br>Should have work experience in HTML5, Java Script(ES5 &amp; ES6) ,Object oriented JavaScript, Ajax, JSON, React JS library, Responsive web development. Knowledge working with Node &amp; GIT.</li><li><br>Experience in implementation of JS Design patterns.</li><li><br>Experience in writing unit cases using RTL/Mocha/Jasmine/Jest libraries.</li><li><br>Should have work experience in Java Script(ES5 &amp; ES6) ,Object oriented JavaScript, Ajax, JSON, React JS library, Responsive web development. Knowledge working with Node &amp; GIT.</li><li><br>Experience in implementation of Java, J2EE, and JS Design patterns.</li><li><br>Experience in writing unit cases using Junit, RTL/Mocha/Jasmine/Jest libraries.</li><li><br>Should be able to deploy the application in non-production environments on Linux platforms.</li><li><br>Familiar and direct experience of Agile development and dev ops tools such as Jira, confluence, Rally and automated regression testing</li><li><br>Should have worked on DEVOPS, CI/CD using GITHUB, MAVEN, Artifactory, UDeploy, Jenkins</li><br><strong><br>Desired Qualifications<br></strong><br><li><br>Certification in AWS or Cloud foundry (PCF) is plus</li><li><br>Hands on experience of Front End Technologies such as HTML5, Angular JS, and React JS is an added advantage.</li><li><br>Good verbal and written communication skills</li><li><br>Exposure to banking domain is a plus</li><br>We Value Diversity<br>At Wells Fargo, we believe in diversity and inclusion in the workplace; accordingly, we welcome applications for employment from all qualified candidates, regardless of race, color, gender, national or ethnic origin, age, disability, religion, sexual orientation, gender identity or any other status protected by applicable law. We comply with all applicable laws in every jurisdiction in which we operate."},{"link":"https://www.monsterindia.com/seeker/job-details?id=1638782&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Package Consultant: Sterling","companyName":"IBM","time":"an hour ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"<br>Job Description :<br>Introduction<br>As a Package Consultant at IBM, get ready to tackle numerous mission-critical company directives. Our team takes on the challenge of designing, developing and re-engineering highly complex application components and integrating software packages using various tools. You will use a mix of consultative skills, business knowledge, and technical expertise to effectively integrate packaged technology into our clients business environment and achieve business results.<br>Your Role and Responsibilities<br>As a Package Consultant at IBM, get ready to tackle numerous mission-critical company directives. Our team takes on the challenge of designing, developing and re-engineering highly complex application components and integrating software packages using various tools. You will use a mix of consultative skills, business knowledge, and technical expertise to effectively integrate packaged technology into our clients business environment and achieve business results.<br><strong><br>Responsibilities:</strong><li><br>Participate in the software development, and package implementation using industry standard platforms Sterling</li><li><br>Ensure software developed is held to high quality standards through code and design reviews.</li><li><br>Interface with system integrators and IT engineers on projects to ensure proper adherence to SDLC and platform integrity.</li><br>Required Technical and Professional Expertise<br><li><br>Minimum 4-8 years of experience in IT Industry</li><li><br>Validated knowledge of the various modules in IBM Sterling OMS</li><li><br>Hands-on configuration and development experience using OOTB Sterling APIs in a minimum of one Sterling OMS implementation</li><li><br>Proficient in development of wrapper using Sterling OOTB APIs and configuring them as Sterling services (SDF)</li><li><br>Working knowledge of Sterling Store Web and Sterling Call Center</li><li><br>Customization knowledge of Sterling Store / Call Center web UI will be a huge plus</li><li><br>Ability to create Sterling OMS detailed technical design for business requirements</li><li><br>In-depth experience working with Sterling OMS interfaces with external systems using MQ, JMS</li><li><br>Ability to independently setup a local instance of Sterling OMS for development purpose</li><li><br>Solid understanding of core Java, servlets and web services (ReST &amp; SOAP)</li><li><br>Experience working with XMLs, XSLs and JSON</li><li><br>Working and configuration of any one application server; WAS, Weblogic, JBoss, etc</li><br>Preferred Technical and Professional Expertise<br><li><br>Experience working with Sterling Order Management on Cloud (OM SaaS)</li><li><br>Hands-on knowledge of microservices (Spring, Springboot)</li><li><br>Hands-on experience with UI technologies; Angular JS, React JS, GraphQL</li><li><br>You love collaborative environments that use agile methodologies to encourage creative design thinking and find innovative ways to develop with cutting edge technologies</li><li><br>Ambitious individual who can work under their own direction towards agreed targets/goals and with creative approach to work</li><li><br>Intuitive individual with an ability to manage change and proven time management</li><li><br>Proven interpersonal skills while contributing to team effort by accomplishing related results as needed</li><li><br>Up-to-date technical knowledge by attending educational workshops, reviewing publications</li><li><br>Exposure to one SQL database; DB2, Oracle, MySQL, etc</li><li><br>Basic knowledge of navigating through any one operating system; Linux or Windows</li><li><br>Knowledge of any popular IDE (Eclipse), code repository (SVN, CVS, GitHub)</li><br>About Business Unit<br>IBM Services is a team of business, strategy and technology consultants that design, build, and run foundational systems and services that is the backbone of the world's economy. IBM Services partners with the world's leading companies in over 170 countries to build smarter business by reimagining and reinventing through technology, with its outcome-focused methodologies, industry-leading portfolio and world class research and operations expertise leading to results-driven innovation and enduring excellence.<br>Your Life @ IBM<br>What matters to you when you’re looking for your next career challenge?<br>Maybe you want to get involved in work that really changes the world? What about somewhere with incredible and diverse career and development opportunities – where you can truly discover your passion? Are you looking for a culture of openness, collaboration and trust – where everyone has a voice? What about all of these? If so, then IBM could be your next career challenge. Join us, not to do something better, but to attempt things you never thought possible.<br>Impact. Inclusion. Infinite Experiences. Do your best work ever.<br>About IBM<br>IBM’s greatest invention is the IBMer. We believe that progress is made through progressive thinking, progressive leadership, progressive policy and progressive action. IBMers believe that the application of intelligence, reason and science can improve business, society and the human condition. Restlessly reinventing since 1911, we are the largest technology and consulting employer in the world, with more than 380,000 IBMers serving clients in 170 countries.<br>Location Statement<br>For additional information about location requirements, please discuss with the recruiter following submission of your application.<br>Being You @ IBM<br>IBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.<br>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1638705&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Full Stack Developer","companyName":"Larsen &amp; Toubro Infotech Limited","time":"4 hours ago","location":"India","area":null,"country":"India","description":""},{"link":"https://www.monsterindia.com/seeker/job-details?id=1638703&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"React + Java Spring Boot Developer","companyName":"Larsen &amp; Toubro Infotech Limited","time":"4 hours ago","location":"Pune","area":null,"country":"India","description":"<br><strong> Job Description </strong><br>8+ years of experience React JS is must<br>Very strong in core Java<br>1.1. Class design<br>1.2. Data structures<br>1.3. File Handling<br>1.4. Exception handling<br>1.5. Memory management<br>1.6. ORM/JPA/Templates<br>1.7. JMS<br>1.8. Threads Spring<br>2.1. Spring-boot &amp; Services<br>2.2. IOC Strong Analytical and communication skills<br>Shift Timing: 2pm to 11pm "},{"link":"https://www.monsterindia.com/seeker/job-details?id=1638701&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Technology Specialist","companyName":"UST Global Singapore Pte Limited","time":"4 hours ago","location":"Bengaluru / Bangalore","area":null,"country":"India"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1638702&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Sr. Systems Analyst","companyName":"UST Global Singapore Pte Limited","time":"4 hours ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":""},{"link":"https://www.monsterindia.com/seeker/job-details?id=1638739&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"R&amp;D Engineer","companyName":"Nokia","time":"4 hours ago","location":"Bengaluru / Bangalore, India","area":null,"country":"India","description":"<br>Job Description :<br><b>About Nokia</b><br>At Nokia we create the technology to connect the world. Developing and delivering the industry's only end-to-end portfolio of network equipment, software, services and licensing that is available globally. Through our research teams, including the world-renowned Nokia Bell Labs, Nokia is leading the world to adopt end-to-end 5G networks that are faster, more secure and capable of revolutionizing lives, economies and societies. Nokia adheres to the highest ethical business standards as we create technology with social purpose, quality and integrity. A truly global company, we are 160 nationalities working in more than 100 countries.<br><b>About Nokia Software</b><br>Nokia Software is the leading solutions provider in the telecoms software market helping to drive large-scale service and network operations automation and digital business transformation in support of customer migrations to 5G. Built on Nokia’s cloud-native Common Software Foundation (CSF), Nokia’s multi-vendor and multi-network software solutions enrich and secure user experiences; automate operations and infrastructure; and enable new revenue streams and cost efficiencies.<br><b>Job Description</b><br><b>Key Responsibilities:</b><br>- Best in class in object oriented programming and debugging performance, memory, multi threading issues.<br>- Ability to make high level design decisions, technology choices, and establish an oversight on implementation and delivery processes.<br>- Interface with cross scrum teams to ensure performance, scalability, availability, and usability requirements delivered.<br>- Apply standard, high quality design, development and testing processes<br>- Support customer issues and escalations<br><b>Technical:</b><br>- HTML5, CSS3, JS, Angular/React JS, jQuery, Ajax, Bootstrap programming<br>- Java, Concurrency, Spring data, Spring boot, Kafka, Microservice,<br>- REST, Swagger, Graph QL<br>- Elastic Search, Kibana<br>- Multi Tenancy, Vault, Keycloak, Drools<br>- Neo4j, Maria db<br><b>Domain</b>: EMS, NMS, OSS (Fulfillment Assurance Inventory)<br><b>Behavioural:</b><br>- Organized, Independent<br>- Team Work, Collaboration, Team building, and Coaching<br>- Results Oriented<br>- Ability to explain and understand problems quickly and effectively<br><b>Prior Experience Required:</b><br>The candidate should have a minimum professional qualification of bachelor degree in engineering/technology with 8-12 years of hands-on experience in NMS, Inventory, Network topology, assurance, fulfillment.<br><b>Qualifications :</b>Minimum Bachelor degree in engineering (CS/Electronics/IT)<br><b><br>Imagine creating technology that has the potential to change the world. Working with us, you will have a positive impact on people’s lives and help to overcome some of the world’s most pressing challenges. We act inclusively and respect the uniqueness of people. At Nokia, employment decisions are made regardless of race, color, national or ethnic origin, religion, gender, sexual orientation, gender identity or expression, age, marital status, disability, protected veteran status or other characteristics protected by law. Nokia culture welcomes people as their true selves. Come create the technology to connect the world. </b>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1596830&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Security Technology – Cloud and Network Security Support Engineer","companyName":"Ernst &amp; Young","time":"4 hours ago","location":"Cochin / Kochi / Ernakulam, India","area":null,"country":"India","description":"<br>Job Description :<br><b>Security Technology – Cloud and Network Security Support Engineer</b><br><b><br><b>EY Technology</b><br>Technology has always been at the heart of what we do and deliver at EY. We need technology to keep an organization the of ours working efficiently and securely. We have more than 300,000 people in more than 160 countries, all of whom rely on secure technology to be able to do their job every day. Everything we use as a firm depends on our security mindset. Our laptops, our mobile devices, connecting our people to our clients, enabling hundreds of internal tools for us and external solutions delivered to our clients is only successful with effective. Securing technology is our passion please join us and show us your passion.<br><b>The opportunity</b><br>We are looking for a Cloud and Network Security Support Engineer, who will become part of our Security Technology Services team. In this role you will be involved in managing and coordinating activities related to cloud and network tools supporting the security posture of EY. You will be responsible for enabling new technologies and working with internal and external groups to ensure our Cloud and network infrastructure is secure and robust. You will be working in a team of like-minded individuals who manage the 24x7 operation of our business-critical technology.<br><b><br><b>Your Key Responsibilities</b><br>The Cloud and Network Security Support Engineer will support the run state of our network and cloud infrastructure security tools and their underlying technologies. They will also be involved in the implementation of new technologies, bringing operational expertise to ensure successful launch as well as upgrading current technologies in production.<ul><li>Provide technical oversight of Information Security technologies that fall under the team’s responsibilities, confirming they are operating within agreed service levels and at peak possible performance</li><li>Manage, drive and coordinate planned maintenance activities as well as the standardization and automation of processes and procedures for Information Security technologies.</li><li>Represent the team in specific Project activities, including leading projects and managing the activity of others towards successful completion.</li><li>Articulate technology issues/concerns that may emerge at any level of the technical stack, and from any component across the ecosystem, to senior business and technology leaders</li><li>The role will require to be in an On Call rotation for escalation of production-related issues</li></ul><br><b>Skills and attributes for success</b><br>We are interested in people who bring support engineer experience from managing a large enterprise environment – specifically, detailed troubleshooting of issues, strong analytical skills, collaborating with various technical teams across multiple disciplines, and communicating effectively with stakeholders and internal and external customers. As a successful candidate you will have functional and/or technical experience in supporting network and cloud technologies including hands on experience on the REST API Support, Azure, python / shell scripting.<br><b>To qualify for the role, you must have</b><li><br>Bachelor's degree in computer related field or equivalent work experience.</li><li><br>Approximately 5-7 years of experience in managing network and Multi-cloud infrastructure including demonstratable knowledge REST API, python / shell scripting.</li><li><br>The ability to train &amp; coach staff in technical processes and practices.</li><li><br>Strong English language skills – written and verbal</li><li><br>Experience in project management, service introduction, and service readiness</li><br><b>Ideally, you’ll also have</b><li><br>Deep understanding of Multi-cloud fundamentals</li><li><br>Deep exposure in the network infrastructure support</li><li><br>Hands-on with REST API, Python /Shell scripting.</li><li><br>AZ-103/CCNA/CCNP certifications will be a plus</li><li><br>Information Technology Infrastructure Library (ITIL Foundations)</li><br><b>What we look for</b><br><ul><li>We are looking for people who are comfortable working with culturally diverse on/offshore team members, able to react appropriately during stressful and ambiguous situations.</li></ul><br><b>What working at EY offers</b><br>We offer a competitive remuneration package where you’ll be rewarded for your individual and team performance. Our comprehensive Total Rewards package includes support for flexible working and career development, and with FlexEY you can select benefits that suit your needs, covering holidays, health and well-being, insurance, savings and a wide range of discounts, offers and promotions. Plus, we offer:<li><br>Support, coaching and feedback from some of the most engaging colleagues around</li><li><br>Opportunities to develop new skills and progress your career</li><li><br>The freedom and flexibility to handle your role in a way that’s right for you</li><br><i>EY is committed to be an inclusive employer and we are happy to consider flexible working arrangements. We strive to achieve the right balance for our people, enabling us to deliver excellent client service whilst allowing you to build your career without sacrificing your personal priorities. While our client-facing professionals can be required to travel regularly, and at times be based at client sites, our flexible working arrangements can help you to achieve a lifestyle balance.</i> </b></b>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1638693&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"TC _ TSD Python, Senior","companyName":"Ernst &amp; Young","time":"4 hours ago","location":"Bengaluru / Bangalore, India","area":null,"country":"India","description":"<br>Job Description :<br>Ernst &amp; Young (trading as EY) is a multinational professional services firm headquartered in London, United Kingdom and is one of the Big Four audit firms.<br>The organization operates as a network of member firms which are separate legal entities in individual countries. It has 200,000+ employees in over 700 offices around 150 countries in the world. It provides assurance (including financial audit), tax, consulting and advisory services to companies.<br>The firm dates back to 1849 and the current firm was formed by a merger of Ernst &amp; Whinney and Arthur Young &amp; Co., now rebranded as EY.<br><b>Company Culture</b><br>Ernst &amp; Young prides itself in having a globally diverse and inclusive corporate culture based on experience, skills and leadership among employees. The company strives in building relationships between its employees and its clients. Ernst &amp; Young defines its culture in three areas: Inclusiveness, Development and Engagement. Employees are encouraged to speak up, continue learning and coaching others, and to engage with each other, as well as with clients and management, towards achieving personal and professional goals.<br><b>Job Description: -</b><br>Looking for a Django Python Web developer with 3-9 years experience with proficiency in writing reusable, testable &amp; efficient code with good programming skills. Strong in Application development experience in any one of the financial risk-domains – credit, market, liquidity risk or enterprise risk – operational risk or good to knowledge of compliance/Fincrime technology with exposure to any one of the cloud technologies like MS Azure/AWS<br><b>Required skills: -</b><br><ul><li>Proven experience as a Full Stack Developer and expert in Python with knowledge of at least one Python web framework, such as Django/ Flask</li><li>Should have working experience in Financial risk domain: – credit, market, liquidity risk or enterprise risk – operational risk (any one of these mandatory) or good to knowledge of compliance/Fincrime technology</li><li>Knowledge of multiple back-end languages (e.g. C#, Java, Python) and JavaScript frameworks (e.g. Angular, React, Node.js)</li><li>Knowledge of multiple front-end languages and libraries (e.g. HTML/ CSS, JavaScript, XML, jQuery)</li><li>Familiarity with databases (e.g. SQL Server, MySQL, MongoDB), web servers (e.g. Apache) and UI/UX design</li><li>Familiarity with some ORM (Object Relational Mapper) libraries</li><li>Able to integrate multiple data sources and databases into one system</li><li>Understanding of the threading limitations of Python and multi-process architecture</li><li>Design and implementation of low-latency, high-availability, and performant applications</li><li>Integration of user-facing elements &amp; data storage solutions</li><li>Strong unit testing and debugging skills</li><li>Experience developing desktop applications and familiarity with common stacks</li><li>Knowledge of user authentication and authorization between multiple systems, servers, and environments</li><li>An analytical mind, excellent communication and teamwork skills</li><li>Proficient understanding of code versioning tools (such as Git or SVN etc.) and release management</li></ul><br><b>Other preferred skills:</b><br><ul><li>Application development knowledge with financial or risk background is preferred</li><li>Ability to interpret business requirements and other supporting documentation with a strong attention to detail</li><li>Knowledge of key features of Cloud Service Providers</li><li>Migrating complex, multi-tier applications on Cloud Platforms like MS Azure/AWS</li><li>Education and Experience:</li><li>Overall application development experience of 4-5 years</li><li>B.E./B.Tech in Computer Science from a reputed institute</li><li>Technical certifications in Python, Cloud technologies is preferred</li></ul><br><b>Required skills: -</b><br><ul><li>Proven experience as a Full Stack Developer and expert in Python with knowledge of at least one Python web framework, such as Django/ Flask</li><li>Should have working experience in Financial risk domain: – credit, market, liquidity risk or enterprise risk – operational risk (any one of these mandatory) or good to knowledge of compliance/Fincrime technology</li><li>Knowledge of multiple back-end languages (e.g. C#, Java, Python) and JavaScript frameworks (e.g. Angular, React, Node.js)</li><li>Knowledge of multiple front-end languages and libraries (e.g. HTML/ CSS, JavaScript, XML, jQuery)</li><li>Familiarity with databases (e.g. SQL Server, MySQL, MongoDB), web servers (e.g. Apache) and UI/UX design</li><li>Familiarity with some ORM (Object Relational Mapper) libraries</li><li>Able to integrate multiple data sources and databases into one system</li><li>Understanding of the threading limitations of Python and multi-process architecture</li><li>Design and implementation of low-latency, high-availability, and performant applications</li><li>Integration of user-facing elements &amp; data storage solutions</li><li>Strong unit testing and debugging skills</li><li>Experience developing desktop applications and familiarity with common stacks</li><li>Knowledge of user authentication and authorization between multiple systems, servers, and environments</li><li>An analytical mind, excellent communication and teamwork skills</li><li>Proficient understanding of code versioning tools (such as Git or SVN etc.) and release management</li></ul><br><b>Other preferred skills:</b><br><ul><li>Application development knowledge with financial or risk background is preferred</li><li>Ability to interpret business requirements and other supporting documentation with a strong attention to detail</li><li>Knowledge of key features of Cloud Service Providers</li><li>Migrating complex, multi-tier applications on Cloud Platforms like MS Azure/AWS</li></ul><br><b>Education and Experience:</b><br><ul><li>Overall application development experience of 4-5 years</li><li>B.E./B.Tech in Computer Science from a reputed institute</li><li>Technical certifications in Python, Cloud technologies is preferred</li></ul><br>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1516309&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Immediate Opening For Java/nodejs/reactjs/AngularJS in CMMI L5 Company","companyName":"Crown Solutions India Private Limited","time":"4 hours ago","location":"Chennai","area":null,"country":"India","description":"<br>Dear Aspirant,<br>We Do have an Opening with our Client in <strong><u> (CMMi level 5 company)</u></strong> . Kindly go through the details given Below and share the profile for Face to Face and Telephonic Interview.<br><strong> Skillset : Java / Angular /NodeJS / ReactJS</strong><br><strong> Exp : 2+ yrs</strong><br><strong> Location :Chennai</strong><br><strong> Notice Period: Immediate to Max 15days</strong><br>( Note : People working in MNC with 60days and 90 days as Official Notice Period please ignore this mail )<br>Interview Mode: Telephonic/Face to face<br><strong> Working Location : Chennai</strong><br><u> If you are interested kindly share your profile with following details:</u><br><ul><li> Total Exp:</li><li> Relevant Exp:</li><li> Current CTC:</li><li> Expected CTC:</li><li> Notice Period required to Join:</li><li> Whether interested to work in the payroll of Crown Solutions(Yes/No):</li><li> Current Company :</li><li> Payroll Company :</li></ul><br><u> Do share Your updated resume :</u> [HIDDEN TEXT]<br>044-4006 6015/8754195295<br>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1528552&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"One of the Reputed Company Hiring Telesales Executive Kolkata &amp; Orisa","companyName":"Selectivite Consultants","time":"6 hours ago","location":"Kolkata, Vadodara","area":null,"country":"India","description":"Hi,<br>We have multiple vacancies in Kolkata &amp; Odisa.<br>Sr. TME Hiring Specifications (L1 &amp; L2):&nbsp;<div><br>- Minimum qualification should be graduate.<br>- Min 1 -4 years of experience in Telesales / Telemarketing process.<br>- Experienced candidates should be from outbound Tele calling background either from retail outbound telesales, collections or retention.<br>- Must Have excellent communication skills in English.<br>- fluency in regional language is a must without any traces of<br>colloquial accent and Multi-lingual will be added advantage.<br>- Willing to work on day shift on rotational basis -WFH / WFO.<br>- Should have desktop / Laptop / smart phone with 4G Volte<br>Connection with good network and internet stability.<br>- Basic Excel and Word &amp; Average typing speed<br>Points to be noted:<br>- Candidates should have good stability in previous job.<br>- Target candidates from outbound tele calling background either from retail outbound telesales, collections or retention.<br>- Avoid not working cases for more than 45days; deviation can be<br>considered for the genuine reason.<br>- Target competitors - Internet , Ecommerce. BFSI segment. - Sulekha, Just Dial, Club Mahindra, Shaadi, JS, HDFC Ergo etc<br>- Upsell, verification and lead generation profiles would not be considered.<br>- Should be openness to stretch on timings and meet targets.<br>- On roll Job ; Fixed Salary +Incentives - Based on the performance.<br>For any details regarding job mail on [HIDDEN TEXT]<br>Or call Huma on 9762999392 </div>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1638668&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Technical Specialist - Credit Origination","companyName":"Standard Chartered","time":"7 hours ago","location":"India","area":null,"country":"India","description":"<br><b>About Standard Chartered&nbsp;</b><br>We are a leading international bank focused on helping people and companies prosper across Asia, Africa and the Middle East.&nbsp;&nbsp;<br>To us, good performance is about much more than turning a profit.&nbsp; It%27s about showing how you embody our valued behaviours - do the right thing, better together and never settle - as well as our brand promise, Here for good.&nbsp;<br>We%27re committed to promoting equality in the workplace and creating an inclusive and flexible culture - one where everyone can realise their full potential and make a positive contribution to our organisation. This in turn helps us to provide better support to our broad client base.<br><i><br></i><br><i><br></i><br><b>Purpose:</b><br>This role in Global Banking Technology is within Credit Origination portfolio for the position of [Technical specialist].&nbsp; Position will be key to strategic programme deliverables on CreditMate Application.<br><b><br><b>Key Responsibilities</b><br><b><br><b>Impact %26amp; Value:</b><ul><li>&nbsp;Re-engineer legacy applications and build state of the art platform</li><li>&nbsp;Envision Credit Origination 2.0 platform and align it with Bank’s NextGen technology vision</li><li>&nbsp;Consistently leads delivery of valuable features</li><li>&nbsp;Continually looking for process improvements</li><li>&nbsp;Proposes new ways of doing things</li><li>&nbsp;Suggests novel ways to fulfil requirements</li><li>&nbsp;Helps elaborate requirements where necessary</li></ul><br><b>Programming:</b><ul><li>In depth knowledge of IDE, language and toolset in language of choice.</li><li>Excellent understanding of language %26amp; framework and a good working knowledge of the abstraction layer underneath</li><li>&nbsp;Understanding of threads, threading model and concurrent programming</li><li>&nbsp;Can profile and optimize code</li><li>&nbsp;Good knowledge of other programming languages %26amp; paradigms and when to apply them</li><li>&nbsp;Comfortable debugging/finding complex problems</li></ul><br><b>Design:</b><ul><li>Can identify and apply appropriate design patterns to problems.</li><li>&nbsp;Comfortable developing large features</li><li>&nbsp;Understands Idempotence</li><li>&nbsp;Understands boy scout principle. Leaves code in a better state then when arrived</li><li>&nbsp;Good understanding of cohesion, SOLID and how to apply</li><li>&nbsp;Writes clean, maintainable code</li><li>&nbsp;Understands importance of domain model and can coherently model a problem domain within a given context</li><li>&nbsp;Anticipates medium term (3-6 month) vectors of change and designs and abstracts accordingly</li><li>&nbsp;Understands %26amp; appreciates simplicity %26amp; the value of removing code</li><li>&nbsp;Understands design patterns such as CQRS and eventual consistency</li><li>&nbsp;Understands how to design for performance at all levels</li></ul><br><b>Development Practice:</b><ul><li>&nbsp;Automates everything by default</li><li>&nbsp;Can build a CD pipeline</li><li>&nbsp;Automate security scanning and performance testing as part of build</li><li>&nbsp;Monitor systems to ensure they meet both user needs and business goals</li></ul><ol><li>Oversee assigned programs (e.g. conduct code review), set and monitor team standards.</li><li>Evaluate and select appropriate software or hardware and suggest integration methods</li><li>Focus on reliability, performance and availability</li></ol><br><b>Infrastructure:</b><ul><li>&nbsp;Good grasp of multiple operating systems</li><li>&nbsp;Good grasp of scripting techniques</li><li>&nbsp;Expertise in one database %26amp; good grasp of multiple data storage paradigms and when to apply&nbsp; other technologies</li><li>&nbsp;Understands and can automate paas technologies</li><li>&nbsp;Understands when to apply appropriate infrastructure technologies.</li><li>&nbsp;Understanding of network communications, including TCP/IP, HTTP protocols</li></ul><br><b>Security:</b><ul><li>Writes Secure code by default</li><li>&nbsp;Can use tools (nmap/metasploit etc.) to perform deep security probes</li><li>&nbsp;Understands server hardening</li><li>&nbsp;Understating of security principles using SSL protocols and data encryption</li></ul><br><b>Behaviours %26amp; Collaboration:</b><ul><li>&nbsp;Leads group discussions on design of particular areas</li><li>&nbsp;Comfortable presenting information</li><li>&nbsp;Gains buy in from team and drives design</li><li>&nbsp;Mentors and develops those around them</li><li>&nbsp;Understands domain well enough to work with PO to drive value</li><li>&nbsp;Shares knowledge with wider community</li></ul><br><b>Preferred</b>&nbsp;<b>Candidate Profile</b><b>:&nbsp;</b><br>Ideal candidate must have proven credentials of delivering in world class engineering teams. With a bachelor’s degree in Computer Science, engineering or equivalent discipline, he/she must have relevant experience fulfilling responsibilities of the position. Must be a confident self-starter with ability to collaborate and devise solutions. Relevant industry certifications are an added plus. &nbsp;Ability to learn and adapt to new technologies and frameworks is required.<br><b>Core Competencies:</b><ol><li><b>Strongly&nbsp;</b><b>Desired competencies:</b>&nbsp;</li></ol><br>We are looking for Language agnostic people, however, below is the end to end tech stack we intend to use for developing our Credit Origination platforms.<ul><li>&nbsp;Java/ J2EE, Spring, Struts, Hibernate</li><li>Hands-on skills in J2EE specifications like JAX-RS, JAX-WS</li><li>&nbsp;Cloud Solutions - &nbsp;Openshift or AWS</li><li>&nbsp;Containers Management -using tools like Docker, Rocket and Drawbridge</li><li>&nbsp;Elastic Scaling - using tools like Nginx, HAProxy or PAAS like Openshift</li><li>&nbsp;Dynamic Discover - using tools like Zookeeper or Etcd</li><li>&nbsp;Configuration Management - using tools like Zookeeper, Etcd, Spring, Puppet/Chef, Ansible</li><li>&nbsp;Continuous Integration - using tools like Maven and Jenkins</li><li>&nbsp;Continuous Deployment - using tools like Jenkins, Nolio or Go</li><li>&nbsp;Assembly Development - using frameworks like Apache Camel or Node.js</li><li>&nbsp;UI Development - using frameworks like Node.js, REACT, AngularJS or Backbone</li><li>&nbsp;IDL Definition - using tools like RAML or Swagger</li><li>&nbsp;Code Development - using IDE’s like Eclipse or IntelliJ</li><li>&nbsp;Web API’s - for Information Exchange</li><li>&nbsp;Collaboration - using tools like Git-Hub and JIRA</li><li>Hands experience and Knowledge of microservices architecture</li><li>Strong in Oracle or SQL Server PL/SQL development and designing data model.</li><li>Understanding of continuous build concept and usage with maven, sonarqube or other related tools</li></ul><b>Preferred competencies:</b><br><ul><li>Web services, API design, Defining Specification using swagger/RAML.</li><li>Dev Ops Tools and CI/CD Processes -GitFlow,&nbsp; BitBucket etc.</li><li>Experience with automated test configuration.</li><li>Good to have experience in containerization technologies - Kubernetes</li></ul><b>Qualifications %26amp; Experience:</b><br><ul><li>9+ years of experience in developing world class products/applications.</li><li>&nbsp;Bachelor’s in engineering or equivalent</li><li>&nbsp;Master’s in engineering desirable</li></ul><br>Apply now to join the Bank for those with big career ambitions.&nbsp;<br>To view information on our benefits including our flexible working please visit our . We welcome conversations on flexible working.<br></b></b>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1638669&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Technical Specialist - Credit Origination","companyName":"Standard Chartered","time":"7 hours ago","location":"India","area":null,"country":"India","description":"<br><b>About Standard Chartered&nbsp;</b><br>We are a leading international bank focused on helping people and companies prosper across Asia, Africa and the Middle East.&nbsp;&nbsp;<br>To us, good performance is about much more than turning a profit.&nbsp; It%27s about showing how you embody our valued behaviours - do the right thing, better together and never settle - as well as our brand promise, Here for good.&nbsp;<br>We%27re committed to promoting equality in the workplace and creating an inclusive and flexible culture - one where everyone can realise their full potential and make a positive contribution to our organisation. This in turn helps us to provide better support to our broad client base.<br><b><br><b>Purpose:</b><br>This role in Global Banking Technology is within Credit Origination portfolio for the position of [Technical specialist].&nbsp; Position will be key to strategic programme deliverables on CreditMate Application.<br><b><br><b>Key Responsibilities</b><br><b><br><b>Impact %26amp; Value: </b><ul><li>&nbsp;Re-engineer legacy applications and build state of the art platform</li><li>&nbsp;Envision Credit Origination 2.0 platform and align it with Bank’s NextGen technology vision</li><li>&nbsp;Consistently leads delivery of valuable features </li><li>&nbsp;Continually looking for process improvements </li><li>&nbsp;Proposes new ways of doing things </li><li>&nbsp;Suggests novel ways to fulfil requirements </li><li>&nbsp;Helps elaborate requirements where necessary</li></ul><br><b>Programming: </b><ul><li>In depth knowledge of IDE, language and toolset in language of choice. </li><li>Excellent understanding of language %26amp; framework and a good working knowledge of the abstraction layer underneath </li><li>&nbsp;Understanding of threads, threading model and concurrent programming </li><li>&nbsp;Can profile and optimize code </li><li>&nbsp;Good knowledge of other programming languages %26amp; paradigms and when to apply them </li><li>&nbsp;Comfortable debugging/finding complex problems</li></ul><br><b>Design: </b><ul><li>Can identify and apply appropriate design patterns to problems. </li><li>&nbsp;Comfortable developing large features </li><li>&nbsp;Understands Idempotence </li><li>&nbsp;Understands boy scout principle. Leaves code in a better state then when arrived </li><li>&nbsp;Good understanding of cohesion, SOLID and how to apply </li><li>&nbsp;Writes clean, maintainable code </li><li>&nbsp;Understands importance of domain model and can coherently model a problem domain within a given context </li><li>&nbsp;Anticipates medium term (3-6 month) vectors of change and designs and abstracts accordingly </li><li>&nbsp;Understands %26amp; appreciates simplicity %26amp; the value of removing code </li><li>&nbsp;Understands design patterns such as CQRS and eventual consistency </li><li>&nbsp;Understands how to design for performance at all levels</li></ul><br><b>Development Practice: </b><ul><li>&nbsp;Automates everything by default </li><li>&nbsp;Can build a CD pipeline </li><li>&nbsp;Automate security scanning and performance testing as part of build</li><li>&nbsp;Monitor systems to ensure they meet both user needs and business goals <ol><li>Oversee assigned programs (e.g. conduct code review), set and monitor team standards.</li><li>Evaluate and select appropriate software or hardware and suggest integration methods</li><li>Focus on reliability, performance and availability</li></ol></li></ul><br><b>Infrastructure: </b><ul><li>&nbsp;Good grasp of multiple operating systems </li><li>&nbsp;Good grasp of scripting techniques </li><li>&nbsp;Expertise in one database %26amp; good grasp of multiple data storage paradigms and when to apply&nbsp; other technologies </li><li>&nbsp;Understands and can automate paas technologies </li><li>&nbsp;Understands when to apply appropriate infrastructure technologies. </li><li>&nbsp;Understanding of network communications, including TCP/IP, HTTP protocols</li></ul><br><b>Security: </b><ul><li>Writes Secure code by default </li><li>&nbsp;Can use tools (nmap/metasploit etc.) to perform deep security probes </li><li>&nbsp;Understands server hardening </li><li>&nbsp;Understating of security principles using SSL protocols and data encryption</li></ul><br><b>Behaviours %26amp; Collaboration: </b><ul><li>&nbsp;Leads group discussions on design of particular areas </li><li>&nbsp;Comfortable presenting information </li><li>&nbsp;Gains buy in from team and drives design </li><li>&nbsp;Mentors and develops those around them </li><li>&nbsp;Understands domain well enough to work with PO to drive value </li><li>&nbsp;Shares knowledge with wider community</li></ul><br><b>Preferred</b><b>Candidate Profile</b><b>:&nbsp;</b><br>Ideal candidate must have proven credentials of delivering in world class engineering teams. With a bachelor’s degree in Computer Science, engineering or equivalent discipline, he/she must have relevant experience fulfilling responsibilities of the position. Must be a confident self-starter with ability to collaborate and devise solutions. Relevant industry certifications are an added plus. &nbsp;Ability to learn and adapt to new technologies and frameworks is required.<br><b>Core Competencies: </b><ol><li><b>Strongly </b><b>Desired competencies:</b></li></ol><br>We are looking for Language agnostic people, however, below is the end to end tech stack we intend to use for developing our Credit Origination platforms. <ul><li>&nbsp;Java/ J2EE, Spring, Struts, Hibernate</li><li>Hands-on skills in J2EE specifications like JAX-RS, JAX-WS</li><li>&nbsp;Cloud Solutions - &nbsp;Openshift or AWS </li><li>&nbsp;Containers Management -using tools like Docker, Rocket and Drawbridge </li><li>&nbsp;Elastic Scaling - using tools like Nginx, HAProxy or PAAS like Openshift </li><li>&nbsp;Dynamic Discover - using tools like Zookeeper or Etcd </li><li>&nbsp;Configuration Management - using tools like Zookeeper, Etcd, Spring, Puppet/Chef, Ansible </li><li>&nbsp;Continuous Integration - using tools like Maven and Jenkins </li><li>&nbsp;Continuous Deployment - using tools like Jenkins, Nolio or Go </li><li>&nbsp;Assembly Development - using frameworks like Apache Camel or Node.js </li><li>&nbsp;UI Development - using frameworks like Node.js, REACT, AngularJS or Backbone </li><li>&nbsp;IDL Definition - using tools like RAML or Swagger </li><li>&nbsp;Code Development - using IDE’s like Eclipse or IntelliJ </li><li>&nbsp;Web API’s - for Information Exchange </li><li>&nbsp;Collaboration - using tools like Git-Hub and JIRA </li><li>Hands experience and Knowledge of microservices architecture </li><li>Strong in Oracle or SQL Server PL/SQL development and designing data model.</li><li>Understanding of continuous build concept and usage with maven, sonarqube or other related tools</li></ul><b>Preferred competencies:</b><br><ul><li>Web services, API design, Defining Specification using swagger/RAML.</li><li>Dev Ops Tools and CI/CD Processes -GitFlow,&nbsp; BitBucket etc.</li><li>Experience with automated test configuration. </li><li>Good to have experience in containerization technologies - Kubernetes</li></ul><b>Qualifications %26amp; Experience:</b><br><ul><li>9+ years of experience in developing world class products/applications. </li><li>&nbsp;Bachelor’s in engineering or equivalent </li><li><br>&nbsp;Master’s in engineering desirable </li></ul><br>Apply now to join the Bank for those with big career ambitions.&nbsp;<br>To view information on our benefits including our flexible working please visit our . We welcome conversations on flexible working.<br></b></b></b>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1511883&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Hiring For Front End Developer 5+ Years Exp | Location – Mumbai,Banglr","companyName":"Sellcraft Global Solutions Private Limited","time":"7 hours ago","location":"Bengaluru / Bangalore, Mumbai","area":null,"country":"India","description":"<br>Job Description<br>Hiring for Front End Developer 5 + Years Mumbai and Bangalore Looking candidate for Front end developer Profile Contract to hire long term opportunity. Mumbai , Bangalore Skills: Angular, NodeJS, ,HTML, CSS ,Bootstrap, Angular , Angular JS"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1638524&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Front end Developer React Native/ JavaScript","companyName":"Talent Corner Hr Services Private Limited","time":"7 hours ago","location":"Delhi, Delhi NCR","area":null,"country":"India","description":"<br>Job Description :<br>Job Description<br>Must have experience on building and deploying mobile application for Android and IOS platform using React Native<br>Must to have hands on experience on ReactJS, Javascript<br>Strong proficiency in JavaScript, including DOM manipulation and the JavaScript object model<br>Experience with popular React.js workflows (such as Flux or Redux)<br>Familiarity with native build tools, like XCode, GradleAndroid Studio"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1638507&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Vacancy For Mobile Developer","companyName":"Talent Corner Hr Services Private Limited","time":"7 hours ago","location":"Pune, Delhi NCR","area":null,"country":"India","description":"<br>Job Description :<br>Job Description<br>Developing &amp; maintaining React Native applications for Android/ IOS platform.<br>Knowledge of HTML5, CSS, JavaScript, REST API integration &amp; authorization mechanism.<br>Building and deploying mobile apps to App/Play stores. Bug fixing &amp; improving performance."},{"link":"https://www.monsterindia.com/seeker/job-details?id=1638435&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"React Developer","companyName":"Talent Corner Hr Services Private Limited","time":"7 hours ago","location":"Pune, Delhi NCR","area":null,"country":"India","description":"<br>Job Description :<br>Job Description<br>Strong proficiency in JavaScript, including DOM manipulation and the JavaScript object model<br>Thorough understanding of React.js and its core principles<br>Experience with popular React.js workflows (such as Flux or Redux)<br>Knowledge of Web Apps and React Native application, majorly front end.<br>Basic knowledge of react, CSS3 and HTML5.<br>Familiarity with RESTful APIs<br>Knowledge of modern authorization mechanisms, such as JSON Web Token<br>Familiarity with modern front-end build pipelines and tools<br>Experience with common front-end development tools such as Babel, Webpack, NPM, etc.<br>Ability to understand business requirements and translate them into technical requirements"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1516089&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Hiring For Front End Developer 5+ Years Exp | Location - Mumbai,Banglr","companyName":"Sellcraft Global Solutions Private Limited","time":"10 hours ago","location":"Chennai","area":null,"country":"India","description":"<br>Hiring for Front End Developer 5 + Years Mumbai and Bangalore<br>Looking candidate for Front end developer Profile Contract to hire long term opportunity.<br>Mumbai , Bangalore<br>Skills: Angular, NodeJS, ,HTML, CSS ,Bootstrap, Angular , Angular JS<br><b>Required Candidate profile</b>Share CV's on [HIDDEN TEXT]<br>Connect - 7499162340"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1638318&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Hiring For Java Fullstack Lead Position For Pune , Mumbai Loc Exp - 8","companyName":"Sellcraft Global Solutions Private Limited","time":"10 hours ago","location":"Pune","area":null,"country":"India","description":"<br>Dear all,<br>Lead Application Developer (Front-end / Java Web Developer Technical Specialist/Lead) Responsibilities Enhance Alliance Data Retails Digital (Web, mobile) offerings Actively participate in a fun and fast paced Agile environment<br><b>Required Candidate profile</b>Identify and drive continuous improvement initiatives throughout the organization's innovation within the team Manage compromises and risks as they appear."},{"link":"https://www.monsterindia.com/seeker/job-details?id=1516088&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Hiring For Delaplex Banglore ReactJS Node.JS - Third Party Payroll","companyName":"Sellcraft Global Solutions Private Limited","time":"10 hours ago","location":"Chennai","area":null,"country":"India","description":"<br>Hiring for Delaplex- Banglore - Contract To Hire Position<br>Skills :ReactJS, NodeJS<br>Exp : 6-18 Years<br>Job location : Delaplex - Banglore<br>Share resume on [HIDDEN TEXT]<br>7499162340"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1638292&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Senoir Java Developer - South Africa Based IT Company Viman Nagar Pune","companyName":"Seventh Contact Hiring Solutions","time":"10 hours ago","location":"Pune","area":null,"country":"India","description":"<br><strong>Roles And Responsibilities</strong><ul><li>As a Java software engineer, you will understand the requirements build great code throughout the full development lifecycle - from concept and design right through to testing.</li><li>Identifying production and non-production application issues</li><li>Contributing in all phases of the development lifecycle</li><li>Supporting continuous improvement by investigating alternatives and technologies and presenting these for architectural review</li></ul><br><strong>Desired Candidate Profile</strong><br><ul><li>3+ years experience working on Core Java / J2EE, Spring, Hibernate, Webservices, AngularJS, JavaScript, JBoss. </li><li>Experience in building <strong>microservices Springboot</strong> using Java is <strong>mandatory</strong>.</li><li>A full stack developer is a definite plus in this role, but not always essential</li><li>Experience in handling a team is good to have.</li><li>Experience in: (relative to seniority)</li><li>OO Principles: polymorphism, inheritance, encapsulation</li><li>Strong Java and OO development knowledge</li><li>Experience in <strong>Node JS</strong> is beneficial.</li><li>RESTful services</li><li>JPA / Hibernate</li><li>Jira and Git</li><li>Testing frameworks like Gherkin</li><li>Testing frameworks for APIs</li><li><strong>Microservices,</strong> Docker and Kubernetes experience beneficial</li><li>AWS experience and or certification beneficial</li><li>Ability to read and identify issues in front-end code in frameworks such as Angular and React<strong>Roles and Responsibilities</strong></li></ul><br>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1638235&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Hybrid Mobile App Developer ","companyName":"Calibre Infotech","time":"12 hours ago","location":"Coimbatore","area":null,"country":"India","description":"Looking for Hybrid Mobile App Developers<br>Exp: 2 to 3 Yrs<br>Location: Coimbatore<br>Salary: As per the Industry Norms<br>Immediate Joiner Required<br><b>Job Details<br></b><br>Develop and Manage Mobile Application in Hybrid - Android / iOS Platform<br>Experience in Ionic/React native/Flutter (Technologies Required, Any one of these)<br>Implement new technologies to maximize application performance and to reduce load time<br>Cooperating with the back-end developer in the process of building RESTful API<br>Research on Emerging technologies and trends<br>Unit-test code for robustness, including edge cases, usability, and general reliability<br>Participating in the planning and design of future software and technical architecture<br>Understand requirements, architecture decisions, assess feasibility and provide time estimates on implementing new features and functionalities."},{"link":"https://www.monsterindia.com/seeker/job-details?id=1638091&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Excellent Job opportunities For  Frontend developers with our MNC Cli","companyName":"Access Automation Private Limited","time":"13 hours ago","location":"Gurgaon / Gurugram","area":null,"country":"India","description":"<br>Job Description<br>Excellent Job opportunities for Frontend developers with our MNC Client!!<br>Exp 6 to 9 Yrs<br>Work Location Gurgaon<br>Notice Period 30 Days<br>Mode Permanent<br><strong><u>Job description</u></strong><ul><li>Expert level knowledge of REACT </li></ul><ul><li>Experience in building responsive web portals using REACT supporting both web &amp; mobile platforms </li></ul><ul><li>Good knowledge of HTML5, CSS </li><li>Good understanding of Redline/IXD and Zeplin specifications</li></ul><ul><li>Front End development lead leading team of 2-3 FE engineers </li></ul><ul><li>Working closely with UX design &amp; backend development team</li><li>Well versed with Agile methodologies</li></ul><br>Interested applicants please share your updated cv to [HIDDEN TEXT] with below details<br>Total exp<br>Rel Exp in react<br>C CTC<br>E CTC<br>N.P.<br>Regards,<br>Sruthi<strong>Roles and Responsibilities</strong><br><strong>Desired Candidate Profile</strong><br><strong>Perks and Benefits</strong><br>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1638085&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"UI Consultant","companyName":"Rave Technologies India Private Limited","time":"13 hours ago","location":"Mumbai","area":null,"country":"India","description":"<br>Job Description Role Summary: UI-UX DeveloperEducation: GraduateRelevant Experience (years): 3-6 yearsLocation: MumbaiSkill set /<br>Responsibilities Essential: Technical skill Should be proficient in UI development and designing. Should be able to understand the user needs and produce concepts/solutions/designs that people want to use JQuery, HTML, CSS, Bootstrap, JavaScript.<br>Experience in Responsive Web Application development, Browser Compatibility, Wireframe designing, User Friendly design. Should be able to quickly create Mockup website based on requirement without design Follow development processes defined for the project and suggests improvements as required rate an interest in learning new technologies and flexible enough to work on them as requiredSoft Skill Good communication<br>Good Analytical and issue solving skills Should be able to interact with client Desirable: Technical skill Understanding of Search Engine Optimization Understanding of Less/SASS Basic understanding of working with JavaScript libraries like angular or react Familiar with PhotoshopSoft Skills Presentation SkillsOverall Project/Task description To be part of Customer Projects Development Team responsible for providing quality product to customer. Capable for performing task independently or with minimum assistance. Ability to learn new technology or tool quickly<br>To have the skills to work through an issue with no real support, but identifying where additional information can be obtained, and pursuing accordingly.The ability to always think through any course of action clearly and not to take any actions that may have a negative outcome. "},{"link":"https://www.monsterindia.com/seeker/job-details?id=1638132&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Front end Developer React Native/ JavaScript","companyName":"Talent Corner Hr Services Private Limited","time":"13 hours ago","location":"Delhi, Delhi NCR","area":null,"country":"India","description":"<br>Must have experience on building and deploying mobile application for Android and IOS platform using React Native<br>Must to have hands on experience on ReactJS, Javascript<br>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1638124&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Java Full Stack Lead / Architect For Gurgaon Location","companyName":"Talent Corner Hr Services Private Limited","time":"13 hours ago","location":"Delhi, Delhi NCR","area":null,"country":"India","description":"<br>For Java Full Stack Lead : &gt; microservices Architecture MSA, java, spring, hibernate/JPA , AWS, HTML, CSS, angular 4 ,angular JS/ React JS<br><b>Required Candidate profile</b> For Java Architect : &gt;Associate Principal Engineer ,MSA , Spring, Hibernate/ JPA, cloud(AWS) CSS, Angular4 / angular JS/ React JS<br><b>Perks and benefits</b>max CTC : 42L"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1638064&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Vacancy For Full Stack Developer / Architect","companyName":"Talent Corner Hr Services Private Limited","time":"13 hours ago","location":"Chennai","area":null,"country":"India","description":"<br>Skills Required:<br>Writing HTML, CSS, and JavaScript, Back-end programming language.<br>Database design &amp; management, Server management &amp; deployment.<br>Familiarity with framework.<br>Experience implementing testing platforms &amp; unit tests<br>Proficiency with Git. "},{"link":"https://www.monsterindia.com/seeker/job-details?id=1638060&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Vacancy For Mobile Developer","companyName":"Talent Corner Hr Services Private Limited","time":"13 hours ago","location":"Chennai","area":null,"country":"India","description":"<br>Developing React Native applications for Android/ IOS platform.<br>Knowledge of HTML5, CSS, JavaScript, REST API integration &amp; authorization mechanism.<br>Building and deploying mobile apps to App/Play stores.<br>Bug fixing &amp; improving performance."},{"link":"https://www.monsterindia.com/seeker/job-details?id=1638040&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"React Developer","companyName":"Talent Corner Hr Services Private Limited","time":"13 hours ago","location":"Chennai","area":null,"country":"India","description":"<br>Translating designs and wireframes into high quality code. Web-capable devices and browsers. Strong proficiency in JavaScript, including DOM &amp; JavaScript. Basic knowledge of react, CSS3 and HTML5, JSON Web Token, React.js. "},{"link":"https://www.monsterindia.com/seeker/job-details?id=1638037&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Asp. Net Developer","companyName":"Talent Corner Hr Services Private Limited","time":"13 hours ago","location":"Chennai","area":null,"country":"India","description":"<br>Create software on MS .NET Platform Design front-end, middle-tier &amp; back-end applications Complete all phases of software development life cycle including functionality, testing &amp; support Support multiple projects and deadlines "},{"link":"https://www.monsterindia.com/job-vacancy-alfresco-developer-cognizant-technology-solutions-india-pvt-ltd-pune-25293317.html","name":"Alfresco Developer","companyName":"Cognizant Technology Solutions India Pvt Ltd","time":"13 hours ago","location":"Pune","area":null,"country":"India"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637931&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Software Engineer ","companyName":"Js It Tech Solutions","time":"13 hours ago","location":"Gurgaon / Gurugram, Hyderabad / Secunderabad","area":null,"country":"India","description":"Hi All,<br>GREETINGS FROM JS IT TECH SOLUTIONS!<br>We have an urgent requirement for Software Engineer - Full Stack<br>Position: Software Engineer - Full Stack<br>Exp:4-6 years<br>Notice period:Immediate to 15 days<br>Location: Gurgaon<br>Job Description:<br>SKILLS:<br>\tBachelors or Masters Degree in Computer Science or Computer Engineering<br>\t3+ years of relevant experience as aSoftwareEngineer<br>\tStrong understanding of software design concepts, patterns, tools and best practices.<br>\tMust have full stack experience using C# Net Core, React and RDBMS.<br>KeyPoints:Software Engineer C#, .Net, Must have React experience<br>Contact : [HIDDEN TEXT]/ [HIDDEN TEXT]// 7893797028<br>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637857&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"PHP Developer/PHP Programmer/Sr.PHP developer/Sr. PHP programmer/PHP/Laravel","companyName":"Markelytics Solutions India Private Limited","time":"15 hours ago","location":"Mumbai, Mumbai City, Navi Mumbai, Thane","area":null,"country":"India","description":"<div>Openings in the department of Web Applications for Senior PHP developers.<br>Generic Job Description:<br>Key Requirements<br> Sound knowledge of technologies : Web Technologies like PHP, NodeJS etc and Frontend technologies like Javascript, Angular JS,etc<br> Excellent communication skills<br> Database experience (MySQL, Memcache, NoSQL)<br> API fluent (creation &amp; usage REST prefered)<br> Working knowledge of source control tools (git)<br> Ability to research, learn and implement new technologies in short time<br> Ability to work independently and as part of a team<br> Should have worked in all the stages of SDLC<br> AWS experience is a plus.<br>Responsibilities<br> Problem Solving Personality<br> Proactively manage multiple projects and coordinate activities with internal Engineering team<br> Solid understanding of OOP, AJAX, jQuery, NodeJS, NoSQL, Server management, Build &amp; Deployment, and MySQL.<br></div><div><br></div><div>If interested, please send your latest/updated resume to <b>[HIDDEN TEXT].</b></div><div><br></div><div><br></div>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1561647&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Assistant Manager \\u2013 PWA Developer - IT Operations","companyName":"Genpact","time":"16 hours ago","location":"Gurgaon / Gurugram","area":null,"country":"India","description":"<br>Job Description :<br>With a startup spirit and 90,000+ curious and courageous minds, we have the expertise to go deep with the world\\u2019s biggest brands\\u2014and we have fun doing it. Now, we\\u2019re calling all you rule-breakers and risk-takers who see the world differently, and are bold enough to reinvent it. Come, transform with us.<br><b> Transformation happens here. Come, be a part of our exciting journey! </b><br><b> Are you the one we are looking for? </b><br>Inviting applications for the role of <b> Assistant Manager \\u2013 PWA developer, IT Operations </b><br>In this role you will be responsible to drive PWA performance and delivery with Technology. <b> Responsibilities </b><br><li> Strongly driving PWA performance and delivery. Build advanced web applications for desktop browsers, mobile web &amp; next generation phone. </li><li> Flexible to work with multi-functional team to build phenomenal customer experiences and implement high quality code. </li><li> Continuously discover, evaluate, and implement new technologies to improve development efficiency. </li><li> You prioritise performance in all your development - both network and rendering.. </li><b> Qualifications </b><br>Minimum qualifications <li> Relevant experience in building highly-interactive applications using ReactJS/VueJS/AngularJS, NodeJS, Bootstrap, HTML5, CSS3/CSS4 and modern opensource web frameworks </li><li> Experienced in working on rich PWA applications </li><li> Understanding of Asynchronous processing, partial page refresh, DOM traversal and manipulation </li><li> Basic understanding of CSS pre-processing platforms, such as LESS, SASS &amp; PostCSS </li><li> Experience with state management libraries - Redux, Vuex, Redux-Saga/ Reduxthunk </li><li> Experience with HTML templating using Jade(now pug)/Mustache/erb, or similar library </li><li> Minimum Experience in creating mobile-friendly UIs not only targeting Smartphones </li><li> Understanding of adaptive and responsive design, and the combination of them </li><li> Worked in Agile teams in multi-functional teams </li><li> Ability to produce code that is unit tested, code reviewed, and checked in regularly for continuous integration </li><li> Ability to build reusable code and libraries for future use </li><li> Proficient understanding of JavaScript unit testing framework and libraries, such as Mocha, Chai, Jasmine, Jest ( Must Have) </li><li> Proficient understanding of development tools like Bundler ( Webpack / Parcel ), Linter ( ESLint/SCSSLint ), Transpiler - Babel </li><b> Preferred Qualifications </b><br><li> Knowledge of latest ECMAScript feature - ES2020/19/18/16/15 and their polyfills </li><li> Experience in React Native/Micro Frontend/Design System </li><li> Experience with cloud platform (Azure/AWS) and containerisation (Docker,Kubernetes) is a plus. </li><br><b> Genpact is an Equal Opportunity Employer and considers applicants for all positions without regard to race, color, religion or belief, sex, age, national origin, citizenship status, marital status, military/veteran status, genetic information, sexual orientation, gender identity, physical or mental disability or any other characteristic protected by applicable laws. </b> Genpact is committed to creating a dynamic work environment that values diversity and inclusion, respect and integrity, customer focus, and innovation. For more information, visit www.genpact.com. Follow us on Twitter, Facebook, LinkedIn, and YouTube.<br>  "},{"link":"https://www.monsterindia.com/seeker/job-details?id=1561358&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Process Associate-Initiating, owning and driving the major incident management bridge calls","companyName":"Genpact","time":"16 hours ago","location":"Hyderabad / Secunderabad","area":null,"country":"India","description":"<br>Job Description :<br>With a startup spirit and 90,000+ curious and courageous minds, we have the expertise to go deep with the world\\u2019s biggest brands\\u2014and we have fun doing it. Now, we\\u2019re calling all you rule-breakers and risk-takers who see the world differently, and are bold enough to reinvent it. Come, transform with us.<br>Are you the one that we are looking for?<br>Inviting applications for the role of Process Associate/Developer \\u2013 ITIL (Command Center/NOC) Analyst for Armstrong Process. Responsibilities<br><li> Initiating, owning and driving the major incident management bridge calls. </li><li> Involving designated teams responsible for solving problems the issues </li><li> Sending Major incident management communication as per the communication process and defined DLs. </li><li> Updating all actions taken during driving critical incident within the incident. </li><li> Registering a PIR in detailed for further Post mortem reviews. </li><li> Sending Initial and resolved communication for Outages or Changes (Scheduled or unscheduled. </li><li> Review the IT Operations Center turnover checklist at the beginning of each shift for issues to be handled and items to be noted during the shift. </li><li> Demonstrated ability to handle various tasks with little to no forewarning </li><li> React quickly, lead and perform extraordinarily during critical/catastrophic events </li> Qualifications we seek in you!<br>Minimum qualifications <li> Minimum of a Bachelor's degree in related field Preferably in Computer Science, Information Systems, or related field. </li> Preferred qualification<br>Customer management, Team management, Good Interpersonal and Communication skills, Detail Oriented, Problem solving and Analytical ability, Reasoning skills, Work Under Stress in multiple time zones<br><b> Genpact is an Equal Opportunity Employer and considers applicants for all positions without regard to race, color, religion or belief, sex, age, national origin, citizenship status, marital status, military/veteran status, genetic information, sexual orientation, gender identity, physical or mental disability or any other characteristic protected by applicable laws. </b> Genpact is committed to creating a dynamic work environment that values diversity and inclusion, respect and integrity, customer focus, and innovation. For more information, visit www.genpact.com. Follow us on Twitter, Facebook, LinkedIn, and YouTube. "},{"link":"https://www.monsterindia.com/seeker/job-details?id=1561614&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Manager - Salesforce Lead Developer - Technology","companyName":"Genpact","time":"16 hours ago","location":"Noida","area":null,"country":"India","description":"<br>Job Description :<br>With a startup spirit and 90,000+ curious and courageous minds, we have the expertise to go deep with the world\\u2019s biggest brands\\u2014and we have fun doing it. Now, we\\u2019re calling all you rule-breakers and risk-takers who see the world differently, and are bold enough to reinvent it. Come, transform with us.<br><b><br></b><br><b> Transformation happens here. Come, be a part of our exciting journey! </b><br><b> Are you the one we are looking for? </b><br>Inviting application role for <b> Manager, Salesforce Lead Developer, Technology. </b><br>A candidate with the experience to build a custom lightning component and has knowledge of Salesforce Security Model, Data Model, Design, code, unit test, debug, implement and integrations. Has good Knowledge of JS, CSS, HTML with experience in Agile development methodologies.<br>You will be providing key business insights based on analyzing multiple data sources. You will be thinking through problems and make impactful recommendations. Your job will include collaborating across the organization with PM, architects, UX specialists, product managers and other software developers. You will use your expertise in building high-quality automated cloud solutions in an agile setting. You are encouraged to be hands-on and up to date with the latest technology stack. If this type of position motivates you, tell us why you are the right person for this exciting role! <b> Responsibilities </b><br><ul><li> Able to perform code review and code optimization </li><li> Taking the initiative to identify what the business should be supervising and evaluating </li><li> Can create Technical Design document </li><li> Ensuring that the team is following standard methodologies when architecting, programming or documenting solutions. </li><li> Ensure the timely delivery of improvements or modifications to ongoing production CRM systems. </li><li> Handling the team with the individual contributors. </li></ul><b> Qualifications </b><br><b> Minimum Qualifications </b><ul><li> Good interpersonal skills </li><li> B.Tech./ M.Tech./ MBA </li><li> Robust analytics experience </li></ul><b> Preferred Qualifications </b><br><ul><li> Ability to work Multi-functionally in a creative, Agile environment and lead multiple task assignments </li><li> Problem solving and troubleshooting skills with the ability to exercise mature judgment </li><li> Salesforce admin, dev certifications </li></ul><br><b> Genpact is an Equal Opportunity Employer and considers applicants for all positions without regard to race, color, religion or belief, sex, age, national origin, citizenship status, marital status, military/veteran status, genetic information, sexual orientation, gender identity, physical or mental disability or any other characteristic protected by applicable laws. </b> Genpact is committed to creating a dynamic work environment that values diversity and inclusion, respect and integrity, customer focus, and innovation. For more information, visit www.genpact.com. Follow us on Twitter, Facebook, LinkedIn, and YouTube.<br>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1566275&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Manager - PWA Developer Frontend Full Stack Developer","companyName":"Genpact","time":"16 hours ago","location":"Gurgaon / Gurugram","area":null,"country":"India","description":"<br>Job Description :<br>With a startup spirit and 90,000+ curious and courageous minds, we have the expertise to go deep with the world\\u2019s biggest brands\\u2014and we have fun doing it. Now, we\\u2019re calling all you rule-breakers and risk-takers who see the world differently, and are bold enough to reinvent it. Come, transform with us.<br><b> Are you the one we are looking for? Apply Now ! </b><br>Inviting applications for the role of <b> Manager, PWA Developer Frontend Full Stack Developer! </b><br>In this role you will be responsible for adhering and driving team towards standards driven API Design &amp; REST API spec conformation along with SQL/NoSQL databases performance. <b> Responsibilities </b><br><li> Driving teams towards micro-services while understanding the enterprise specific implementations with different technologies. </li><li> Flexible to work with multi-functional team to create great customer experiences and implement high quality code. </li><li> Continuously discover, evaluate, and implement new technologies to maximize development efficiency. </li><li> You priorities performance in all your development - both network and rendering </li><li> REST API construction, documentation, and architecture, including API description languages like Swagger. </li><li> Basic understanding of CSS pre-processing platforms, such as LESS, SASS &amp; PostCSS </li><li> Experience with state management libraries - Redux, Vuex, Redux-Saga/ Redux hunk </li><li> Deeply understand the Typescript/JavaScript and syntax (ES6 +) Python </li><li> Experience of any NoSQL database or a graph database is a plus. </li><li> Understanding of event patterns like CQRS and micro-services architectures is a plus. </li><li> Demonstrated awareness of cross-browser compatibility issues and client-side performance. </li><b> Qualifications </b><br><b> Minimum Qualifications </b><li> Graduation/ Post-graduation from a reputed university </li><li> Proven ability in creating web application back-end using NodeJS and experience in ReactJS/VueJS/AngularJS, NodeJS, Bootstrap, HTML5, CSS3/CSS4 and modern open-source web frameworks </li><li> Have experience in building highly scalable REST APIs and library design using Node Js, Express js/ Python </li><li> Solid grasp of any SQL database, Hands-on design and implementation experience in IT, with knowledge in a minimum of three of the following technical disciplines: </li><li> Application development, Network design, Middleware, Servers and storage </li><li> Exposure to multiple, diverse technologies and processing environments </li><li> Project solution architecture experience </li><li> Good interpersonal skills in areas such as teamwork, facilitation and negotiation </li><li> Excellent analytical, technical and leadership skills </li><li> Excellent written and verbal communication skill </li><li> Ability to translate business needs into solution architecture requirements </li><li> Ability to quickly comprehend the functions and capabilities of new technologies </li><li> Solid grasp of network and data center architecture, as well as application development methodologies </li><li> Understanding of SOA, object-oriented analysis and design, or client/server system </li><b> Preferred Qualification </b><br><li> Working experience on Git and understanding of tools like npm </li><li> Is knowledgeable about a wide range of web and internet technologies </li><li> Brings creativity to their work and designs resilient, scalable, and maintainable software. </li><li> Candidate can work with engineers, designers, product managers, and engineering managers to prioritize work and find opportunities that will benefit multiple teams. </li><li> Supervise record of designing, developing and supporting highly scalable, responsive web applications and services. </li><li> Capability for being thoughtful, outspoken and collaborative </li><li> Motivation that is focused on long-term results </li><br><b> Genpact is an Equal Opportunity Employer and considers applicants for all positions without regard to race, color, religion or belief, sex, age, national origin, citizenship status, marital status, military/veteran status, genetic information, sexual orientation, gender identity, physical or mental disability or any other characteristic protected by applicable laws. </b> Genpact is committed to creating a dynamic work environment that values diversity and inclusion, respect and integrity, customer focus, and innovation. For more information, visit www.genpact.com. Follow us on Twitter, Facebook, LinkedIn, and YouTube.<br>  "},{"link":"https://www.monsterindia.com/seeker/job-details?id=1561652&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Assistant Manager \\u2013 Inventory Management","companyName":"Genpact","time":"16 hours ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"<br>Job Description :<br>With a startup spirit and 90,000+ curious and courageous minds, we have the expertise to go deep with the world\\u2019s biggest brands\\u2014and we have fun doing it. Now, we\\u2019re calling all you rule-breakers and risk-takers who see the world differently, and are bold enough to reinvent it. Come, transform with us. Transformation happens here. Come, be a part of our exciting journey!<br><b> Inviting applications for the role of AM, Inventory Management </b><br>Material Planner is responsible for scheduling a portfolio of raw and packaging materials, in accordance with production plans and ensuring deliveries meet packing deadlines. Give to business performance by balancing customer service, inventory levels and supplier costs and delivering innovation within the portfolio of responsibility. <b> Responsibilities </b><br><ul><li> Follow company policies, processes and standard operating procedures so work is carried out responsibly, safely and ethically manner. </li><li> Control materials plan for a portfolio of raw and packaging materials. Scheduling of a portfolio of materials in accordance with production plans, ensuring deliveries meet packing deadlines. </li><li> Deliver the requirements of customer service, inventory and supplier costs to deliver agreed targets. </li><li> React quickly to changes in actual sales, sales forecast and supplier delivery dates. </li><li> Highlight risks and develop contingencies to ensure production plan and customer service levels are maintained. </li><li> Coordinate supply chain activities related to new product launch and deletion; identify constraints and highlighting potential risks. </li><li> Control of material stock levels to within budget targets, ensuring minimal write-offs are run with minimal waste. </li><li> Review and challenge, through analysis, ordering assumptions (MOQ, lead-times, inventory levels). </li><li> Build positive relationships with Factory, Production Planners, Procurement, Warehouse personnel, suppliers and customers. Demonstrate these relationships to improve the quality and robustness of supply plans and assist in business decisions. </li><li> Work with factories and key suppliers to resolve operational supply chain issues. </li><li> Continually search for opportunities to improve the reliability and responsiveness of your section of the supply chain. </li><li> Maintain the data integrity of the material planning systems. </li><li> Regularly review and maintain stock targets. </li></ul><b> Qualifications we seek in you </b><br><b> Minimum qualifications </b><br><ul><li> Bachelor Degree in all fields is an advantage (Bachelor\\u2019s Degree in Engineering, Science or Commerce preferred) </li><li> Experience in Supply Chain Planning is an advantage </li><li> Experience with MRP/ERP systems is also an advantage </li><li> SAP Experience (BW, ECC) </li><li> Ability to build relationships with Factory, Warehouse personnel, Production Planners other parts of the Supply Chain. </li><li> Develop working relationships with the Factory and key suppliers to resolve operational supply chain issues. </li><li> Monitor inventories and identify inconsistencies in usage or recorded information. Coordinate cycle count as required. </li><li> Attend and actively participate in weekly planning meetings and bi-weekly innovations meetings. Provide Supply Chain documentation for IPM. </li></ul><b> Preferred qualifications </b><br><ul><li> Ability to make fact-based decisions. </li><li> Dedication to following through with a high level of accountability. </li><li> Willing to work in a high-performance group and the ability to adjust to a constantly changing environment. </li><li> communication skills. </li><li> Ability to work within a team. </li><li> confirmed ability to establish relationships </li><li> Good in Problem Solving and Analysis </li><li> Analytical and detail-oriented </li><li> Passion for growth </li></ul><br><b> Genpact is an Equal Opportunity Employer and considers applicants for all positions without regard to race, color, religion or belief, sex, age, national origin, citizenship status, marital status, military/veteran status, genetic information, sexual orientation, gender identity, physical or mental disability or any other characteristic protected by applicable laws. </b> Genpact is committed to creating a dynamic work environment that values diversity and inclusion, respect and integrity, customer focus, and innovation. For more information, visit www.genpact.com. Follow us on Twitter, Facebook, LinkedIn, and YouTube.<br>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637752&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Microsoft Teams Development Application Developer","companyName":"Accenture","time":"16 hours ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":""},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637753&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Microsoft Teams Development Application Developer","companyName":"Accenture","time":"16 hours ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"<br>Job Description<br><strong>About Accenture: </strong>Accenture is a leading global professional services company, providing a broad range of services in strategy and consulting, interactive, technology and operations, with digital capabilities across all of these services. We combine unmatched experience and specialized capabilities across more than 40 industries — powered by the world’s largest network of Advanced Technology and Intelligent Operations centers. With 513,000 people serving clients in more than 120 countries, Accenture brings continuous innovation to help clients improve their performance and create lasting value across their enterprises. Visit us at <ul><br><li><strong>Project Role :</strong>Application Developer</li><li><strong>Project Role Description :</strong>Design, build and configure applications to meet business process and application requirements.</li><li><strong>Management Level :</strong>9</li><li><strong>Work Experience :</strong>6-8 years</li><li><strong>Work location :</strong>Bengaluru</li><li><strong>Must Have Skills :</strong>Microsoft Teams Development</li><li><strong>Good To Have Skills :</strong>Node.js</li><li><strong>Job Requirements : </strong><ul><br><li><strong>Key Responsibilities : </strong>1 Ability of designing, developing and deploying complex Teams App for small, medium and large enterprise 2 Designing and Coding of Complex custom Microsoft Team Apps 3 Understanding of Microsoft Teams Platform and advise when and how new MS Teams components should be leveraged to address business requirements 4 Identify, understand, define and evangelize best practices in technology 5 Define needed governance standards, principles, and guard rails to meet development best practices, data govern</li><br><li><strong>Technical Experience : </strong>1 Experience on Microsoft Teams and SharePoint online 2 Experience on Microsoft Power automate Office 365 is an added advantage 3 Ability of designing, developing and deploying complex Teams App for small, medium and large enterprise 4 Designing and Coding of Complex and Very Complex custom Microsoft Team Apps 5 Coding of custom Microsoft Teams App using C or Node JS 6 Experience of Java frameworks like AngularJS, React JS Knockout JS 7 Experience of ASPNET 35 and above, Microsoft Graph API,</li><br><li><strong>Professional Attributes : </strong>1 Have outstanding verbal communications skills 2 Have good client expectation management and presentation skills 3 Ability to build expertise of other people 4 Should have good problem solving and analytical skills</li><br><li><strong>Educational Qualification : </strong>Full time 15 years of regular education</li><br><li><strong>Additional Information : </strong>Experience on Microsoft Power Apps Office 365 is an added advantag</li></ul></li></ul><br>Qualifications<br>15 years of full time education "},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637749&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"React.js Application Developer","companyName":"Accenture","time":"16 hours ago","location":"Hyderabad / Secunderabad","area":null,"country":"India","description":"<br>Job Description<br><strong>About Accenture: </strong>Accenture is a leading global professional services company, providing a broad range of services in strategy and consulting, interactive, technology and operations, with digital capabilities across all of these services. We combine unmatched experience and specialized capabilities across more than 40 industries — powered by the world’s largest network of Advanced Technology and Intelligent Operations centers. With 513,000 people serving clients in more than 120 countries, Accenture brings continuous innovation to help clients improve their performance and create lasting value across their enterprises. Visit us at <ul><br><li><strong>Project Role :</strong>Application Developer</li><li><strong>Project Role Description :</strong>Design, build and configure applications to meet business process and application requirements.</li><li><strong>Management Level :</strong>9</li><li><strong>Work Experience :</strong>6-8 years</li><li><strong>Work location :</strong>Hyderabad</li><li><strong>Must Have Skills :</strong>React.js</li><li><strong>Good To Have Skills :</strong>No Function Specialization</li><li><strong>Job Requirements : </strong><ul><br><li><strong>Key Responsibilities : </strong>a Work on low level design, application build and defect fixes per the business/ functional requirements b Create automated unit test cases c Adhere to the defined coding standards Where possible, recommend best practices to the lead in-charge d Perform peer review of teams build deliverables e Contribute to technical design and creation of reusable components f Application support may be part of the responsibility during the Post-Go Live Support phase</li><br><li><strong>Technical Experience : </strong>a 3 years of experience in Reactjs and sound knowledge of Reactjs hooks b 3 years of experience in Redux and Redux-form frameworks c 4 years of sound knowledge of TypeScript Object-Oriented JavaScript d 4 years of experience with HTML5, CSS3 and writing cross-browser compatible code e Experience creating self-contained, reusable, testable and performant modules/ components which extend the elements and components of core Reactjs f 4 years of experience writing unit tests using automated TDDtask</li><br><li><strong>Professional Attributes : </strong>a Candidate should be a good team player b Candidate should also demonstrate good analytical and problem-solving skills c Candidate should have good written and verbal communication skills</li><br><li><strong>Educational Qualification : </strong>any degree</li></ul></li></ul><br>Qualifications<br>15 years of full time education "},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637483&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":" React Native Developer","companyName":"MNR Solutions Private Limited","time":"18 hours ago","location":"Pune","area":null,"country":"India","description":""},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637432&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Front Office ","companyName":"Js It Tech Solutions","time":"19 hours ago","location":"Hyderabad / Secunderabad","area":null,"country":"India","description":"Hi All,<br>GREETINGS FROM JS IT TECH SOLUTIONS!<br>We have an urgent requirement for Front Office.<br>Position: Front Office<br>Experience: 1-2 yrs.<br>Location: Hyderabad<br>Notice Period: Immediate<br>Required: Females only<br>Job Description:<br>•\tGood Looking and good communication skills.<br>Contact us: [HIDDEN TEXT] // [HIDDEN TEXT] // 9004049457<br>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637431&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Tele Caller ","companyName":"Js It Tech Solutions","time":"19 hours ago","location":"Hyderabad / Secunderabad","area":null,"country":"India","description":""},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637421&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Mobile Application Developer ","companyName":"Js It Tech Solutions","time":"19 hours ago","location":"Hyderabad / Secunderabad","area":null,"country":"India","description":"Hi All,<br>GREETINGS FROM JS IT TECH SOLUTIONS!<br>We have an urgent requirement for Mobile App Developer<br>Position:Mobile App Developer<br>Exp:4-6 years<br>Notice period:Immediate to 15 days<br>Location: Hyderabad<br>Job Description:<br>SKILLS:<br>•\tHighly proficient with Ionic, Angular, Java Spring along with angular or react or Vue.js or flutter (any two of these skills), AWS or Azure, Kafka.<br>•\tExperience with Mobile App specifically hybrid model, MySQL, NoSQL<br>•\tGood exposure on scalable platform development<br>•\tExperience with agile methodologies<br>Contact : [HIDDEN TEXT]/ [HIDDEN TEXT]// 7893797028<br>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637416&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"PHP Laravel AngularJs Developer","companyName":"Jupiter Consulting","time":"20 hours ago","location":"Pune","area":null,"country":"India","description":"Skills: PHP + Laravel +Angular JS<div><br></div><div>Remote Working(Work From Home facility available)</div><div><br></div><div>Exp: 5-10 yrs</div><div><br></div><div>Immediate Joiners preferred.</div><div><br></div><div>Interested candidates mail CV to [HIDDEN TEXT] with subject \"Full Stack\"</div>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637403&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"PHP Web Developer","companyName":"BitsNPixs Technologies Pvt. Ltd. ","time":"20 hours ago","location":"Nagercoil, Thiruvananthapuram / Trivandrum","area":null,"country":"India","description":"• Should be well versed with latest Laravel framework.<br>• Experience in Object oriented PHP programming, Understanding of MVC design patterns.<br>• Experience in web fundamentals HTML, JS, CSS and AJAX.<br>• Familiarity with front-end libraries and framework like jQuery, React, VueJs.<br>• Should be familiar with Git version control"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637390&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"React Native Developer","companyName":"Hucon Solutions India Private Limited","time":"21 hours ago","location":"Hyderabad / Secunderabad","area":null,"country":"India","description":"Proficiency Level: Highly skilled at React Native with around 2-3 years experience of writing React native based Mobile Applications.<br>Strong analytical, problem solving, organisational, and detail oriented skills<br>Must be able to work both on a team or individually, in an adaptable, agile environment<br>Excellent communication skills"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637325&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Applications Developer 5","companyName":"Oracle","time":"a day ago","location":"Bengaluru / Bangalore, Pune","area":null,"country":"India","description":""},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637318&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Applications Developer 5","companyName":"Oracle","time":"a day ago","location":"Bengaluru / Bangalore, Pune","area":null,"country":"India","description":"<br>Preferred Qualifications<br><strong>Description</strong><br>With tremendous market success in our Cloud Applications, especially in ERP Cloud, Higher Ed institutions have expressed unprecedented interest in embarking a cloud adoption journey with Oracle.&nbsp; Student Information Systems, a critical functional area to complete in our SaaS footprint for Higher Ed, is one top investment priority for Oracle.<br>The Senior Principal Software Engineer plays an important role in Oracle%26rsquo;s plan to disrupt the market. This role is responsible for developing key product features and differentiators for the Student Cloud. As part of the Higher Ed Development team, this role works with product strategy, product management, customers, development, UX, QA, etc.) and will also be mentoring and other developers.<br>This is a senior position. The successful candidate will develop a deep understanding of all (relevant) Oracle, industry and related technologies, Fusion tech stack and other cloud products, and will be responsible for the continuing development of a world class, scalable product architecture and intuitive Student Cloud products which will be used by institutions and students worldwide.<br>As a technical leader with the Oracle Student Cloud development team, you will work on and provide direction to projects that solve complex technical problems that provide substantial customer value and differentiator. You will be in regular interactions with other key executives, leaders and developers and work with team members spread across the globe. This is an extremely challenging, very fast paced, extremely rewarding and highly visible position.<br><strong>Responsibilities</strong><br>Build full stack prototypes and/or proof of concepts using libraries and frameworks.<br>Solve complex technical challenges and implement process amongst the development teams.<br>Provide technical and architectural leadership to a large, world-wide team.<br>Enforce application design patterns and development practices.<br>Leverage leadership abilities to inspire and influence others, internal and external teams<br>Build relationships and influence outside of authority while leveraging Oracle expertise and resources.<br>Research and present technical solutions to technical management and senior individual contributors.<br><strong>Requirements</strong><br>Deep architectural leadership experience in SaaS/Cloud as well as in enterprise software solutions.<br>Commercial experience as lead developer of complex cross application products and/or underlying infrastructure that has shipped and in use by large number of customers.<br>High degree of competence in written and verbal communication skills, including experience communicating with Executive audiences.<br>BS or MS degree or equivalent experience relevant to functional area, multiple domains preferred.<br>15+ years of software engineering and technical leadership experience.<br>Highly familiar with Agile methodologies and experience in guiding agile teams.<br>Excellent problem solving, critical thinking, and communication skills.<br>Self driven and highly motivated by meaningful and impactful work.<br>Ability to work in an extremely fast paced and challenging environment.<br>Excellent command of written and spoken English.<br>Passion and empathy for human/consumer centered design.<br><strong>Skills</strong><br>Backend<ul><br><li>Java/C#/Python or other object oriented language.</li><br><li>Deep knowledge of data modeling and query performance tuning.</li><br><li>Deep knowledge of REST service design and implementation.</li><br><li>Cloud Infrastructure design patterns.</li><br></ul><br>Front end<ul><br><li>Experienced with more than one JavaScript framework (Angular, React, etc%26hellip;).</li><br><li>Experienced with unit testing (Jasmine, Mocha, Chai, etc%26hellip;).</li><br><li>Experienced with functional automation testing, Selenium.</li><br><li>Experienced with JavaScript Build libraries.</li><br><li>Experienced in CSS/CSS pre compilers (SASS, LESS, etc%26hellip;).</li><br><li>Experienced in Mobile design and development.</li><br><li>UI Component design patterns.</li><br><li>JavaScript design patterns.</li><br><li>Experience with JavaScript ES5, JavaScript ES6, and/or TypeScript.</li><br><li>Experience with NPM, NodeJS, Deno</li><br></ul><br><strong>Bonus</strong><br>Expert in accessibility<br>Expert in data security<br>Expert in UI security<br>Advanced knowledge of pipeline tools (Jenkins, TeamCity)<br>Experience with: &nbsp;ADF, ADF REST, OCI, Oracle JET, Oracle Visual Builder<br>Detailed Description and Job Requirements<br>Analyze, design develop, troubleshoot and debug software programs for commercial or end user applications. Writes code, completes programming and performs testing and debugging of applications.<br>As a member of the software engineering division, you will specify, design and implement major changes to existing software architecture. Create new architecture for a moderate product or a portion of a major product. Build and execute unit tests and unit test plans. Review integration and regression test plans created by QA. Communicate with QA and porting engineering to ensure consistency, testability and portability across products in general.<br>Provide leadership and expertise in the development of new products/services/processes, frequently operating at the leading edge of technology. Recommends and justifies major changes to existing products/services/processes. BS or MS degree or equivalent experience relevant to functional area. 8 or more years of software engineering or related experience."},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637373&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Software Engineering","companyName":"JP Morgan Chase &amp; Co.","time":"a day ago","location":"Hyderabad / Secunderabad","area":null,"country":"India","description":"<br>Job Description :<br>As a member of our Software Engineering Group, we look first and foremost for people who are passionate around solving business problems through innovation and engineering practices. You'll be required to apply your depth of knowledge and expertise to all aspects of the software development lifecycle, as well as partner continuously with your many stakeholders on a daily basis to stay focused on common goals. We embrace a culture of experimentation and constantly strive for improvement and learning. You’ll work in a collaborative, trusting, thought-provoking environment—one that encourages diversity of thought and creative solutions that are in the best interests of our customers globally.<br>This role requires a wide variety of strengths and capabilities, including:<br><strong>Roles and Responsibilities</strong><ul><li>Designs, analyzes, develops automation framework/scripts, tests, debugs and documents programming to satisfy business requirements</li><li>Utilize excellent organizational skills, proven analytical, planning, problem solving and decision-making skills.</li><li>Ability to work proficiently and effectively in an Agile / Scrum feature team environment</li><li>Provide support to the application in terms of analyzing testing issues, maintaining the regression suite, build test data and build tests as per the acceptance criteria</li><li>Research new technologies, identify and learn best practice, adapt quickly and provide technical guidance to other team members</li><li>Adapt Devops model of continuous and automated integration, test and delivery</li><li>Work with multiple globally distributed teams to deliver end-to-end solution across regions</li></ul><br><strong>Required Skills</strong><ul><li>B.E/B.Tech/MCA degree</li><li>6+years Hands-on experience in designing and developing automation framework for Web based applications, APIs, etc</li><li>Comfortable in bothDevelopment andAutomation experience and sound knowledge in Java, Selenium, Cucumber, Maven, RestAssured, Chromium</li><li>2+ years of experience on testing applications withUI technologies such as Angular JS, React etc.</li><li>2+ year experience in designing automation scripts using BDD approach</li><li>2+ years of experience in working within an Agile team doing in-sprint automation development and managing integration scripts</li><li>Should have hands-on experience in using tools (or similar) like IntelliJ, Eclipse, GIT/BitBucket, BitBucket/Git/Gitflow and JIRA.</li><li>2+ years of experience onwriting complex SQL queries</li><li>Hands-on experience with all the levels of testing including Smoke, Usability, Functional, Integration, Regression, Re-testing, User Acceptance and System Testing.</li><li>Experience in developing tests for Windows as well as UNIX or LINUX environment.</li><li>Strong Team player abilities and Quick Learner, enthusiastic to learn new concepts and technologies.</li><li>Good communication skills</li><li>Good analytical skills for effective problem solving</li></ul><br><strong>Good to have skills</strong><ul><li>Experience in tools such as Jenkins</li><li>Awareness of using SQL, XML message formats is a plus.</li><li>Awareness of Cloud concepts</li></ul>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637374&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Full Stack (AEM) Web Developer - Channel Marketing Execution","companyName":"JP Morgan Chase &amp; Co.","time":"a day ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"<br>Job Description :<br><strong>Position summary:</strong><br>The Full Stack Web Developer will report to the Technology Manager of Core Digital. You’ll be part of a cross-functional team that’s responsible for the full software development life cycle, from conception to deployment. As a full stack developer, you should be comfortable with both front-end and back-end coding languages, development frameworks and third-party libraries.<br><strong>Responsibilities</strong><br>· Web UI development<br>o Build web components and templates for our digital properties through <strong>Adobe Experience Manager</strong> (AEM) and/or latest HTML framework<br>o Work from supplied wire frames and functional requirements to build web interfaces using HTML, JavaScript, and CSS, and work with team to integrate with back-end systems.<br>o Write effective APIs as needed<br>o Build features and applications with a mobile responsive design<br>o Test software to ensure responsiveness and efficiency<br>o Troubleshoot and resolve cross-browser and cross-platform issues.<br>o Optimize web sites for maximum speed and scalability<br>o Manage day-to-day efforts to ensure smooth &amp; efficient delivery to include production updates, code changes, and collaboration on new initiatives<br>o Collaborate with other developers<br>o Write technical documentation<br>o Remain current with the latest digital design trends and tools<br>o Handle production work, as needed, to meet project deadlines<br>· Collaboration with design, product owner, and content production teams<br>o Collaborate with teams to ensure design quality and consistency of web pages.<br>o Validate UI/UX designs for technical feasibility<br>o Assist with requirements definition, specifications, design, development and timelines for key initiatives<br><strong>Recommended Qualifications</strong><br>· Strong foundation in web development<br>• HTML5 (required)<br>• CSS3 (required) and CSS pre-processors (Less preferred)<br>• JavaScript (JQuery preferred)<br>• Asynchronous request handling, partial page updates, and AJAX<br>• Experience with modern web frameworks (Bootstrap preferred; Node.js/React a plus)<br>• Solid understanding of responsive design<br>• Experience with Java and Maven<br>· Experience with web site optimization<br>• Proficient understanding of cross-browser compatibility issues and ways to work around them<br>• Knowledge of optimizing graphics for different platforms<br>• Good understanding of SEO principles<br>• Experience adhering to ADA WCAG 2.0 AA standards (preferred)<br>· Experience with Content Management Systems - Adobe Experience Manager (AEM) 6.x preferred<br>• HTML Templating Language (HTL) and Sightly<br>• Component development<br>· Proficient understanding of code versioning tools (Git, BitBucket preferred)<br>· Proven success working in a dynamic, fast-paced environment<br>• Ability to manage multiple, on-going timelines, as well as ad-hoc  rush requests<br>• Ability to organize and prioritize workload<br>• Flexibility to adapt to changing design requirements<br>• Outstanding attention to detail<br>• Strong communication and presentation skills with audiences across all levels<br>· Degree in Computer Science or related field"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637365&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Software Engineering","companyName":"JP Morgan Chase &amp; Co.","time":"a day ago","location":"Hyderabad / Secunderabad","area":null,"country":"India","description":"<br>Job Description :<br>As a member of our Software Engineering Group, we look first and foremost for people who are passionate around solving business problems through innovation and engineering practices. You'll be required to apply your depth of knowledge and expertise to all aspects of the software development lifecycle, as well as partner continuously with your many stakeholders on a daily basis to stay focused on common goals. We embrace a culture of experimentation and constantly strive for improvement and learning. You’ll work in a collaborative, trusting, thought-provoking environment—one that encourages diversity of thought and creative solutions that are in the best interests of our customers globally.<br>This role requires a wide variety of strengths and capabilities, including:<br><strong>Roles and Responsibilities</strong><ul><li>Designs, analyzes, develops automation framework/scripts, tests, debugs and documents programming to satisfy business requirements</li><li>Utilize excellent organizational skills, proven analytical, planning, problem solving and decision-making skills.</li><li>Ability to work proficiently and effectively in an Agile / Scrum feature team environment</li><li>Provide support to the application in terms of analyzing testing issues, maintaining the regression suite, build test data and build tests as per the acceptance criteria</li><li>Research new technologies, identify and learn best practice, adapt quickly and provide technical guidance to other team members</li><li>Adapt Devops model of continuous and automated integration, test and delivery</li><li>Work with multiple globally distributed teams to deliver end-to-end solution across regions</li></ul><br><strong>Required Skills</strong><ul><li>B.E/B.Tech/MCA degree</li><li>6+years Hands-on experience in designing and developing automation framework for Web based applications, APIs, etc</li><li>Comfortable in bothDevelopment andAutomation experience and sound knowledge in Java, Selenium, Cucumber, Maven, RestAssured, Chromium</li><li>2+ years of experience on testing applications withUI technologies such as Angular JS, React etc.</li><li>2+ year experience in designing automation scripts using BDD approach</li><li>2+ years of experience in working within an Agile team doing in-sprint automation development and managing integration scripts</li><li>Should have hands-on experience in using tools (or similar) like IntelliJ, Eclipse, GIT/BitBucket, BitBucket/Git/Gitflow and JIRA.</li><li>2+ years of experience onwriting complex SQL queries</li><li>Hands-on experience with all the levels of testing including Smoke, Usability, Functional, Integration, Regression, Re-testing, User Acceptance and System Testing.</li><li>Experience in developing tests for Windows as well as UNIX or LINUX environment.</li><li>Strong Team player abilities and Quick Learner, enthusiastic to learn new concepts and technologies.</li><li>Good communication skills</li><li>Good analytical skills for effective problem solving</li></ul><br><strong>Good to have skills</strong><ul><li>Experience in tools such as Jenkins</li><li>Awareness of using SQL, XML message formats is a plus.</li><li>Awareness of Cloud concepts</li></ul>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637366&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Software Engineering","companyName":"JP Morgan Chase &amp; Co.","time":"a day ago","location":"Hyderabad / Secunderabad","area":null,"country":"India","description":"<br>Job Description :<br>As a member of our Software Engineering Group we look first and foremost for people who are passionate around solving business problems through innovation &amp; engineering practices. You will be required to apply your depth of knowledge and expertise to all aspects of the software development lifecycle, as well as partner continuously with your many stakeholders on a daily basis to stay focused on common goals. We embrace a culture of experimentation and constantly strive for improvement and learning. You’ll work in a collaborative, trusting, thought-provoking environment—one that encourages diversity of thought and creative solutions that are in the best interests of our customers globally.<br>This role requires a wide variety of strengths and capabilities, including: <ul><li>Advanced knowledge of application, data and infrastructure architecture disciplines</li><li>Understanding of architecture and design across all systems</li><li>Working proficiency in developmental toolsets</li><li>Ability to collaborate with high-performing teams and individuals throughout the firm to accomplish common goals</li><li>Proficiency in one or more general purpose programming languages Java/J2EE, Web Service, Cloud, Micro service, Spring Boot, Kafka</li><li>Understanding of software skills such as business analysis, development, maintenance and software improvement</li><li>8 to 10+ Years of Experience in developing, deploying and administering Java applications using JAVA, Spring Boot, Spring Cloud and Web services technologies (REST and SOAP)</li><li>2+ years of experience in Micro service Architecture, Kafka, Pivotal Cloud Foundry or any cloud experience</li><li>6+ years of experience in Java spring, Java Spring MVC, Spring Batch, Spring JPA, React JS, Angular JS, Hibernate, Web services, HTML5, JavaScript, CSS, XML, JQuery, Rest API, GIT, Tomcat, Websphere.</li><li>Experience in application development, including analyzing stories, writing code, implementing automated tests, contributing to release and developing the working practices of the team</li><li>Experience of Agile team working and globally deployed applications working across a Wide Area Network</li><li>Must have experience in developing performance intensive, high availability applications using Kafka, Cassandra, PCF/eHcache etc.</li><li>Candidate should have a strong Infrastructure Architecture understanding with experience with virtualization technologies is a plus.</li><li>Hands on experience with web technologies (e.g. HTTP, XML, REST, HTML, etc)</li><li>Hands on with development and test automation tools/frameworks (e.g. Cucumber/Gherkin, Selenium Grid, Junit, SOAPUI, Eclipse, Jenkins, CA-Lisa, Ant, Maven, Visual Studio, HP ALM/QTP, JIRA, etc)</li><li>Good understanding of Software development lifecycle and agile methodologies</li><li>Good understanding and working experience on TDD, BDD and Shift Left concepts</li><li>Understanding of Database schemas and SQL queries a must</li></ul><br><strong>General Qualifications:</strong><ul><li>B.E/B.Tech degree or equivalent experience</li><li>Overall relevant industry experience of 10+ years</li><li>Excellent organization and communication skills (written, oral and presentation) is must</li><li>Must have full life-cycle experience in large, global multi-tiered systems, preferably in the financial industry</li><li>Excellent interpersonal relationship and communication / presentation skills</li><li>Strong technical documentation skills</li><li>Demonstrates initiative and is a self-starter</li><li>Prepared to challenge when business requirements seem conflicting</li><li>Drive/Determination and knowledge.</li></ul><br><strong>Professional Skills:</strong><br>The behavioral requirements of this role are as follows:- <ul><li>Excellent process discipline in project execution.</li><li>High level of personal commitment to each task, a can do attitude and a drive to deliver.</li><li>Strong communication skills to be able to communicate at all levels.</li><li>High level of responsibility and Ownership from inception through to implementation.</li><li>The candidate should have a proactive approach to problem solving.</li><li>Good analysis skills in order to aid in trouble shooting and problem solving</li></ul>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637359&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Software Engineering","companyName":"JP Morgan Chase &amp; Co.","time":"a day ago","location":"Mumbai","area":null,"country":"India","description":"<br>Job Description :<br>As a member of our Software Engineering Group we look first and foremost for people who are passionate around solving business problems through innovation &amp; engineering practices. You will be required to apply your depth of knowledge and expertise to all aspects of the software development lifecycle, as well as partner continuously with your many stakeholders on a daily basis to stay focused on common goals. We embrace a culture of experimentation and constantly strive for improvement and learning. You’ll work in a collaborative, trusting, thought-provoking environment—one that encourages diversity of thought and creative solutions that are in the best interests of our customers globally.<br>This role requires a wide variety of strengths and capabilities, including: <ul><li>Advanced knowledge of application, data and infrastructure architecture disciplines</li><li>Understanding of architecture and design across all systems</li><li>Working proficiency in developmental toolsets</li><li>Ability to collaborate with high-performing teams and individuals throughout the firm to accomplish common goals</li><li>Proficiency in one or more general purpose programming languages Java/J2EE, Web Service, Cloud, Micro service, Spring Boot, Kafka</li><li>Understanding of software skills such as business analysis, development, maintenance and software improvement</li><li>8 to 10+ Years of Experience in developing, deploying and administering Java applications using JAVA, Spring Boot, Spring Cloud and Web services technologies (REST and SOAP)</li><li>2+ years of experience in Micro service Architecture, Kafka, Pivotal Cloud Foundry or any cloud experience</li><li>6+ years of experience in Java spring, Java Spring MVC, Spring Batch, Spring JPA, React JS, Angular JS, Hibernate, Web services, HTML5, JavaScript, CSS, XML, JQuery, Rest API, GIT, Tomcat, Websphere.</li><li>Experience in application development, including analyzing stories, writing code, implementing automated tests, contributing to release and developing the working practices of the team</li><li>Experience of Agile team working and globally deployed applications working across a Wide Area Network</li><li>Must have experience in developing performance intensive, high availability applications using Kafka, Cassandra, PCF/eHcache etc.</li><li>Candidate should have a strong Infrastructure Architecture understanding with experience with virtualization technologies is a plus.</li><li>Hands on experience with web technologies (e.g. HTTP, XML, REST, HTML, etc)</li><li>Hands on with development and test automation tools/frameworks (e.g. Cucumber/Gherkin, Selenium Grid, Junit, SOAPUI, Eclipse, Jenkins, CA-Lisa, Ant, Maven, Visual Studio, HP ALM/QTP, JIRA, etc)</li><li>Good understanding of Software development lifecycle and agile methodologies</li><li>Good understanding and working experience on TDD, BDD and Shift Left concepts</li><li>Understanding of Database schemas and SQL queries a must</li></ul><br><strong>General Qualifications:</strong><ul><li>B.E/B.Tech degree or equivalent experience</li><li>Overall relevant industry experience of 10+ years</li><li>Excellent organization and communication skills (written, oral and presentation) is must</li><li>Must have full life-cycle experience in large, global multi-tiered systems, preferably in the financial industry</li><li>Excellent interpersonal relationship and communication / presentation skills</li><li>Strong technical documentation skills</li><li>Demonstrates initiative and is a self-starter</li><li>Prepared to challenge when business requirements seem conflicting</li><li>Drive/Determination and knowledge.</li></ul><br><strong>Professional Skills:</strong><ul><li>The behavioral requirements of this role are as follows:-</li><li>Excellent process discipline in project execution.</li><li>High level of personal commitment to each task, a can do attitude and a drive to deliver.</li><li>Strong communication skills to be able to communicate at all levels.</li><li>High level of responsibility and Ownership from inception through to implementation.</li><li>The candidate should have a proactive approach to problem solving.</li><li>Good analysis skills in order to aid in trouble shooting and problem solving</li></ul>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637150&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Software Engineer","companyName":"Wells Fargo","time":"a day ago","location":"Hyderabad / Secunderabad","area":null,"country":"India","description":"<br>Job Description :<br>About Wells Fargo<br>Wells Fargo &amp; Company (NYSE: WFC) is a leading global financial services company headquartered in San Francisco (United States). Wells Fargo has offices in over 30 countries and territories. Our business outside of the U.S. mostly focuses on providing banking services for large corporate, government and financial institution clients. We have worldwide expertise and services to help our customers improve earnings, manage risk, and develop opportunities in the global marketplace. Our global reach offers many opportunities for you to develop a career with Wells Fargo. Join our diverse and inclusive team where you will feel valued and inspired to contribute your unique skills and experience. We are looking for talented people who will put our customers at the center of everything we do. Help us build a better Wells Fargo. It all begins with outstanding talent. It all begins with you.<br>Market Job Description<br><strong>About Wells Fargo India<br></strong><br>Wells Fargo India enables global talent capabilities for Wells Fargo Bank NA., by supporting business lines and staff functions across Technology, Business Services, Risk Services and Product, Analytics and Modeling (PAM). We are operating in Hyderabad, Bengaluru and Chennai locations.<br><strong>Department Overview<br></strong><br>Payments, Virtual Solutions, and Innovation /Community Bank Technology within the Enterprise Information Technology business provides strategic technology solutions to the both the PVSI and Community Banking lines of business, including application design, development, and support.<br><strong>About the Role<br></strong><li><br>As Software Engineer, you will be working as a Developer as well as responsible for Test automation.</li><li><br>Overall strong functional knowledge, fungible core java experience (comprising OOP, IO Operations, Exception Handling , Functional Interface etc.), TDD/BDD and software validation</li><br><strong>Responsibilities:<br></strong><br><li><br>Good Development Experience in J2EE technologies</li><li><br>Working Knowledge of TDD/BDD &amp; well versed in Software Development Practices</li><li><br>Must bring a unique Solutions Engineering and development Approach. Must be proficient with Agility, CD &amp; CI interoperability.</li><li><br>Develops Test Automation Framework, Test execution and Service Virtualization components</li><li><br>Continuously involved in testing for functional, regression, smoke, resiliency, and orchestrate chaos testing strategies</li><li><br>Explore continuous inspection capabilities code quality to identify problems before they manifest in production</li><br><strong>Essential Qualifications<br></strong><br><li><br>5+ years of application development, Testing and implementation experience</li><li><br>Software Development: Java, React, Springboot, TestNG, Junit, JSON, SOAP UI, Kafka</li><li><br>Web/Mobile Testing: Selenium, Appium, Perfecto Mobile, Applitools &amp; Postman (API Testing)</li><li><br>CI/CD and Automation: Jenkins, Maven, Gradle, Gitlab, SonarQube, Artifactory, Ansible</li><br><strong>Desired Qualifications<br></strong><li><br>Chaos Testing: Toxy-Proxie, Kafka Trogdor</li><li><br>OS and Platform - PCF, Kubernetes, Linux, Windows, VMware</li><li><br>Service Virtualization: CA Dev Test, Mockito, Wire Mock, Parasoft, Lisa</li><li><br>Monitoring: AppDynamics, Splunk, ELK</li><li><br>Exposure to RPA </li><li><br>Distributed technologies: Kafka, MongoDb, Cassandra etc</li><br>We Value Diversity<br>At Wells Fargo, we believe in diversity and inclusion in the workplace; accordingly, we welcome applications for employment from all qualified candidates, regardless of race, color, gender, national or ethnic origin, age, disability, religion, sexual orientation, gender identity or any other status protected by applicable law. We comply with all applicable laws in every jurisdiction in which we operate."},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637144&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Software Engineer","companyName":"Wells Fargo","time":"a day ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"<br>Job Description :<br>About Wells Fargo<br>Wells Fargo &amp; Company (NYSE: WFC) is a leading global financial services company headquartered in San Francisco (United States). Wells Fargo has offices in over 30 countries and territories. Our business outside of the U.S. mostly focuses on providing banking services for large corporate, government and financial institution clients. We have worldwide expertise and services to help our customers improve earnings, manage risk, and develop opportunities in the global marketplace. Our global reach offers many opportunities for you to develop a career with Wells Fargo. Join our diverse and inclusive team where you will feel valued and inspired to contribute your unique skills and experience. We are looking for talented people who will put our customers at the center of everything we do. Help us build a better Wells Fargo. It all begins with outstanding talent. It all begins with you.<br>Market Job Description<br><strong>About Wells Fargo India<br></strong><br>Wells Fargo India enables global talent capabilities for Wells Fargo Bank NA., by supporting business lines and staff functions across Technology, Business Services, Risk Services and Product, Analytics and Modeling (PAM). We are operating in Hyderabad, Bengaluru and Chennai locations.<br><strong>Department Overview<br></strong><br>Payments, Virtual Solutions, and Innovation /Community Bank Technology within the Enterprise Information Technology business provides strategic technology solutions to the both the PVSI and Community Banking lines of business, including application design, development, and support.<br><strong>About the Role<br></strong><br>Need to play Senior Developer role that expected to perform front end and back end related design, development and maintenance activities for DAT applications in DODCT area in C&amp;SBBT. Candidate needs to work with US partner teams and it demands to be available as per the delivery timelines<br><strong>Responsibilities<br></strong><br><li><br>Works with diverse group of developers, business subject matter experts, project management from multiple teams with assertiveness and tact</li><li><br>Play a technical lead role (coding, code reviews, design reviews, internal testing sign off etc.) for deliverables from WFI.</li><li><br>Technical point of contact for all technical issues and partner with the team to analyze, investigate and resolve open issues, vulnerabilities, secure coding etc.</li><li><br>Contribute to the design discussions, contribute towards design discussions, perform PoCs where ever required to support/back up design decisions.</li><li><br>Provide technical expertise to support team during incident/problem resolution.</li><li><br>Ability e to monitor and analyze production application logs<br>Ability to do the reviews and follow the process methodologies and documentation</li><br><strong>Essential Qualifications<br></strong><br><li><br>Bachelor's/Master’s degree in Computer Science or equivalent</li><li><br>8-12 yrs. of hands-on IT experience in developing complex, highly integrated, web-based applications using Java/J2EE,Spring web services, Micro services, Spring MVC, Spring boot, Hibernate and worked in Agile teams.</li><li><br>Should have strong work experience in UI tech stack - HTML5, JavaScript(ES5 &amp; ES6) ,Object oriented JavaScript, Ajax, JSON, , Angular/React JS frameworks and Responsive web development. </li><li><br>Knowledge working with GIT, Maven/Gradle , JIRA tools</li><li><br>Experience in implementation of Java, J2EE and JS Design patterns.</li><li><br>Hands-on experience in MSSQL / Oracle databases </li><li><br>Experience in writing unit cases using Junit, Mocha/Jasmine/Jest libraries.</li><li><br>Should be able to deploy the application in non-production environments on Linux platforms.</li><li><br>Experience in Agile methodology</li><br><strong>Desired Qualifications<br></strong><br><li><br>Good verbal and written communication skills</li><li><br>Good problem solving and analytical skills</li><li><br>Should be detail oriented, able to multi task</li><br><strong>Nice to Have - Skills: </strong><br><li><br>Experience in PLSQL and other DB concepts are added advantage.</li><li><br>Banking Applications experience.</li><br>We Value Diversity<br>At Wells Fargo, we believe in diversity and inclusion in the workplace; accordingly, we welcome applications for employment from all qualified candidates, regardless of race, color, gender, national or ethnic origin, age, disability, religion, sexual orientation, gender identity or any other status protected by applicable law. We comply with all applicable laws in every jurisdiction in which we operate."},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637200&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Application Developer: Experience Front End","companyName":"IBM","time":"a day ago","location":"Chennai","area":null,"country":"India","description":"<br>Job Description :<br>Introduction<br>As an Application Developer, you will lead IBM into the future by translating system requirements into the design and development of customized systems in an agile environment. The success of IBM is in your hands as you transform vital business needs into code and drive innovation. Your work will power IBM and its clients globally, collaborating and integrating code into enterprise systems. You will have access to the latest education, tools and technology, and a limitless career path with the world’s technology leader. Come to IBM and make a global impact!<br>Your Role and Responsibilities<br><strong><br>Who you are: </strong><li><br>As Application Developer, you are responsible to develop applications in Experience Front End. </li><strong><br>What you’ll do: </strong><li><br>Develop prototypes and performs hands-on coding to develop and integrate the application user interface.</li><li><br>Translate graphic visual and interactive designs into the presentation layer for highly interactive web and mobile applications using responsive design and development techniques.</li><li><br>Independently plans installs, integrates and validates systems software and hardware solutions.</li><li><br>Leads technical change implementation across environments. Acquires and applies broad knowledge of the business, its products, and processes.</li><li><br>Resolves issues and navigates obstacles to deliver work product.</li><strong><br>How we’ll help you grow:</strong><li><br>You’ll have access to all the technical and management training courses to become the expert you want to be</li><li><br>You’ll learn directly from experienced developers in the field, our team leads love to mentor</li><li><br>You have the opportunity to work in many different areas to figure out what really excites you.</li><br>Required Technical and Professional Expertise<br><li><br>Minimum 6+ years of experience in development using Angular JS 2.0.</li><li><br>Experience in Hypertext Markup Language Revision 5 (HTML5), Cascading Style Sheets (CSS) and ReactJS (javascript)</li><br>Preferred Technical and Professional Expertise<br><li><br>Working knowledge in ES6, React, Redux, React Router, Udesign, art, typography and photography is highly desired</li><li><br>Ambitious individual who can work under their own direction towards agreed targets/goals.</li><li><br>Ability to manage change and be open to it good time management and an ability to work under stress</li><li><br>Proven interpersonal skills while contributing to team effort by accomplishing related results as needed</li><li><br>Maintain technical knowledge by attending educational workshops, reviewing publications</li><br>About Business Unit<br>IBM Services is a team of business, strategy and technology consultants that design, build, and run foundational systems and services that is the backbone of the world's economy. IBM Services partners with the world's leading companies in over 170 countries to build smarter business by reimagining and reinventing through technology, with its outcome-focused methodologies, industry-leading portfolio and world class research and operations expertise leading to results-driven innovation and enduring excellence.<br>Your Life @ IBM<br>What matters to you when you’re looking for your next career challenge?<br>Maybe you want to get involved in work that really changes the world. What about somewhere with incredible and diverse career and development opportunities – where you can truly discover your passion? Are you looking for a culture of openness, collaboration and trust – where everyone has a voice? What about all of these? If so, then IBM could be your next career challenge. Join us, not to do something better, but to attempt things you never thought possible.<br>Impact. Inclusion. Infinite Experiences. Do your best work ever.<br>About IBM<br>IBM’s greatest invention is the IBMer. We believe that progress is made through progressive thinking, progressive leadership, progressive policy and progressive action. IBMers believe that the application of intelligence, reason and science can improve business, society and the human condition. Restlessly reinventing since 1911, we are the largest technology and consulting employer in the world, with more than 380,000 IBMers serving clients in 170 countries.<br>Location Statement<br>For additional information about location requirements, please discuss with the recruiter following submission of your application.<br>Being You @ IBM<br>IBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.<br>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637199&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Application Developer: Java Full Stack","companyName":"IBM","time":"a day ago","location":"Hyderabad / Secunderabad","area":null,"country":"India","description":"<br>Job Description :<br>Introduction<br>As an Application Developer, you will lead IBM into the future by translating system requirements into the design and development of customized systems in an agile environment. The success of IBM is in your hands as you transform vital business needs into code and drive innovation. Your work will power IBM and its clients globally, collaborating and integrating code into enterprise systems. You will have access to the latest education, tools and technology, and a limitless career path with the world’s technology leader. Come to IBM and make a global impact!<br>Your Role and Responsibilities<br><strong><br>Your day in the role will include...</strong><br><li><br>Expert in Backend and Front end technologies</li><li><br>Proven in developing and implementation and providing solutions to the given problem in all the Java technologies</li><li><br>Proficient in stitch together end to end application starting from front end web development, back end development, middleware integration and persisting data in no SQL or DBMS database </li><li><br>Strong into trends and directions of the Industry, marketplace and the players</li><li><br>Provide objective guidance without personal or political considerations </li><strong><br>You will come with...</strong><br><li><br>Hands on experience with JAVA 8 and above – Java 8 or higher. Should know both Spring and Hibernate. Spring 4 or above.</li><li><br>Should be experienced in OOP concepts well. Should be proficient in exception handling , collections, Abstract Classes and Interfaces, Constructors, File IO and Serialization, Collections (List, Map, Set), Access Specifiers, Exceptions (Checked, Unchecked), Generics, Java Keywords (Static, Final, Volatile, Synchronized, Transient), JVM and Memory Management, Multithreading and Synchronization, JSP/ Servlets,JMS . Should be skilled in one of the IDEs like Eclipse , IntelliJ. Should be conversant with Build tools like Ant , Maven.</li><li><br>Experience of working in HTML 5 , CSS3, Angular JS, Spring MVC, Spring Boot, REST API, JUnit </li><strong><br>How we’ll help you grow: </strong><br><li><br>You’ll have access to all the technical and management training courses that will help you</li><li><br>You’ll learn directly from guide developers in the field; our team leads love to mentor</li><li><br>You have the opportunity to work in many different areas to identify what really excites you</li><br>Required Technical and Professional Expertise<br><li><br>Java 8 , JEE, Spring Core, Spring Boot, Spring MVC, REST , Hibernate, Angular JS , Node JS, CSS3 , HTML5, Any RDBMS database (DB2, Postgre, MYSQL, Oracle etc.) and Sql knowledge , Git , Maven, Eclipse / Intellij, Design Patterns</li><br>Preferred Technical and Professional Expertise<br>• Microservices , Docker, Spring Cloud, GW<br>About Business Unit<br>IBM Services is a team of business, strategy and technology consultants that design, build, and run foundational systems and services that is the backbone of the world's economy. IBM Services partners with the world's leading companies in over 170 countries to build smarter business by reimagining and reinventing through technology, with its outcome-focused methodologies, industry-leading portfolio and world class research and operations expertise leading to results-driven innovation and enduring excellence.<br>Your Life @ IBM<br>What matters to you when you’re looking for your next career challenge?<br>Maybe you want to get involved in work that really changes the world. What about somewhere with incredible and diverse career and development opportunities – where you can truly discover your passion? Are you looking for a culture of openness, collaboration and trust – where everyone has a voice? What about all of these? If so, then IBM could be your next career challenge. Join us, not to do something better, but to attempt things you never thought possible.<br>Impact. Inclusion. Infinite Experiences. Do your best work ever.<br>About IBM<br>IBM’s greatest invention is the IBMer. We believe that progress is made through progressive thinking, progressive leadership, progressive policy and progressive action. IBMers believe that the application of intelligence, reason and science can improve business, society and the human condition. Restlessly reinventing since 1911, we are the largest technology and consulting employer in the world, with more than 380,000 IBMers serving clients in 170 countries.<br>Location Statement<br>For additional information about location requirements, please discuss with the recruiter following submission of your application.<br>Being You @ IBM<br>IBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.<br>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637202&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Application Developer: Microsoft .NET","companyName":"IBM","time":"a day ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":""},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637195&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Package Consultant: Sterling","companyName":"IBM","time":"a day ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"<br>Job Description :<br>Introduction<br>As a Package Consultant at IBM, get ready to tackle numerous mission-critical company directives. Our team takes on the challenge of designing, developing and re-engineering highly complex application components and integrating software packages using various tools. You will use a mix of consultative skills, business knowledge, and technical expertise to effectively integrate packaged technology into our clients business environment and achieve business results.<br>Your Role and Responsibilities<br>As a Package Consultant at IBM, get ready to tackle numerous mission-critical company directives. Our team takes on the challenge of designing, developing and re-engineering highly complex application components and integrating software packages using various tools. You will use a mix of consultative skills, business knowledge, and technical expertise to effectively integrate packaged technology into our clients business environment and achieve business results.<br><strong><br>Responsibilities:</strong><li><br>Participate in the software development, and package implementation using industry standard platforms Sterling</li><li><br>Ensure software developed is held to high quality standards through code and design reviews.</li><li><br>Interface with system integrators and IT engineers on projects to ensure proper adherence to SDLC and platform integrity.</li><br>Required Technical and Professional Expertise<br><li><br>Minimum 4-8 years of experience in IT Industry</li><li><br>Validated knowledge of the various modules in IBM Sterling OMS</li><li><br>Hands-on configuration and development experience using OOTB Sterling APIs in a minimum of one Sterling OMS implementation</li><li><br>Proficient in development of wrapper using Sterling OOTB APIs and configuring them as Sterling services (SDF)</li><li><br>Working knowledge of Sterling Store Web and Sterling Call Center</li><li><br>Customization knowledge of Sterling Store / Call Center web UI will be a huge plus</li><li><br>Ability to create Sterling OMS detailed technical design for business requirements</li><li><br>In-depth experience working with Sterling OMS interfaces with external systems using MQ, JMS</li><li><br>Ability to independently setup a local instance of Sterling OMS for development purpose</li><li><br>Solid understanding of core Java, servlets and web services (ReST &amp; SOAP)</li><li><br>Experience working with XMLs, XSLs and JSON</li><li><br>Working and configuration of any one application server; WAS, Weblogic, JBoss, etc</li><br>Preferred Technical and Professional Expertise<br><li><br>Experience working with Sterling Order Management on Cloud (OM SaaS)</li><li><br>Hands-on knowledge of microservices (Spring, Springboot)</li><li><br>Hands-on experience with UI technologies; Angular JS, React JS, GraphQL</li><li><br>You love collaborative environments that use agile methodologies to encourage creative design thinking and find innovative ways to develop with cutting edge technologies</li><li><br>Ambitious individual who can work under their own direction towards agreed targets/goals and with creative approach to work</li><li><br>Intuitive individual with an ability to manage change and proven time management</li><li><br>Proven interpersonal skills while contributing to team effort by accomplishing related results as needed</li><li><br>Up-to-date technical knowledge by attending educational workshops, reviewing publications</li><li><br>Exposure to one SQL database; DB2, Oracle, MySQL, etc</li><li><br>Basic knowledge of navigating through any one operating system; Linux or Windows</li><li><br>Knowledge of any popular IDE (Eclipse), code repository (SVN, CVS, GitHub)</li><br>About Business Unit<br>IBM Services is a team of business, strategy and technology consultants that design, build, and run foundational systems and services that is the backbone of the world's economy. IBM Services partners with the world's leading companies in over 170 countries to build smarter business by reimagining and reinventing through technology, with its outcome-focused methodologies, industry-leading portfolio and world class research and operations expertise leading to results-driven innovation and enduring excellence.<br>Your Life @ IBM<br>What matters to you when you’re looking for your next career challenge?<br>Maybe you want to get involved in work that really changes the world? What about somewhere with incredible and diverse career and development opportunities – where you can truly discover your passion? Are you looking for a culture of openness, collaboration and trust – where everyone has a voice? What about all of these? If so, then IBM could be your next career challenge. Join us, not to do something better, but to attempt things you never thought possible.<br>Impact. Inclusion. Infinite Experiences. Do your best work ever.<br>About IBM<br>IBM’s greatest invention is the IBMer. We believe that progress is made through progressive thinking, progressive leadership, progressive policy and progressive action. IBMers believe that the application of intelligence, reason and science can improve business, society and the human condition. Restlessly reinventing since 1911, we are the largest technology and consulting employer in the world, with more than 380,000 IBMers serving clients in 170 countries.<br>Location Statement<br>For additional information about location requirements, please discuss with the recruiter following submission of your application.<br>Being You @ IBM<br>IBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.<br>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637192&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Application Developer: Java Full Stack","companyName":"IBM","time":"a day ago","location":"Pune","area":null,"country":"India"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637188&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Application Developer: Experience Front End","companyName":"IBM","time":"a day ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"<br>Job Description :<br>Introduction<br>As an Application Developer, you will lead IBM into the future by translating system requirements into the design and development of customized systems in an agile environment. The success of IBM is in your hands as you transform vital business needs into code and drive innovation. Your work will power IBM and its clients globally, collaborating and integrating code into enterprise systems. You will have access to the latest education, tools and technology, and a limitless career path with the world’s technology leader. Come to IBM and make a global impact!<br>Your Role and Responsibilities<br>As UI Developer you will be responsible for developing and upgrading applications is Experience Front End<br><strong>Responsibilities:</strong><li><br>Develop prototypes and performs hands-on coding to develop and integrate the application user interface.</li><li><br>Translate graphic visual and interactive designs into the presentation layer for highly interactive web and mobile applications using responsive design and development techniques.</li><li><br>Independently plans installs, integrates and validates systems software and hardware solutions.</li><li><br>Leads technical change implementation across environments. Acquires and applies broad knowledge of the business, its products, and processes.</li><li><br>Resolves issues and navigates obstacles to deliver work product</li><li><br>Work under minimal supervision in layouts, product support, devices, methods or procedures</li><br>Required Technical and Professional Expertise<br><li><br>Minimum 3+ years of experience in development using Angular JS 2.0.</li><li><br>Experience in Hypertext Markup Language Revision 5 (HTML5), Cascading Style Sheets (CSS) and ReactJS (javascript)</li><li><br>Working knowledge of installing, upgrading and configuring Oracle tools across multiple platforms</li><li><br>Proficiency in working on UI Web portal</li><br>Preferred Technical and Professional Expertise<br><li><br>Working knowledge in ES6, React, Redux, React Router, Udesign, art, typography and photography is highly desired</li><li><br>Ambitious individual who can work under their own direction towards agreed targets/goals.</li><li><br>Ability to manage change and be open to it good time management and an ability to work under stress</li><li><br>Proven interpersonal skills while contributing to team effort by accomplishing related results as needed</li><li><br>Maintain technical knowledge by attending educational workshops, reviewing publications</li><br>About Business Unit<br>IBM Services is a team of business, strategy and technology consultants that design, build, and run foundational systems and services that is the backbone of the world's economy. IBM Services partners with the world's leading companies in over 170 countries to build smarter business by reimagining and reinventing through technology, with its outcome-focused methodologies, industry-leading portfolio and world class research and operations expertise leading to results-driven innovation and enduring excellence.<br>Your Life @ IBM<br>What matters to you when you’re looking for your next career challenge?<br>Maybe you want to get involved in work that really changes the world. What about somewhere with incredible and diverse career and development opportunities – where you can truly discover your passion? Are you looking for a culture of openness, collaboration and trust – where everyone has a voice? What about all of these? If so, then IBM could be your next career challenge. Join us, not to do something better, but to attempt things you never thought possible.<br>Impact. Inclusion. Infinite Experiences. Do your best work ever.<br>About IBM<br>IBM’s greatest invention is the IBMer. We believe that progress is made through progressive thinking, progressive leadership, progressive policy and progressive action. IBMers believe that the application of intelligence, reason and science can improve business, society and the human condition. Restlessly reinventing since 1911, we are the largest technology and consulting employer in the world, with more than 380,000 IBMers serving clients in 170 countries.<br>Location Statement<br>For additional information about location requirements, please discuss with the recruiter following submission of your application.<br>Being You @ IBM<br>IBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.<br>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637184&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Application Developer: Experience Front End","companyName":"IBM","time":"a day ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"<br>Job Description :<br>Introduction<br>As an Application Developer, you will lead IBM into the future by translating system requirements into the design and development of customized systems in an agile environment. The success of IBM is in your hands as you transform vital business needs into code and drive innovation. Your work will power IBM and its clients globally, collaborating and integrating code into enterprise systems. You will have access to the latest education, tools and technology, and a limitless career path with the world’s technology leader. Come to IBM and make a global impact!<br>Your Role and Responsibilities<br>As UI Developer you will be responsible for developing and upgrading applications is Experience Front End<br><strong>Responsibilities:</strong><li><br>Develop prototypes and performs hands-on coding to develop and integrate the application user interface.</li><li><br>Translate graphic visual and interactive designs into the presentation layer for highly interactive web and mobile applications using responsive design and development techniques.</li><li><br>Independently plans installs, integrates and validates systems software and hardware solutions.</li><li><br>Leads technical change implementation across environments. Acquires and applies broad knowledge of the business, its products, and processes.</li><li><br>Resolves issues and navigates obstacles to deliver work product</li><li><br>Work under minimal supervision in layouts, product support, devices, methods or procedures</li><br>Required Technical and Professional Expertise<br><li><br>Minimum 5+ years of experience in development using Angular JS 2.0.</li><li><br>Experience in Hypertext Markup Language Revision 5 (HTML5), Cascading Style Sheets (CSS) and ReactJS (javascript)</li><li><br>Working knowledge of installing, upgrading and configuring Oracle tools across multiple platforms</li><li><br>Proficiency in working on UI Web portal</li><br>Preferred Technical and Professional Expertise<br><li><br>Working knowledge in ES6, React, Redux, React Router, Udesign, art, typography and photography is highly desired</li><li><br>Ambitious individual who can work under their own direction towards agreed targets/goals.</li><li><br>Ability to manage change and be open to it good time management and an ability to work under stress</li><li><br>Proven interpersonal skills while contributing to team effort by accomplishing related results as needed</li><li><br>Maintain technical knowledge by attending educational workshops, reviewing publications</li><br>About Business Unit<br>IBM Services is a team of business, strategy and technology consultants that design, build, and run foundational systems and services that is the backbone of the world's economy. IBM Services partners with the world's leading companies in over 170 countries to build smarter business by reimagining and reinventing through technology, with its outcome-focused methodologies, industry-leading portfolio and world class research and operations expertise leading to results-driven innovation and enduring excellence.<br>Your Life @ IBM<br>What matters to you when you’re looking for your next career challenge?<br>Maybe you want to get involved in work that really changes the world. What about somewhere with incredible and diverse career and development opportunities – where you can truly discover your passion? Are you looking for a culture of openness, collaboration and trust – where everyone has a voice? What about all of these? If so, then IBM could be your next career challenge. Join us, not to do something better, but to attempt things you never thought possible.<br>Impact. Inclusion. Infinite Experiences. Do your best work ever.<br>About IBM<br>IBM’s greatest invention is the IBMer. We believe that progress is made through progressive thinking, progressive leadership, progressive policy and progressive action. IBMers believe that the application of intelligence, reason and science can improve business, society and the human condition. Restlessly reinventing since 1911, we are the largest technology and consulting employer in the world, with more than 380,000 IBMers serving clients in 170 countries.<br>Location Statement<br>For additional information about location requirements, please discuss with the recruiter following submission of your application.<br>Being You @ IBM<br>IBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.<br>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637136&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Mernstack","companyName":"Larsen &amp; Toubro Infotech Limited","time":"a day ago","location":"India","area":null,"country":"India","description":"<br><ul><li> Full Stack experience in ReactJS version 16.0 and NodeJS version 8.0. </li><li> Hands on experience in creating on Rest APIs using NodeJS. Perform 3rd party API integration with NodeJS. </li><li> Hands on experience in writing queries and optimizing them for large data sets in MongoDB/ SQL. </li><li> Experienced in working with Redux architecture using complex Object-Oriented concepts. </li><li> Experience in React hook implementation and Card component. </li><li> Good experience in Javascript, GraphQL and Python Familiar with creating Custom Reusable React Components Library. </li><li> Experience in using ReactJS components, Forms, Events, Keys, Router. </li><li> Experience in using Semantic UI framework. </li><li> Good experience of developing and debugging in JavaScript, CSS3 and HTML5, Jquery. </li><li> Good in implementing Pagination and Data grid for large of Data. </li></ul>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1632322&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Systems Analyst","companyName":"UST Global Singapore Pte Limited","time":"a day ago","location":"Thiruvananthapuram / Trivandrum","area":null,"country":"India"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1608534&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Sr. Systems Analyst","companyName":"UST Global Singapore Pte Limited","time":"a day ago","location":"Thiruvananthapuram / Trivandrum","area":null,"country":"India","description":"<br>Job Description :<br>• 7+ years of experience in IT with 2+ years in React Native Android/IOS development experience<br>• Must have exposure to Javascript&gt;React Native&gt;Camera library: Ecmascript 6 and 7 best practices; arrow functions; aribnb best practices for JavaScript development<br>• Must have Strong knowledge in Kotlin and should have worked hands-on in Kotlin at least in one project<br>• Must be able to show strong Android development knowledge with kotlin<br>• Should have worked in customer project doing mobile development from offshore collaborating with onsite<br>• Good communication skills"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1632324&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Sr. Software Developer","companyName":"UST Global Singapore Pte Limited","time":"a day ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":""},{"link":"https://www.monsterindia.com/seeker/job-details?id=1603477&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Software Developer","companyName":"UST Global Singapore Pte Limited","time":"a day ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"<br>Job Description :<br>Job Description<br>- Build powerful, stand out visualizations of process and business operations data<br>- Grasp users needs and translate them into business and technology solutions<br>- Consult on and help with the making of creative data visualization to give users the best experience possible<br>- Prototype and build new ideas and take part in all stages of the product lifecycle from research to release<br>- Help migrate users inhouse developed data visualization applications to enterprise standard<br>- Interact and iterate with business users to define, co create and validate compelling Analytics applications or dashboards that drive value add<br>Needed Skills<br>- Minimum of a bachelor s degree or equivalent 4 years minimum of hands on data visualization experience<br>- Minimum 2 years of full life cycle Development. Agile and waterfall delivery experience<br>- Minimum 2 years of design or development experience with Qlik Sense and Qlik NPrinting, and one or more of the following data visualization tools Tableau, Spotfire, PowerBI, ThoughtSpot, Business Objects and SAP Analytics Cloud<br>- Data Model Design for visualization and specialized data stores.<br>- Minimum of 1 year of data technology experience to include ETL tools BODS, Informatica, Talend, Alteryx, Ab Initio, DataStage or Data Modeling Oracle, SQL Server, Teradata, SAP, Netezza or other reporting tools such as Cognos, MicroStrategy, Business Objects<br>Additional skills Nice to have<br>- Certified in one or many of the technologies mentioned above<br>- Custom data visualization experience using Javascript, R, CSS, HTML5 and or d3.js<br>- Scripting skills in Python, SAS and or R or have integrated this type of statistical analysis tool with data visualization tools.<br>- Full life cycle Development. Agile and waterfall delivery experience<br>- Industry experience financial services, resources, healthcare, government, products, communications, high tech<br>- Previous consulting and Technical team lead experience<br>Professional Skills<br>- Proven ability to work creatively and analytically in a problem solving environment<br>- Desire to work in an information systems environment<br>- Excellent communication written and oral and interpersonal skills<br>- Self starter ad ability to learn quickly"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1622091&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Software Developer","companyName":"UST Global Singapore Pte Limited","time":"a day ago","location":"Thiruvananthapuram / Trivandrum","area":null,"country":"India","description":""},{"link":"https://www.monsterindia.com/seeker/job-details?id=1608464&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Sr. Technical Lead","companyName":"UST Global Singapore Pte Limited","time":"a day ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"<br>Job Description :<br>- 8 years experience in Java based Web development with significant experience in Microservices development and expertise on Kubernetes<br>Mandatory<br>- Expertise in the following technologies<br>o Java<br>o Microservices<br>o RESTful service<br>o Spring<br>o Kubernetes<br>o Docker<br>o Hands on experience with deployments on Cloud.<br>Desirable<br>- UI technologies HTML,CSS, Bootstrap, JQuery, Angular JS, ReactJS<br>- Experience with Cloud deployments AWS, Azure etc "},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637093&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"CTE_Full Stack Engineer","companyName":"Ernst &amp; Young","time":"a day ago","location":"Thiruvananthapuram / Trivandrum, India","area":null,"country":"India","description":"<br>Job Description :<br>These are exciting times, and in our relentless focus to build a better working world, we are embracing the world of products, cloud and scale to help us serve our clients more effectively and efficiently. We have refocused our Technology teams to work exclusively on client technologies while embarking on the journey of multi-tenant, frictionless, global, cloud-based &amp; scalable products. If you take great professional pride in inventing and presenting products that delight an ever evolving and very discerning user base, love to solve problems with technology, design &amp; code while coaching &amp; mentoring super smart engineers then you should seriously consider applying<br><b>Essential Functions of the Job</b><br>As a Technologist at EY Client Technology, you will be in the thick of things! You will work on the most difficult &amp; fun phases of engineering, including:<li>Ability quickly turn PoC in to industry grade products/solutions. Should be able work across varied technologies.</li><li>Design and review the architecture of enterprise applications leveraging industry best practices and design patterns to meet functional and non-functional requirements.</li><li>Work with product owners, architects and business analysts to translate requirements to technical solutions.</li><li>Evangelize re-use through implementation of shared assets across multiple organizations.</li><li>Define and enforce adherence to architectural standards/principles, global product-specific guidelines and usability design standards.</li><li>Proactively provide guidance on engineering methodologies, standards and leading practices</li><li>Guidance of engineering staff and reviews of as-built configurations during construction phase</li><li>Collaborate with stakeholders to estimate, prioritize, and plan work items to be handled during sprints and iterations.</li><li>Collaborate with development and QA throughout the design and deployment processes while establishing and maintaining standards to improve quality and delivery time.</li><li>Lead, mentor, and coach junior team members.</li><li>Collaborating with technology teams across EY Service Lines helping them implement a productized strategy, consuming existing components while also greatly enhancing velocity of products through reuse!</li><br>You will also have a lot of fun innovating on Products &amp; Technology, including:<li>Secure and automate solutions through collaboration with InfoSec and Engineering resources</li><li>Ensure quality through use of manual and automated controls</li><li>Identify, communicate and mitigate Risks, Assumptions, Issues and Decisions throughout full lifecycle</li><li>Using strategic thinking, consider the art of the possible, compare various options based on feasibility and impact, propose actionable plans and roadmaps that balance tactical and strategic needs</li><br>A great candidate will have experience is most of the following:<br><li>Excellent technical architecture skills, enabling the creation of future-proof, complex global solutions</li><li>Excellent interpersonal communication and organizational skills that are required to operate as a leading member of global, distributed teams that deliver quality services and solutions.</li><li>Ability to rapidly gain knowledge of the organizational structure of the firm to facilitate work with groups outside of the immediate technical team.</li><li>Demonstrated experience in Agile (Scrum) development, application design, software development, and testing</li><li>Deep understanding of performance testing, improvement techniques, caching solutions, multi-tenant application development and architectures.</li><li>Strong understanding of integration theories, principles, techniques, and practices including experience with various integration patterns and products</li><li>Experience on Azure Enterprise Integration Services</li><li>Must be able to communicate fluently in English, both written and verbal</li><li>Excellent interpersonal communication and organizational skills to contribute as a leading member of global, distributed teams focused on delivering quality products</li><li>Demonstrate excellent technical &amp; architecture skills in the context of cloud based global platform/product design, service management and product lifecycle management</li><li>Demonstrate ability to rapidly learn new and emerging technologies and developing a vision of their suitability and role as a new product within a platform &amp; product landscape</li><li>Operational abilities including early life support and driving root cause analysis and remediation</li><br><b>Analytical/Decision Making Responsibilities</b><li>Be very strong in architecting and building apps</li><li>Be very strong in algorithms, data structures, problem solving, building to scale by leveraging cloud computing, data, and artificial intelligence</li><li>Handle ambiguity and able to move forward with imperfect information and get things done in a rapidly changing environment</li><li>Must be comfortable working in an environment where ideas are challenged;</li><li>Should possess good product instinct and excellent project management skills to push projects over the finish line with sound planning and persistent execution</li><li>Astute in aligning effort &amp; resources to achieve desired result</li><br><b>Required Experience</b><br><b><li>Bachelor’s Degree or equivalency (CS, CE, CIS, IS, MIS, or engineering discipline)</li><li>15+ years in software development in varied technologies (with digital skills). Proven track record in building enterprise level apps for transformation programs</li><li>Development using .NET or Java web application using standard design patterns and frameworks</li><li>Experience in building robust web services</li><li>Experience in HTML/CSS, Javascript and AngularJS or React</li><li>Experience in Microservices and Cloud development</li><li>Experience with Node.js back or front end.</li><li>Experience with multi-tier system and service design and development for large enterprises</li><li>Experience with multiple databases such as RDBMS, NoSQL document and KV stores, NoSql wide-column.</li><li>Experience with multi-tier system and service design and development for large enterprises</li><li>Proven track record in working through Dev Ops and Agile practices</li><li>Experience with any claims-based authentication (SAML/OAuth/OIDC), MFA, RBAC, or ABAC</li><li>Knowledge of cloud security controls including tenant isolation, encryption at rest, encryption in transit, key management, vulnerability assessments, application firewalls, SIEM, etc.</li><li>Experience with resilient and highly available mission critical technology components</li><li>Experience with multi-geo, multi-tier service design and operations</li><br><b>Desired Experience</b><br><b><li>Experience in building application using container-orchestration systems like Kubernetes, and container engines like Docker</li><li>Experience in building real-time data pipelines and streaming apps using Kafka,and RabbitMQ message broker</li><li>Functional knowledge of programming scripting such as JavaScript, PowerShell, Python, Bash, SQL, .NET, Java, PHP, Ruby, PERL, C++, R, etc.</li><li>CI/CD delivery using code management, configuration management and automation tools such as GitHub, VSTS, Ansible, DSC, Puppet, Ambari, Chef, Salt, Jenkins, Maven, etc.</li><li>Delivery using modern methodologies especially SAFe Agile, Iterative, Waterfall, etc.</li><br><b>Desired Certifications</b><ul><li>Microsoft, Redhat, TOGAF, Zachman, ITIL, Cisco, (ISC)2, CEH, SAFe, PMI, etc.</li></ul><br></b></b>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1621381&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Web Development - FrontEnd Developer","companyName":"Verzeo Edutech Private Limited","time":"a day ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"Selected intern's day-to-day responsibilities include:<br>1. Develop user interface using React.js<br>2. Develop reusable components and front-end libraries<br>3. Develop designs and wireframes into User Interface<br>4. Optimize components for maximum performance across a vast array of web-capable devices and browsers<br>Skills:<br>1. Proficiency in JavaScript along with DOM knowledge and logical ability to code in JavaScript<br>2. Thorough understanding of React.js along with core principles<br>3. Experience with Redux Library is advantageous<br>4. Familiarity with new specifications of ES 6<br>5. Experience with data structure libraries (e.g., Immutable.js)<br>6. Knowledge of Isomorphic JavaScript is a plus<br>7. Familiarity with RESTful APIs<br>8. Knowledge of modern authorization mechanisms, such as JSON Web Token (JWT)<br>9. Experience with common front-end development tools such as Babel, Webpack, NPM, etc<div><br></div><div>Note:Only those who are interested to join at office can apply.</div><div>*Stipend can be negotiable.</div>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1621530&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Web Development - Backend Developer Internship","companyName":"Verzeo Edutech Private Limited","time":"a day ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"We are looking for a Node.js Developer to join our fun, energetic team who are running at full speed to ignite a digital disruption in Social Networking and discovery.<br>Node.js Developer duties and responsibilities :<br>- Work as part of a team developing applications and services using Agile development methods<br>- Contribute to team and organizational improvements in process and infrastructure<br>- Build customer-facing UI and back-end services for payment processing administration and management<br>- Code, teste and operate node.js based services<br>- Effectively use tools and ingenuity to identify and fix defects before they become a problem<br>- Node.js Developer requirements and qualifications<br>- In-depth knowledge of Node.js<br>- Hands-on experience with HTML, CSS, and AJAX, Axios<br>- Development experience designing object-oriented JavaScript and SVG<br>- Applicable knowledge of web libraries and frameworks such as AngularJS, Polymer, and Closure<br>- Familiarity with the whole web stack, including protocols and web server optimization techniques<br>- Strong analytical skills and problem solving aptitude<div><br></div><div>Note:Only those who are willing to join office can apply.</div><div>*Stipend is negotiable.</div>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637024&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Lead .Net Azure Developer","companyName":"NEJIPR Global Services","time":"a day ago","location":"Chennai, Hyderabad / Secunderabad","area":null,"country":"India","description":"Passionate coder with at least 8+ years of development experience on the Microsoft ASP.NET stack<br>Expert-level knowledge of modern technologies and software development practices and patterns<br>Excellent oral and written communication skills<br>Strong interpersonal and teamwork skills<br>Must be flexible to new situations and challenges<br>Significant, demonstrated experience and expertise in the following technologies:<br>ASP.NET MVC/Web API, Entity Framework, SQL Server<br>Modern JavaScript frameworks such as React, Angular,<br>Object-oriented programming and design patterns<br>Infrastructure design and DevOps<br>Git and Gitflow<br>Strong consulting and communication skills. Ability to work effectively with various organizations in pursuit of problem solutions.<br>Proficient in authoring, editing and presenting technical documents.<br>Bachelor’s degree in Computer Science or related field.<br>Note: Angular/React or Azure is must.<br>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1587141&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Assistant Manager - SharePoint","companyName":"Genpact","time":"a day ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"<br>Job Description :<br>With a startup spirit and 90,000+ curious and courageous minds, we have the expertise to go deep with the world\\u2019s biggest brands\\u2014and we have fun doing it. Now, we\\u2019re calling all you rule-breakers and risk-takers who see the world differently, and are bold enough to reinvent it. Come, transform with us. Transformation happens here. Come, be a part of our exciting journey!<br><b> Inviting applications for the role of Assistant Manager, SharePoint </b><br>We are looking for a team lead/manager who would be responsible for the delivery of SharePoint projects for customers and support the team in completing the overall project goal. Are you the one we are looking for?<br>Responsibilities<br><ul><li> software development experience. </li><li> experience in defining and deploying solutions in Microsoft SharePoint </li><li> years of leading a SharePoint team and delivering projects from scratch </li><li> Should have led client discussions for requirements </li><li> Should be able to prioritize multiple project execution </li><li> Experience in designing and deploying solutions in Microsoft SharePoint Modern Framework using SPFx and Office Fabric UI </li><li> Experience in crafting business process application using Power Platform (Microsoft Flow, Power Apps, and Power BI) </li><li> Experience on Office 365 Tenant Admin activities </li><li> Demonstrate an understanding of SharePoint API's and architecture. </li><li> Ability to communicate effectively with end-users and translate business language into technical requirements. </li><li> Prior experience in a federal agency environment is highly desirable. </li><li> Excellent written and oral communication skills and ability to express complex technical concepts effectively, both verbally and in writing. </li><li> Excellent customer service skills. </li><li> Ability to work in a team-based environment, as well as, the ability to work independently. </li><li> Ability to work effectively with people of many different disciplines with varying degrees of technical experience </li></ul><b> Required Technology Skillset: </b><br><ul><li> Collaboration: SharePoint Portal Server / Windows SharePoint Services, Content Management Server </li><li> Databases: SQL Server 2005, 2008, 2010 </li><li> Frameworks: Framework 3.0,3.5 , SharePoint Modern Framework SPFx </li><li> IDE: Visual Studio 2005, 2008, SharePoint Designer </li><li> Languages: C#,VB.Net, WPF,WCF </li><li> Web Server-side: ASP.Net, IIS, Web Services </li><li> Power Platform : Power Apps, Microsoft Flow </li><li> Web Client-side: HTML, XHTML, CSS, JavaScript, JQuery, Ajax, React JS, TypeScript </li></ul><b> Minimum qualifications </b><br><ul><li> BE/B- Tech, BCA, MCA, BSc/MSc, MBA </li></ul><b> Preferred qualifications </b><br><ul><li> Personal drive and positive work ethic to deliver results within tight deadlines and in demanding situations </li><li> Flexibility to adapt to a variety of engagement types, working hours and work environments and locations </li><li> Superb communication and negotiation skills </li></ul><br><b> Genpact is an Equal Opportunity Employer and considers applicants for all positions without regard to race, color, religion or belief, sex, age, national origin, citizenship status, marital status, military/veteran status, genetic information, sexual orientation, gender identity, physical or mental disability or any other characteristic protected by applicable laws. </b> Genpact is committed to creating a dynamic work environment that values diversity and inclusion, respect and integrity, customer focus, and innovation. For more information, visit www.genpact.com. Follow us on Twitter, Facebook, LinkedIn, and YouTube.<br>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1636906&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Java Full Stack Development Application Lead","companyName":"Accenture","time":"a day ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"<br>Job Description<br><strong>About Accenture: </strong>Accenture is a leading global professional services company, providing a broad range of services in strategy and consulting, interactive, technology and operations, with digital capabilities across all of these services. We combine unmatched experience and specialized capabilities across more than 40 industries — powered by the world’s largest network of Advanced Technology and Intelligent Operations centers. With 513,000 people serving clients in more than 120 countries, Accenture brings continuous innovation to help clients improve their performance and create lasting value across their enterprises. Visit us at <ul><br><li><strong>Project Role :</strong>Application Lead</li><li><strong>Project Role Description :</strong>Lead the effort to design, build and configure applications, acting as the primary point of contact.</li><li><strong>Management Level :</strong>10</li><li><strong>Work Experience :</strong>4-6 years</li><li><strong>Work location :</strong>Bengaluru</li><li><strong>Must Have Skills :</strong>Java Full Stack Development</li><li><strong>Good To Have Skills :</strong>Spring Boot</li><li><strong>Job Requirements : </strong><ul><br><li><strong>Key Responsibilities : </strong>a: Design Develop and configure software systems to meet the client requirements b: Perform Unit Testing and required QA process to test the software component c: Should work on application development projects and have waterfall and agile sdlc development experience d: Apply knowledge of technology, application, methodologies, process and tools to support client requirements e: Should help client in value added activities by introducing automations as needed and deliver the same</li><br><li><strong>Technical Experience : </strong>Must to Have Skills: Java Full Stack Development a: Resource should have minimum 4 yrs of hands-on experience in Front End technologies HTML5, CSS3, JS, JQuery, JSON, Ajax, Angularjs, React, Nodejs and similar, AWS hands-on b: Resource should have hands on in Java/J2EE Object Oriented design and development skills Core Java, Spring Web Services SOAP, REST</li><br><li><strong>Professional Attributes : </strong>a: Very strong communication skills both oral and written b: Very strong analytical skills c: Very strong presentation skills ability to work under pressure</li></ul></li></ul><br>Qualifications<br>15 years of full time education "},{"link":"https://www.monsterindia.com/seeker/job-details?id=1636892&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"User Interface Development Solutions Application Developer","companyName":"Accenture","time":"a day ago","location":"Gurgaon / Gurugram","area":null,"country":"India","description":"<br>Job Description<br><strong>About Accenture: </strong>Accenture is a leading global professional services company, providing a broad range of services in strategy and consulting, interactive, technology and operations, with digital capabilities across all of these services. We combine unmatched experience and specialized capabilities across more than 40 industries — powered by the world’s largest network of Advanced Technology and Intelligent Operations centers. With 513,000 people serving clients in more than 120 countries, Accenture brings continuous innovation to help clients improve their performance and create lasting value across their enterprises. Visit us at <ul><br><li><strong>Project Role :</strong>Application Developer</li><li><strong>Project Role Description :</strong>Design, build and configure applications to meet business process and application requirements.</li><li><strong>Management Level :</strong>10</li><li><strong>Work Experience :</strong>4-6 years</li><li><strong>Work location :</strong>Gurugram</li><li><strong>Must Have Skills :</strong>User Interface Development Solutions</li><li><strong>Good To Have Skills :</strong>Java Enterprise Edition</li><li><strong>Job Requirements : </strong><ul><br><li><strong>Key Responsibilities : </strong>Must have hands on Experience in front End MVC architecture development Single Page Application SPA Development using one of JS MVC framework like - Angular, Angular 20, Backbone, React etc Experience in DevOps tools like Yeoman, NPM, Grunt, Gulp, Webpack, etc Experience in Testing Framework Jasmin, Protractor, Karma, Mocha, Chai, Continuous Integration tool - Jenkins</li><br><li><strong>Technical Experience : </strong>Development Experience in OOPS server side language - Java/J2EE, NET Server side Scripting - Nodejs, Expressjs Understand Componentized Development in Front End</li><br><li><strong>Professional Attributes : </strong>-Good Communication skill -Good team building skill -Should have good analytical skill</li><br><li><strong>Educational Qualification : </strong>B Tech/BE</li></ul></li></ul><br>Qualifications<br>15 years of full time education "},{"link":"https://www.monsterindia.com/seeker/job-details?id=1636883&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Microsoft Front End Development Application Developer","companyName":"Accenture","time":"a day ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":""},{"link":"https://www.monsterindia.com/seeker/job-details?id=1636881&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Microsoft Teams Development Application Developer","companyName":"Accenture","time":"a day ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"<br>Job Description<br><strong>About Accenture: </strong>Accenture is a leading global professional services company, providing a broad range of services in strategy and consulting, interactive, technology and operations, with digital capabilities across all of these services. We combine unmatched experience and specialized capabilities across more than 40 industries — powered by the world’s largest network of Advanced Technology and Intelligent Operations centers. With 513,000 people serving clients in more than 120 countries, Accenture brings continuous innovation to help clients improve their performance and create lasting value across their enterprises. Visit us at <ul><br><li><strong>Project Role :</strong>Application Developer</li><li><strong>Project Role Description :</strong>Design, build and configure applications to meet business process and application requirements.</li><li><strong>Management Level :</strong>9</li><li><strong>Work Experience :</strong>6-8 years</li><li><strong>Work location :</strong>Bengaluru</li><li><strong>Must Have Skills :</strong>Microsoft Teams Development</li><li><strong>Good To Have Skills :</strong>Node.js</li><li><strong>Job Requirements : </strong><ul><br><li><strong>Key Responsibilities : </strong>1 Ability of designing, developing and deploying complex Teams App for small, medium and large enterprise 2 Designing and Coding of Complex custom Microsoft Team Apps 3 Understanding of Microsoft Teams Platform and advise when and how new MS Teams components should be leveraged to address business requirements 4 Identify, understand, define and evangelize best practices in technology 5 Define needed governance standards, principles, and guard rails to meet development best practices, data govern</li><br><li><strong>Technical Experience : </strong>1 Experience on Microsoft Teams and SharePoint online 2 Experience on Microsoft Power automate Office 365 is an added advantage 3 Ability of designing, developing and deploying complex Teams App for small, medium and large enterprise 4 Designing and Coding of Complex and Very Complex custom Microsoft Team Apps 5 Coding of custom Microsoft Teams App using C or Node JS 6 Experience of Java frameworks like AngularJS, React JS Knockout JS 7 Experience of ASPNET 35 and above, Microsoft Graph API,</li><br><li><strong>Professional Attributes : </strong>1 Should have good team lead capabilities to efficiently collaborate with stakeholders 2 Have outstanding verbal communications skills 3 Have good client expectation management and presentation skills 4 Team Management and Stakeholder Management 5 Ability to build expertise of other people</li><br><li><strong>Educational Qualification : </strong>Full time 15 years of regular education</li><br><li><strong>Additional Information : </strong>Experience on Microsoft Power Apps Office 365 is an added advantage</li></ul></li></ul><br>Qualifications<br>15 years of full time education "},{"link":"https://www.monsterindia.com/seeker/job-details?id=1636876&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Java Enterprise Edition Application Developer","companyName":"Accenture","time":"a day ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"<br>Job Description<br><strong>About Accenture: </strong>Accenture is a leading global professional services company, providing a broad range of services in strategy and consulting, interactive, technology and operations, with digital capabilities across all of these services. We combine unmatched experience and specialized capabilities across more than 40 industries — powered by the world’s largest network of Advanced Technology and Intelligent Operations centers. With 513,000 people serving clients in more than 120 countries, Accenture brings continuous innovation to help clients improve their performance and create lasting value across their enterprises. Visit us at <ul><br><li><strong>Project Role :</strong>Application Developer</li><li><strong>Project Role Description :</strong>Design, build and configure applications to meet business process and application requirements.</li><li><strong>Management Level :</strong>10</li><li><strong>Work Experience :</strong>4-6 years</li><li><strong>Work location :</strong>Bengaluru</li><li><strong>Must Have Skills :</strong>Java Enterprise Edition</li><li><strong>Good To Have Skills :</strong>No Technology Specialization</li><li><strong>Job Requirements : </strong><ul><br><li><strong>Key Responsibilities : </strong>1 Design and implement Java based solutions with scalability, reliability, maintainability testability 2 Strong technical skills with technologies like Java/J2EE/ Hibernate,Spring, SAP HANA, UI Technologies and OData protocols to develop modem cutting edge software that performs and scales in cloud environment 3 Server oriented Knowledge in Java backend development tomcat, JEE, dependency injection 4 At least basic client side knowledge of Web technologies, JS, HTML, CSS</li><br><li><strong>Technical Experience : </strong>1 Sound knowledge in Object Oriented Programming Principles,Design Patterns and Software Architecture, especially in new age Cloud solutions 2 Design and implement across all layers of the software UI, Backend, Database 3Exposure to debugging ,troubleshooting and performance tuning for complex SQL queries 4 Capable of creating High level and low-level design document 5 Knowledge of lean development infrastructure process including Git,TeamCity,Jenkins ,exposure to CD practices</li><br><li><strong>Professional Attributes : </strong>1Outstanding written and verbal communication skills 2 Should have team handling skills 3 Must have analytical skills and presentation skills</li></ul></li></ul><br>Qualifications<br>15 years of full time education "},{"link":"https://www.monsterindia.com/seeker/job-details?id=1636872&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Java Full Stack Development Application Lead","companyName":"Accenture","time":"a day ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"<br>Job Description<br><strong>About Accenture: </strong>Accenture is a leading global professional services company, providing a broad range of services in strategy and consulting, interactive, technology and operations, with digital capabilities across all of these services. We combine unmatched experience and specialized capabilities across more than 40 industries — powered by the world’s largest network of Advanced Technology and Intelligent Operations centers. With 513,000 people serving clients in more than 120 countries, Accenture brings continuous innovation to help clients improve their performance and create lasting value across their enterprises. Visit us at <ul><br><li><strong>Project Role :</strong>Application Lead</li><li><strong>Project Role Description :</strong>Lead the effort to design, build and configure applications, acting as the primary point of contact.</li><li><strong>Management Level :</strong>9</li><li><strong>Work Experience :</strong>6-8 years</li><li><strong>Work location :</strong>Bengaluru</li><li><strong>Must Have Skills :</strong>Java Enterprise Edition,Java Full Stack Development</li><li><strong>Good To Have Skills :</strong></li><li><strong>Job Requirements : </strong><ul><br><li><strong>Key Responsibilities : </strong>a: The person will be responsible for end to end implementation ie gathering requirements, analyzing, designing, coding and deployment to Production b: The person will be in client facing role talking to client SME on regular basis to get requirements and clarifications c: The person will be responsible for reviewing and overseeing team-mates work d: The person should be able to work with different teams to coordinate on requirements and data requirements</li><br><li><strong>Technical Experience : </strong>a:Full Stack Developer b:Github, Hibernate, Java, JEE, mySQL , jUnit, REST, DB Schema design , API, SSL/HTTPs, React JS</li><br><li><strong>Professional Attributes : </strong>a: Resource should have good communication skills b: Resource should have good analytical skills and reasoning skills</li></ul></li></ul><br>Qualifications<br>15 years of full time education "},{"link":"https://www.monsterindia.com/seeker/job-details?id=1586991&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Magento Solutions Application Developer","companyName":"Accenture","time":"a day ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"<br>Job Description<br><strong>About Accenture: </strong>Accenture is a leading global professional services company, providing a broad range of services in strategy and consulting, interactive, technology and operations, with digital capabilities across all of these services. We combine unmatched experience and specialized capabilities across more than 40 industries — powered by the world’s largest network of Advanced Technology and Intelligent Operations centers. With 513,000 people serving clients in more than 120 countries, Accenture brings continuous innovation to help clients improve their performance and create lasting value across their enterprises. Visit us at <ul><br><li><strong>Project Role :</strong>Application Developer</li><li><strong>Project Role Description :</strong>Design, build and configure applications to meet business process and application requirements.</li><li><strong>Management Level :</strong>8</li><li><strong>Work Experience :</strong>8-10 years</li><li><strong>Work location :</strong>Bengaluru</li><li><strong>Must Have Skills :</strong>Magento Solutions</li><li><strong>Good To Have Skills :</strong>No Technology Specialization</li><li><strong>Job Requirements : </strong><ul><br><li><strong>Key Responsibilities : </strong>A Conceptualize, architect and design solutions for customers that meet customer business obj, cost, timeline, quality and MVP B Lead the delivery from tech perspective and delivery C Build Salesforce Commerce Cloud, SFCC, aka, Demandware D Define and setup tech standards for SFCC solutions, setup tools and systems required for excelling in SFCC E Define and refine ideas of accelerators that can provide competitive advantage to Accenture in sales process, build accelerators in MVP evolutions</li><br><li><strong>Technical Experience : </strong>A developing business solutions using Salesforce Commerce Cloud, Demandware B Demandware Script, XML, HTML5, CSS, AJAX, jQuery, JSON object definition, Java OOP, NodeJS C RESTful web services, client side applications AJAX Advanced JavaScript architectures D Strong background in W3C, Accessibility Guidelines, MVC, Agile development, and tools SFRA, Pipelines, JS Controllers, ISML Templ G integrating custom services into SFCC payment, tax, OMS integrations J UX Studio, Content Assets, Slots</li><br><li><strong>Professional Attributes : </strong>A Communication skills B Must have at least 3 years of experience in Leading a 8-10 team member team C Analytical skills D Presentation skills and ability to work under pressure</li><br><li><strong>Educational Qualification : </strong>Technical Graduate or PG</li></ul></li></ul><br>Qualifications<br>15 years of full time education "},{"link":"https://www.monsterindia.com/seeker/job-details?id=1636867&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Microsoft Teams Development Application Developer","companyName":"Accenture","time":"a day ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"<br>Job Description<br><strong>About Accenture: </strong>Accenture is a leading global professional services company, providing a broad range of services in strategy and consulting, interactive, technology and operations, with digital capabilities across all of these services. We combine unmatched experience and specialized capabilities across more than 40 industries — powered by the world’s largest network of Advanced Technology and Intelligent Operations centers. With 513,000 people serving clients in more than 120 countries, Accenture brings continuous innovation to help clients improve their performance and create lasting value across their enterprises. Visit us at <ul><br><li><strong>Project Role :</strong>Application Developer</li><li><strong>Project Role Description :</strong>Design, build and configure applications to meet business process and application requirements.</li><li><strong>Management Level :</strong>10</li><li><strong>Work Experience :</strong>4-6 years</li><li><strong>Work location :</strong>Bengaluru</li><li><strong>Must Have Skills :</strong>Microsoft Teams Development</li><li><strong>Good To Have Skills :</strong>Node.js</li><li><strong>Job Requirements : </strong><ul><br><li><strong>Key Responsibilities : </strong>1 Developing and deploying Teams App for small, medium and large enterprise 2 Designing and Coding of Complex custom Microsoft Team Apps 3 Understanding of Microsoft Teams Platform and advise when and how new MS Teams components should be leveraged to address business requirements</li><br><li><strong>Technical Experience : </strong>1 Experience on Microsoft Teams and SharePoint online 2 Experience on Microsoft Power automate Office 365 is an added advantage 3 Designing and Coding of custom Microsoft Team Apps 4 Coding of custom Microsoft Teams App using C or Node JS 5 Experience of Java frameworks like AngularJS, React JS Knockout JS 6 Experience of ASPNET 35 and above, Microsoft Graph API, HTML 5, CSS 7 Experience of Microsoft Graph API, HTML 5, CSS</li><br><li><strong>Professional Attributes : </strong>1 Have outstanding verbal communications skills 2 Have good client expectation management and presentation skills 3 Ability to build expertise of other people 4 Should have good problem solving and analytical skills</li><br><li><strong>Educational Qualification : </strong>Full time 15 years of regular education</li><br><li><strong>Additional Information : </strong>Experience on Microsoft Power Apps Office 365 is an added advantage</li></ul></li></ul><br>Qualifications<br>15 years of full time education "},{"link":"https://www.monsterindia.com/seeker/job-details?id=1636847&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Java Full Stack Development Application Developer","companyName":"Accenture","time":"a day ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"<br>Job Description<br><strong>About Accenture: </strong>Accenture is a leading global professional services company, providing a broad range of services in strategy and consulting, interactive, technology and operations, with digital capabilities across all of these services. We combine unmatched experience and specialized capabilities across more than 40 industries — powered by the world’s largest network of Advanced Technology and Intelligent Operations centers. With 513,000 people serving clients in more than 120 countries, Accenture brings continuous innovation to help clients improve their performance and create lasting value across their enterprises. Visit us at <ul><br><li><strong>Project Role :</strong>Application Developer</li><li><strong>Project Role Description :</strong>Design, build and configure applications to meet business process and application requirements.</li><li><strong>Management Level :</strong>10</li><li><strong>Work Experience :</strong>4-6 years</li><li><strong>Work location :</strong>Bengaluru</li><li><strong>Must Have Skills :</strong>Java Full Stack Development</li><li><strong>Good To Have Skills :</strong>No Technology Specialization</li><li><strong>Job Requirements : </strong><ul><br><li><strong>Key Responsibilities : </strong>1 Design and implement Java based solutions with scalability, reliability, maintainability testability 2 Strong technical skills with technologies like Java/J2EE/ Hibernate,Spring, SAP HANA, UI Technologies and OData protocols to develop modem cutting edge software that performs and scales in cloud environment 3 Server oriented Knowledge in Java backend development tomcat, JEE, dependency injection 4 At least basic client side knowledge of Web technologies, JS, HTML, CSS</li><br><li><strong>Technical Experience : </strong>1 Sound knowledge in Object Oriented Programming Principles,Design Patterns and Software Architecture, especially in new age Cloud solutions 2 Design and implement across all layers of the software UI, Backend, Database 3Exposure to debugging ,troubleshooting and performance tuning for complex SQL queries 4 Capable of creating High level and low-level design document 5 Knowledge of lean development infrastructure process including Git,TeamCity,Jenkins ,exposure to CD practices 6 4 years exp</li><br><li><strong>Professional Attributes : </strong>1Outstanding written and verbal communication skills 2 Should have team handling skills 3 Must have analytical skills and presentation skills</li><br><li><strong>Educational Qualification : </strong>Bachelors in Computer Science required, Master preferred</li><br><li><strong>Additional Information : </strong>knowledge of Scrum,TDD,passionate about unit test ,integrity ,stress ,perfor and automation testing</li></ul></li></ul><br>Qualifications<br>15 years of full time education "},{"link":"https://www.monsterindia.com/seeker/job-details?id=1636825&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Angular Application Developer","companyName":"Accenture","time":"a day ago","location":"Gurgaon / Gurugram","area":null,"country":"India","description":"<br>Job Description<br><strong>About Accenture: </strong>Accenture is a leading global professional services company, providing a broad range of services in strategy and consulting, interactive, technology and operations, with digital capabilities across all of these services. We combine unmatched experience and specialized capabilities across more than 40 industries — powered by the world’s largest network of Advanced Technology and Intelligent Operations centers. With 513,000 people serving clients in more than 120 countries, Accenture brings continuous innovation to help clients improve their performance and create lasting value across their enterprises. Visit us at <ul><br><li><strong>Project Role :</strong>Application Developer</li><li><strong>Project Role Description :</strong>Design, build and configure applications to meet business process and application requirements.</li><li><strong>Management Level :</strong>10</li><li><strong>Work Experience :</strong>4-6 years</li><li><strong>Work location :</strong>Gurugram</li><li><strong>Must Have Skills :</strong>Angular</li><li><strong>Good To Have Skills :</strong>HTML (Hypertext Markup Language),React.js</li><li><strong>Job Requirements : </strong><ul><br><li><strong>Key Responsibilities : </strong>A: Experience with at least one server side scripting language B: Experience with Jasmine, AMD, Bootstrap, SASS/LESS, and frontend workflow system like Redux/Flux C: Working knowledge of server side technologies and how they should integrate with the user interface D: Experience in working with a development team using either the Java or Microsoft technology stacks E: Has the ability to grasp complex problems and understand code that has been written by other developers</li><br><li><strong>Technical Experience : </strong>A:Expert knowledge of standards compliant HTML 5 APIs, CSS2/3 and OOJS B: Experience with Modular JS and JS Design Patterns C: Experience on Angular JS/React JS, D3 D: Deep understanding of both progressive enhancement and AJAX-based single page application build using MVVM and/or MVC based frameworks E: Experience with working with Restful or SOAP based web services, JSON/ XML etc F: Experience with common JavaScript libraries like D3, jQuery, underscore etc</li><br><li><strong>Professional Attributes : </strong>A: Should Have Good Communication and Analytical skills</li></ul></li></ul><br>Qualifications<br>15 years of full time education "},{"link":"https://www.monsterindia.com/seeker/job-details?id=1636806&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"React.js Application Developer","companyName":"Accenture","time":"a day ago","location":"Hyderabad / Secunderabad","area":null,"country":"India","description":"<br>Job Description<br><strong>About Accenture: </strong>Accenture is a leading global professional services company, providing a broad range of services in strategy and consulting, interactive, technology and operations, with digital capabilities across all of these services. We combine unmatched experience and specialized capabilities across more than 40 industries — powered by the world’s largest network of Advanced Technology and Intelligent Operations centers. With 513,000 people serving clients in more than 120 countries, Accenture brings continuous innovation to help clients improve their performance and create lasting value across their enterprises. Visit us at <ul><br><li><strong>Project Role :</strong>Application Developer</li><li><strong>Project Role Description :</strong>Design, build and configure applications to meet business process and application requirements.</li><li><strong>Management Level :</strong>8</li><li><strong>Work Experience :</strong>8-10 years</li><li><strong>Work location :</strong>Hyderabad</li><li><strong>Must Have Skills :</strong>React.js</li><li><strong>Good To Have Skills :</strong>No Function Specialization</li><li><strong>Job Requirements : </strong><ul><br><li><strong>Key Responsibilities : </strong>a Work on low level design, application build and defect fixes per the business/ functional requirements b Create automated unit test cases c Adhere to the defined coding standards Where possible, recommend best practices to the lead in-charge d Perform peer review of teams build deliverables e Contribute to technical design and creation of reusable components f Application support may be part of the responsibility during the Post-Go Live Support phase</li><br><li><strong>Technical Experience : </strong>a 3 years of experience in Reactjs and sound knowledge of Reactjs hooks b 3 years of experience in Redux and Redux-form frameworks c 4 years of sound knowledge of TypeScript Object-Oriented JavaScript d 4 years of experience with HTML5, CSS3 and writing cross-browser compatible code e Experience creating self-contained, reusable, testable and performant modules/ components which extend the elements and components of core Reactjs f 4 years of experience writing unit tests using automated TDDtask</li><br><li><strong>Professional Attributes : </strong>a Candidate should be a good team player b Candidate should also demonstrate good analytical and problem-solving skills c Candidate should have good written and verbal communication skills</li><br><li><strong>Educational Qualification : </strong>Any degree</li></ul></li></ul><br>Qualifications<br>15 years of full time education "},{"link":"https://www.monsterindia.com/seeker/job-details?id=1636803&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"React.js Application Developer","companyName":"Accenture","time":"a day ago","location":"Hyderabad / Secunderabad","area":null,"country":"India","description":"<br>Job Description<br><strong>About Accenture: </strong>Accenture is a leading global professional services company, providing a broad range of services in strategy and consulting, interactive, technology and operations, with digital capabilities across all of these services. We combine unmatched experience and specialized capabilities across more than 40 industries — powered by the world’s largest network of Advanced Technology and Intelligent Operations centers. With 513,000 people serving clients in more than 120 countries, Accenture brings continuous innovation to help clients improve their performance and create lasting value across their enterprises. Visit us at <ul><br><li><strong>Project Role :</strong>Application Developer</li><li><strong>Project Role Description :</strong>Design, build and configure applications to meet business process and application requirements.</li><li><strong>Management Level :</strong>9</li><li><strong>Work Experience :</strong>6-8 years</li><li><strong>Work location :</strong>Hyderabad</li><li><strong>Must Have Skills :</strong>React.js</li><li><strong>Good To Have Skills :</strong>No Function Specialization</li><li><strong>Job Requirements : </strong><ul><br><li><strong>Key Responsibilities : </strong>a Work on low level design, application build and defect fixes per the business/ functional requirements b Create automated unit test cases c Adhere to the defined coding standards Where possible, recommend best practices to the lead in-charge d Perform peer review of teams build deliverables e Contribute to technical design and creation of reusable components f Application support may be part of the responsibility during the Post-Go Live Support phase</li><br><li><strong>Technical Experience : </strong>a 3 years of experience in Reactjs and sound knowledge of Reactjs hooks b 3 years of experience in Redux and Redux-form frameworks c 4 years of sound knowledge of TypeScript Object-Oriented JavaScript d 4 years of experience with HTML5, CSS3 and writing cross-browser compatible code e Experience creating self-contained, reusable, testable and performant modules/ components which extend the elements and components of core Reactjs f 4 years of experience writing unit tests using automated TDDtask</li><br><li><strong>Professional Attributes : </strong>a Candidate should be a good team player b Candidate should also demonstrate good analytical and problem-solving skills c Candidate should have good written and verbal communication skills</li><br><li><strong>Educational Qualification : </strong>Any degree</li></ul></li></ul><br>Qualifications<br>15 years of full time education "},{"link":"https://www.monsterindia.com/seeker/job-details?id=1636801&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"React.js Application Developer","companyName":"Accenture","time":"a day ago","location":"Hyderabad / Secunderabad","area":null,"country":"India","description":"<br>Job Description<br><strong>About Accenture: </strong>Accenture is a leading global professional services company, providing a broad range of services in strategy and consulting, interactive, technology and operations, with digital capabilities across all of these services. We combine unmatched experience and specialized capabilities across more than 40 industries — powered by the world’s largest network of Advanced Technology and Intelligent Operations centers. With 513,000 people serving clients in more than 120 countries, Accenture brings continuous innovation to help clients improve their performance and create lasting value across their enterprises. Visit us at <ul><br><li><strong>Project Role :</strong>Application Developer</li><li><strong>Project Role Description :</strong>Design, build and configure applications to meet business process and application requirements.</li><li><strong>Management Level :</strong>10</li><li><strong>Work Experience :</strong>4-6 years</li><li><strong>Work location :</strong>Hyderabad</li><li><strong>Must Have Skills :</strong>React.js</li><li><strong>Good To Have Skills :</strong>No Function Specialization</li><li><strong>Job Requirements : </strong><ul><br><li><strong>Key Responsibilities : </strong>a Work on low level design, application build and defect fixes per the business/ functional requirements b Create automated unit test cases c Adhere to the defined coding standards Where possible, recommend best practices to the lead in-charge d Perform peer review of teams build deliverables e Contribute to technical design and creation of reusable components f Application support may be part of the responsibility during the Post-Go Live Support phase</li><br><li><strong>Technical Experience : </strong>a 3 years of experience in Reactjs and sound knowledge of Reactjs hooks b 3 years of experience in Redux and Redux-form frameworks c 4 years of sound knowledge of TypeScript Object-Oriented JavaScript d 4 years of experience with HTML5, CSS3 and writing cross-browser compatible code e Experience creating self-contained, reusable, testable and performant modules/ components which extend the elements and components of core Reactjs f 4 years of experience writing unit tests using automated TDDtask</li><br><li><strong>Professional Attributes : </strong>a Candidate should be a good team player b Candidate should also demonstrate good analytical and problem-solving skills c Candidate should have good written and verbal communication skills</li><br><li><strong>Educational Qualification : </strong>any degree</li></ul></li></ul><br>Qualifications<br>15 years of full time education "},{"link":"https://www.monsterindia.com/seeker/job-details?id=1636682&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"E2E_PYTHON / DJANGO Software Developer [ R ]","companyName":"D Source","time":"a day ago","location":"Nashik","area":null,"country":"India","description":""},{"link":"https://www.monsterindia.com/seeker/job-details?id=1636658&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Full Stack Developer","companyName":"Superior Talent","time":"a day ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"<br>Description<br><li><strong>Fulltime, should know Laravel, React JS, MySQL, jQuery</strong></li><br><br>Job Requirements<br><strong>3 to 4 years exp</strong><br><strong>Bangalore Location</strong><br>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1508686&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":" JavaScript Software Engineer - A South Africa Based IT Company, Pune","companyName":"Seventh Contact Hiring Solutions","time":"2 days ago","location":"Pune","area":null,"country":"India","description":"Job specifications:<br><ul><li>Current proficiency in JavaScript with 3+ years solid exposure at  professional level<br></li><li>Dedication to getting the job done no matter the obstacles<br></li><li>A full stack developer is a definite plus in this role</li><li>Experience in: (relative to seniority)<br></li><li>JavaScript ,React,Angular2.0,Angular4.0 or latest version .</li><li>Hands on experience in HTML, CSS,JQuery.<br></li><li>Back-end service integration typically - REST Web Services: Node.js, Java, .Net, Go and Java EE<br></li><li>Jira and Git<br></li><li>Testing frameworks<br></li><li>Microservices, Docker and Kubernetes experience beneficial<br></li><li>AWS experience and or certification beneficial<br></li><li>Ability to read and identify issues in back-end code in languages such as Node.js, Java, .Net, Go and Java EE<br></li></ul>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1301403&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Technology Consultant (Dot Net) with a Microsoft Gold Partner company for Bavdhan, Pune","companyName":"Seventh Contact Hiring Solutions","time":"2 days ago","location":"Pune","area":null,"country":"India","description":"Role &amp; Responsibilities:<br>As a part of agile team environment, you are expected to independently work on end-to-end project delivery which includes –<br>1. To design and build applications using n-tier architectures (preferably in MVC using C#)<br>2. Analyzing and designing software as per the project requirements<br>3. Developing and implementing quality software solutions as per the requirements as per defined timelines<br>4. Exercising independent judgment in evaluating alternative technical solutions<br>5. Preparing unit test cases for quality check of the deliverables<br>6. Constantly upgrading by learning technologies beyond traditional area of expertise<br>Job Requirements/Qualifications:<br>1. Minimum 2yrs hands-on experience in programming in ASP, .Net Framework 4.0/ 4.5, JavaScript<br>2. Knowledge of MVC / Azure JSON, XML, WebAPI, AngularJS, and Entity Framework would be a definite advantage.<br>3. Ability to independently deliver complex development projects<br>4. Must enjoy hands on programming work<br>5. Excellent written and oral communication skills<br>6. Enjoys working as part of agile teams in a start-up environment."},{"link":"https://www.monsterindia.com/seeker/job-details?id=1636463&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Node.JS Technical Lead-Bangalore-FTE","companyName":"Best infosystems Ltd","time":"2 days ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"Node.JS Technical Lead<br>Job Title:NodeJS<br>Exp: 3-12 years<br>• Proficient in JavaScript (NodeJS) development<br>• Knowledge of cloud technologies (preferably AWS)<br>• Good experience with data persistence, really great if you worked with SQL, noSQL and event sourcing.<br>• Knowledge of web software architectures - Client-server, Microservices, SOA<br>• Familiar with Agile<br>• API development<br>• Individual development, training and a tech community<br>If you are open for this job opportunity please forward your latest CV along with fill up Information so that we can process your candidature to next level.<br>====================================================<br># Your full name ( First : Middle : Last ) ( All expanded ) :<br># Present Employer Name &amp; Work Location :<br># Permanent / Contract Employee :<br># Highest Qualification (University Name and Passing year):<br># Total experience:<br># Relevant experience:<br># Current CTC:<br># Expected CTC:<br># Official Notice Period:<br># Are you serving notice period if yes then mention LWD:<br># Any offer you are holding (if yes please share the offer amount):<br># PAN number:<br>====================================================<br>Thanks &amp; Regards,<br>Rajiv<br>Lead-IT Resourcing Specialist<br>Best Infosystems Limited<br>Email : rajiv(at)bestinfosystems(dot)co(dot)in  "},{"link":"https://www.monsterindia.com/seeker/job-details?id=1636457&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"ReactJS with Java Module Lead / Tech Lead-Bangalore-FTE","companyName":"Best infosystems Ltd","time":"2 days ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"Job Title: React JS with JAVA<br>Job Location:Bangalore<br>• Over all 6 to 10 yrs of IT Exp<br>• Developing and maintaining web applications written in ReactJS/HTML/CSS/JavaScript<br>• Experience with a variety of JavaScript libraries and frameworks<br>• Know W3C-compliant markup that looks pixel-perfect<br>• Experience with code repositories (e.g., SVN / Git)<br>• Ability to become proficient with new technologies quickly<br>• Experience in ReactJS, NodeJS. Developing singe page apps using React JS &amp; Redux<br>If you are open for this job opportunity please forward your latest CV along with fill up Information so that we can process your candidature to next level.<br>====================================================<br># Your full name ( First : Middle : Last ) ( All expanded ) :<br># Present Employer Name &amp; Work Location :<br># Permanent / Contract Employee :<br># Highest Qualification (University Name and Passing year):<br># Total experience:<br># Relevant experience:<br># Current CTC:<br># Expected CTC:<br># Official Notice Period:<br># Are you serving notice period if yes then mention LWD:<br># Any offer you are holding (if yes please share the offer amount):<br># PAN number:<br>====================================================<br>Thanks &amp; Regards,<br>Rajiv<br>Lead-IT Resourcing Specialist<br>Best Infosystems Limited<br>Email : rajiv(at)bestinfosystems(dot)co(dot)in "},{"link":"https://www.monsterindia.com/seeker/job-details?id=1636333&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Urgent job opening in a CMM5 level Company @ Bangalore Location (Node.JS Technical Lead)","companyName":"Best infosystems Ltd","time":"2 days ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"<u><b>JD of Node.JS Technical Lead:</b></u><div>NodeJS, Typescript, React, Redux, Webpack, HTML5/ES6/CSS3/SCSS<br></div><div>experience in working with fast paced web development with agile/ scrum methodology<br>Experience with building eCommerce solutions.<br></div><div><br></div><div>Location: Bangalore</div><div>Experience: 5-10 Years<br></div><div>Notice Period: 0-45 Days<br></div><div><br></div><div>Questionnaries:<br>1. Total experience:<br>2. Relevant experience:<br>3. Current CTC:<br>4. Expected CTC:<br>5. Official Notice Period:<br>6. Are you serving notice period if yes then mention LWD:<br>7. Any offer you are holding (if yes please share the offer amount):<br>8. PAN number:<br>With regards<br>Ujjwal Ghosh<br></div>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1636326&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Urgent Job opening in a CMM5 level company_Bangalore location_React.JS Lead/Module Lead","companyName":"Best infosystems Ltd","time":"2 days ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"<div><b><u>JD of React.JS lead:</u></b></div>Developing and maintaining web applications written in ReactJS/HTML/CSS/JavaScript<br>Experience with a variety of JavaScript libraries and frameworks<br>Know W3C-compliant markup that looks pixel-perfect<br>Experience with code repositories (e.g., SVN / Git)<br>Ability to become proficient with new technologies quickly<br>Experience in ReactJS, NodeJS. Developing singe page apps using React JS &amp; Redux<div><br></div><div>Experience:6-10 Years (into react 3y+)</div><div><br></div><div>Location: Bangalore</div><div><br></div><div>Questionnaries:<br>1. Total experience:<br>2. Relevant experience:<br>3. Current CTC:<br>4. Expected CTC:<br>5. Official Notice Period:<br>6. Are you serving notice period if yes then mention LWD:<br>7. Any offer you are holding (if yes please share the offer amount):<br>8. PAN number:<br></div><div><br></div>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1636280&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"UI UX Designer ","companyName":"Innovius Overseas Consultants Private Limited","time":"2 days ago","location":"Hyderabad / Secunderabad","area":null,"country":"India","description":"Design and develop user-friendly, reusable, intuitive, innovative and a feel of nextgeneration User Interface.<br> Translate the UI/UX design wireframes to codes that will produce visual elements of the<br>application Design the UI framework.<br> Experience in design and delivery of Web UI Applications using in Angular JS development<br>Should be proficient with Angular 6+, TypeScript, JavaScript, RESTful services, jQuery .<br> Must have prior hands-on experience in delivering highly scalable client-side applications<br>Desired: Experience with design and development of mobile applications is a plus<div> Real time experience in UI development owning major deliverables, providing solutions and<br>driving innovations.<br> Strong expertise in with HTML5, CSS3, JavaScript, ES6, Web Pack and other tools related to<br>React Front End Development.<br> Strong analytical and problem solving skills.<br> Expertise in unit testing with Karma, Jasmine, Jest, Enzyme etc. and end to end testing with<br>Protractor.<br> Experience in source control using Git, SVN etc.<br> Strong communication skills to interact with stakeholders<br> Should understand the UX design and design/develop optimal solutions for UI<br> Experience in consuming Restful web services using various Ajax techniques.<br></div>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1636265&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"Data Scientist ","companyName":"Innovius Overseas Consultants Private Limited","time":"2 days ago","location":"Hyderabad / Secunderabad","area":null,"country":"India","description":"Design and develop machine learning and data mining algorithms<br> Must have hands-on experience in Java, C++, Python, Node JS, C#, programming<br>languages<br> Contribute to data mining techniques and applications using state-of-the-art<br>methods Hands on expertise in Artificial Intelligence, Machine Learning, Neural<br>www.innoviusconsultants.com<br>Networks, Human -Computer interaction, data science, applied mathematics and<br>Computer<br> Development of end to end AI based product. Discover, design, and develop<br>analytical methods to support novel approaches of data and information processing<br> Develop innovative products, modules and solutions<br> Explore and examine data from multiple disparate sources and communicate the<br>findings, orally and visually.<br> Develop and design algorithms and frameworks in terms of API to leverage this<br>data.<br> Develop and integrate algorithms in Tensorflow and Caffe<br> Given a business problem, estimate solution feasibility and potential approaches<br>based on available data<br> Ensure best practices for processing, cleansing, and verifying the integrity of data<br>used for analysis and learning<br> Quickly prototype solutions and build models to test feasibility of solution approach<br> Work across the spectrum of reporting and data visualization, statistical modeling<br>and supervised learning tools and techniques and apply the right level of solution to<br>the right problem<br> Research deep learning approaches: Develop and integrate deep learning<br>algorithms for transfer learning end-end reinforcement learning for control."},{"link":"https://www.monsterindia.com/seeker/job-details?id=1636253&searchId=d7255248-c702-42bb-a08c-0c451d76c8b5","name":"MeanStack Developer","companyName":"Company Name Confidential","time":"2 days ago","location":"Hyderabad / Secunderabad","area":null,"country":"India","description":""}]