[{"link":"https://www.monsterindia.com/seeker/job-details?id=1638760&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Software Engineer","companyName":"Wells Fargo","time":"an hour ago","location":"Hyderabad / Secunderabad","area":null,"country":"India","description":"<br>Job Description :<br>About Wells Fargo<br>Wells Fargo &amp; Company (NYSE: WFC) is a leading global financial services company headquartered in San Francisco (United States). Wells Fargo has offices in over 30 countries and territories. Our business outside of the U.S. mostly focuses on providing banking services for large corporate, government and financial institution clients. We have worldwide expertise and services to help our customers improve earnings, manage risk, and develop opportunities in the global marketplace. Our global reach offers many opportunities for you to develop a career with Wells Fargo. Join our diverse and inclusive team where you will feel valued and inspired to contribute your unique skills and experience. We are looking for talented people who will put our customers at the center of everything we do. Help us build a better Wells Fargo. It all begins with outstanding talent. It all begins with you.<br>Market Job Description<br><strong><br>About Wells Fargo India<br></strong><br>enables global talent capabilities for Wells Fargo Bank NA., by supporting business lines and staff functions across Technology, Operations, Risk, Audit, Process Excellence, Automation and Product, Analytics and Modeling. We are operating in Hyderabad, Bengaluru and Chennai locations.<br><strong><br>About the Role<br></strong><br><li><br>This position will be an integral part of Wholesale Enrollments team within the CCIBT - TMPS technology group. Acts as a Sr. Developer in providing application coding, design guidance and consultation, utilizing a thorough understanding of applicable technology, tools and existing designs. Provides coding direction to team and develops highly complex original code. Oversees the preparation of test data, testing and debugging of programs. </li><br><strong><br>Responsibilities<br></strong><br><li><br>As a senior team member, ability understand the requirements, design documents and convert them into secure code by using <strong>Java/J2EE stack.</strong></li><li><strong><br>Capable of providing technical solutions</strong><br>to the business problems</li><li><br>Ability talk to different partners in understanding different systems and be able to negotiate and provide direction to business on technology and other partners.</li><li><br>Understand the risks and make all the stakeholders informed of the risks, plan and mitigate them on a timely basis.</li><li><br>Should have <strong>guided and mentored</strong> the junior team members in the technology.</li><li><br>Troubleshoot and tune for performance</li><br><strong><br>Essential Qualifications<br></strong><br><li><strong><br>Bachelor/Master</strong><br>degree with <strong>9+ years of IT</strong> experience <strong>in </strong><strong>application development and implementation experience using </strong><strong>Java/J2EE</strong><strong> stack with deeper knowledge in </strong><strong>Spring Core, Spring MVC, Spring Boot</strong><strong> Framework and API’s.</strong></li><li><strong><br>Considerable</strong><strong><br>experience and hands on with Cloud Management and services pertaining to PCF and AWS</strong></li><li><br>6+ years of hands-on IT experience in developing complex, highly integrated, web-based applications using Angular/React JS frameworks and worked in Agile teams.</li><li><strong><br>3+ years of </strong><strong><br>JAX-WS, Axis, SOAP, REST</strong><strong><br>web services development</strong><strong><br>experience</strong></li><li><br>Should have work experience in HTML5, Java Script(ES5 &amp; ES6) ,Object oriented JavaScript, Ajax, JSON, React JS library, Responsive web development. Knowledge working with Node &amp; GIT.</li><li><br>Experience in implementation of JS Design patterns.</li><li><br>Experience in writing unit cases using RTL/Mocha/Jasmine/Jest libraries.</li><li><br>Should have work experience in Java Script(ES5 &amp; ES6) ,Object oriented JavaScript, Ajax, JSON, React JS library, Responsive web development. Knowledge working with Node &amp; GIT.</li><li><br>Experience in implementation of Java, J2EE, and JS Design patterns.</li><li><br>Experience in writing unit cases using Junit, RTL/Mocha/Jasmine/Jest libraries.</li><li><br>Should be able to deploy the application in non-production environments on Linux platforms.</li><li><br>Familiar and direct experience of Agile development and dev ops tools such as Jira, confluence, Rally and automated regression testing</li><li><br>Should have worked on DEVOPS, CI/CD using GITHUB, MAVEN, Artifactory, UDeploy, Jenkins</li><br><strong><br>Desired Qualifications<br></strong><br><li><br>Certification in AWS or Cloud foundry (PCF) is plus</li><li><br>Hands on experience of Front End Technologies such as HTML5, Angular JS, and React JS is an added advantage.</li><li><br>Good verbal and written communication skills</li><li><br>Exposure to banking domain is a plus</li><br>We Value Diversity<br>At Wells Fargo, we believe in diversity and inclusion in the workplace; accordingly, we welcome applications for employment from all qualified candidates, regardless of race, color, gender, national or ethnic origin, age, disability, religion, sexual orientation, gender identity or any other status protected by applicable law. We comply with all applicable laws in every jurisdiction in which we operate."},{"link":"https://www.monsterindia.com/seeker/job-details?id=1638782&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Package Consultant: Sterling","companyName":"IBM","time":"an hour ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"<br>Job Description :<br>Introduction<br>As a Package Consultant at IBM, get ready to tackle numerous mission-critical company directives. Our team takes on the challenge of designing, developing and re-engineering highly complex application components and integrating software packages using various tools. You will use a mix of consultative skills, business knowledge, and technical expertise to effectively integrate packaged technology into our clients business environment and achieve business results.<br>Your Role and Responsibilities<br>As a Package Consultant at IBM, get ready to tackle numerous mission-critical company directives. Our team takes on the challenge of designing, developing and re-engineering highly complex application components and integrating software packages using various tools. You will use a mix of consultative skills, business knowledge, and technical expertise to effectively integrate packaged technology into our clients business environment and achieve business results.<br><strong><br>Responsibilities:</strong><li><br>Participate in the software development, and package implementation using industry standard platforms Sterling</li><li><br>Ensure software developed is held to high quality standards through code and design reviews.</li><li><br>Interface with system integrators and IT engineers on projects to ensure proper adherence to SDLC and platform integrity.</li><br>Required Technical and Professional Expertise<br><li><br>Minimum 4-8 years of experience in IT Industry</li><li><br>Validated knowledge of the various modules in IBM Sterling OMS</li><li><br>Hands-on configuration and development experience using OOTB Sterling APIs in a minimum of one Sterling OMS implementation</li><li><br>Proficient in development of wrapper using Sterling OOTB APIs and configuring them as Sterling services (SDF)</li><li><br>Working knowledge of Sterling Store Web and Sterling Call Center</li><li><br>Customization knowledge of Sterling Store / Call Center web UI will be a huge plus</li><li><br>Ability to create Sterling OMS detailed technical design for business requirements</li><li><br>In-depth experience working with Sterling OMS interfaces with external systems using MQ, JMS</li><li><br>Ability to independently setup a local instance of Sterling OMS for development purpose</li><li><br>Solid understanding of core Java, servlets and web services (ReST &amp; SOAP)</li><li><br>Experience working with XMLs, XSLs and JSON</li><li><br>Working and configuration of any one application server; WAS, Weblogic, JBoss, etc</li><br>Preferred Technical and Professional Expertise<br><li><br>Experience working with Sterling Order Management on Cloud (OM SaaS)</li><li><br>Hands-on knowledge of microservices (Spring, Springboot)</li><li><br>Hands-on experience with UI technologies; Angular JS, React JS, GraphQL</li><li><br>You love collaborative environments that use agile methodologies to encourage creative design thinking and find innovative ways to develop with cutting edge technologies</li><li><br>Ambitious individual who can work under their own direction towards agreed targets/goals and with creative approach to work</li><li><br>Intuitive individual with an ability to manage change and proven time management</li><li><br>Proven interpersonal skills while contributing to team effort by accomplishing related results as needed</li><li><br>Up-to-date technical knowledge by attending educational workshops, reviewing publications</li><li><br>Exposure to one SQL database; DB2, Oracle, MySQL, etc</li><li><br>Basic knowledge of navigating through any one operating system; Linux or Windows</li><li><br>Knowledge of any popular IDE (Eclipse), code repository (SVN, CVS, GitHub)</li><br>About Business Unit<br>IBM Services is a team of business, strategy and technology consultants that design, build, and run foundational systems and services that is the backbone of the world's economy. IBM Services partners with the world's leading companies in over 170 countries to build smarter business by reimagining and reinventing through technology, with its outcome-focused methodologies, industry-leading portfolio and world class research and operations expertise leading to results-driven innovation and enduring excellence.<br>Your Life @ IBM<br>What matters to you when you’re looking for your next career challenge?<br>Maybe you want to get involved in work that really changes the world? What about somewhere with incredible and diverse career and development opportunities – where you can truly discover your passion? Are you looking for a culture of openness, collaboration and trust – where everyone has a voice? What about all of these? If so, then IBM could be your next career challenge. Join us, not to do something better, but to attempt things you never thought possible.<br>Impact. Inclusion. Infinite Experiences. Do your best work ever.<br>About IBM<br>IBM’s greatest invention is the IBMer. We believe that progress is made through progressive thinking, progressive leadership, progressive policy and progressive action. IBMers believe that the application of intelligence, reason and science can improve business, society and the human condition. Restlessly reinventing since 1911, we are the largest technology and consulting employer in the world, with more than 380,000 IBMers serving clients in 170 countries.<br>Location Statement<br>For additional information about location requirements, please discuss with the recruiter following submission of your application.<br>Being You @ IBM<br>IBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.<br>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1638705&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Full Stack Developer","companyName":"Larsen &amp; Toubro Infotech Limited","time":"4 hours ago","location":"India","area":null,"country":"India","description":"<br><strong> Job Description </strong><br>* Hands on experience into Core Java , Spring, Spring BootMicroservices, PCF, Restful architecture.<br>* Strong experience in AngularJS 8 , JavaScript, HTML 5, CSS.<br>* Familiarity with JS frameworks such as JQuery.<br>* Deep and extensive knowledge of JavaScript and the web development ecosystem (bootstrap, SASS).<br>* Experience in design and engineering of RESTSOAP based web services.<br>* Knowledge of any DB (preferably MariaDB), SQL pl SQL.<br>* Experience in Bootstrap compatibility, Object-Oriented Design, Web Services (RESTSOAP) Web Services<br>* Experience of working in Agile environment and good understanding of Agile processes. <strong><strong></strong></strong> "},{"link":"https://www.monsterindia.com/seeker/job-details?id=1638703&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"React + Java Spring Boot Developer","companyName":"Larsen &amp; Toubro Infotech Limited","time":"4 hours ago","location":"Pune","area":null,"country":"India","description":"<br><strong> Job Description </strong><br>8+ years of experience React JS is must<br>Very strong in core Java<br>1.1. Class design<br>1.2. Data structures<br>1.3. File Handling<br>1.4. Exception handling<br>1.5. Memory management<br>1.6. ORM/JPA/Templates<br>1.7. JMS<br>1.8. Threads Spring<br>2.1. Spring-boot &amp; Services<br>2.2. IOC Strong Analytical and communication skills<br>Shift Timing: 2pm to 11pm "},{"link":"https://www.monsterindia.com/seeker/job-details?id=1638702&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Sr. Systems Analyst","companyName":"UST Global Singapore Pte Limited","time":"4 hours ago","location":"Bengaluru / Bangalore","area":null,"country":"India"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1638739&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"R&amp;D Engineer","companyName":"Nokia","time":"4 hours ago","location":"Bengaluru / Bangalore, India","area":null,"country":"India","description":"<br>Job Description :<br><b>About Nokia</b><br>At Nokia we create the technology to connect the world. Developing and delivering the industry's only end-to-end portfolio of network equipment, software, services and licensing that is available globally. Through our research teams, including the world-renowned Nokia Bell Labs, Nokia is leading the world to adopt end-to-end 5G networks that are faster, more secure and capable of revolutionizing lives, economies and societies. Nokia adheres to the highest ethical business standards as we create technology with social purpose, quality and integrity. A truly global company, we are 160 nationalities working in more than 100 countries.<br><b>About Nokia Software</b><br>Nokia Software is the leading solutions provider in the telecoms software market helping to drive large-scale service and network operations automation and digital business transformation in support of customer migrations to 5G. Built on Nokia’s cloud-native Common Software Foundation (CSF), Nokia’s multi-vendor and multi-network software solutions enrich and secure user experiences; automate operations and infrastructure; and enable new revenue streams and cost efficiencies.<br><b>Job Description</b><br><b>Key Responsibilities:</b><br>- Best in class in object oriented programming and debugging performance, memory, multi threading issues.<br>- Ability to make high level design decisions, technology choices, and establish an oversight on implementation and delivery processes.<br>- Interface with cross scrum teams to ensure performance, scalability, availability, and usability requirements delivered.<br>- Apply standard, high quality design, development and testing processes<br>- Support customer issues and escalations<br><b>Technical:</b><br>- HTML5, CSS3, JS, Angular/React JS, jQuery, Ajax, Bootstrap programming<br>- Java, Concurrency, Spring data, Spring boot, Kafka, Microservice,<br>- REST, Swagger, Graph QL<br>- Elastic Search, Kibana<br>- Multi Tenancy, Vault, Keycloak, Drools<br>- Neo4j, Maria db<br><b>Domain</b>: EMS, NMS, OSS (Fulfillment Assurance Inventory)<br><b>Behavioural:</b><br>- Organized, Independent<br>- Team Work, Collaboration, Team building, and Coaching<br>- Results Oriented<br>- Ability to explain and understand problems quickly and effectively<br><b>Prior Experience Required:</b><br>The candidate should have a minimum professional qualification of bachelor degree in engineering/technology with 8-12 years of hands-on experience in NMS, Inventory, Network topology, assurance, fulfillment.<br><b>Qualifications :</b>Minimum Bachelor degree in engineering (CS/Electronics/IT)<br><b><br>Imagine creating technology that has the potential to change the world. Working with us, you will have a positive impact on people’s lives and help to overcome some of the world’s most pressing challenges. We act inclusively and respect the uniqueness of people. At Nokia, employment decisions are made regardless of race, color, national or ethnic origin, religion, gender, sexual orientation, gender identity or expression, age, marital status, disability, protected veteran status or other characteristics protected by law. Nokia culture welcomes people as their true selves. Come create the technology to connect the world. </b>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1516309&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Immediate Opening For Java/nodejs/reactjs/AngularJS in CMMI L5 Company","companyName":"Crown Solutions India Private Limited","time":"4 hours ago","location":"Chennai","area":null,"country":"India","description":"<br>Dear Aspirant,<br>We Do have an Opening with our Client in <strong><u> (CMMi level 5 company)</u></strong> . Kindly go through the details given Below and share the profile for Face to Face and Telephonic Interview.<br><strong> Skillset : Java / Angular /NodeJS / ReactJS</strong><br><strong> Exp : 2+ yrs</strong><br><strong> Location :Chennai</strong><br><strong> Notice Period: Immediate to Max 15days</strong><br>( Note : People working in MNC with 60days and 90 days as Official Notice Period please ignore this mail )<br>Interview Mode: Telephonic/Face to face<br><strong> Working Location : Chennai</strong><br><u> If you are interested kindly share your profile with following details:</u><br><ul><li> Total Exp:</li><li> Relevant Exp:</li><li> Current CTC:</li><li> Expected CTC:</li><li> Notice Period required to Join:</li><li> Whether interested to work in the payroll of Crown Solutions(Yes/No):</li><li> Current Company :</li><li> Payroll Company :</li></ul><br><u> Do share Your updated resume :</u> [HIDDEN TEXT]<br>044-4006 6015/8754195295<br>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1528552&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"One of the Reputed Company Hiring Telesales Executive Kolkata &amp; Orisa","companyName":"Selectivite Consultants","time":"6 hours ago","location":"Kolkata, Vadodara","area":null,"country":"India","description":"Hi,<br>We have multiple vacancies in Kolkata &amp; Odisa.<br>Sr. TME Hiring Specifications (L1 &amp; L2):&nbsp;<div><br>- Minimum qualification should be graduate.<br>- Min 1 -4 years of experience in Telesales / Telemarketing process.<br>- Experienced candidates should be from outbound Tele calling background either from retail outbound telesales, collections or retention.<br>- Must Have excellent communication skills in English.<br>- fluency in regional language is a must without any traces of<br>colloquial accent and Multi-lingual will be added advantage.<br>- Willing to work on day shift on rotational basis -WFH / WFO.<br>- Should have desktop / Laptop / smart phone with 4G Volte<br>Connection with good network and internet stability.<br>- Basic Excel and Word &amp; Average typing speed<br>Points to be noted:<br>- Candidates should have good stability in previous job.<br>- Target candidates from outbound tele calling background either from retail outbound telesales, collections or retention.<br>- Avoid not working cases for more than 45days; deviation can be<br>considered for the genuine reason.<br>- Target competitors - Internet , Ecommerce. BFSI segment. - Sulekha, Just Dial, Club Mahindra, Shaadi, JS, HDFC Ergo etc<br>- Upsell, verification and lead generation profiles would not be considered.<br>- Should be openness to stretch on timings and meet targets.<br>- On roll Job ; Fixed Salary +Incentives - Based on the performance.<br>For any details regarding job mail on [HIDDEN TEXT]<br>Or call Huma on 9762999392 </div>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1511883&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Hiring For Front End Developer 5+ Years Exp | Location – Mumbai,Banglr","companyName":"Sellcraft Global Solutions Private Limited","time":"7 hours ago","location":"Bengaluru / Bangalore, Mumbai","area":null,"country":"India","description":"<br>Job Description<br>Hiring for Front End Developer 5 + Years Mumbai and Bangalore Looking candidate for Front end developer Profile Contract to hire long term opportunity. Mumbai , Bangalore Skills: Angular, NodeJS, ,HTML, CSS ,Bootstrap, Angular , Angular JS"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1638435&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"React Developer","companyName":"Talent Corner Hr Services Private Limited","time":"7 hours ago","location":"Pune, Delhi NCR","area":null,"country":"India"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1516089&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Hiring For Front End Developer 5+ Years Exp | Location - Mumbai,Banglr","companyName":"Sellcraft Global Solutions Private Limited","time":"10 hours ago","location":"Chennai","area":null,"country":"India","description":"<br>Hiring for Front End Developer 5 + Years Mumbai and Bangalore<br>Looking candidate for Front end developer Profile Contract to hire long term opportunity.<br>Mumbai , Bangalore<br>Skills: Angular, NodeJS, ,HTML, CSS ,Bootstrap, Angular , Angular JS<br><b>Required Candidate profile</b>Share CV's on [HIDDEN TEXT]<br>Connect - 7499162340"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1638318&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Hiring For Java Fullstack Lead Position For Pune , Mumbai Loc Exp - 8","companyName":"Sellcraft Global Solutions Private Limited","time":"10 hours ago","location":"Pune","area":null,"country":"India","description":"<br>Dear all,<br>Lead Application Developer (Front-end / Java Web Developer Technical Specialist/Lead) Responsibilities Enhance Alliance Data Retails Digital (Web, mobile) offerings Actively participate in a fun and fast paced Agile environment<br><b>Required Candidate profile</b>Identify and drive continuous improvement initiatives throughout the organization's innovation within the team Manage compromises and risks as they appear."},{"link":"https://www.monsterindia.com/seeker/job-details?id=1516088&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Hiring For Delaplex Banglore ReactJS Node.JS - Third Party Payroll","companyName":"Sellcraft Global Solutions Private Limited","time":"10 hours ago","location":"Chennai","area":null,"country":"India","description":""},{"link":"https://www.monsterindia.com/seeker/job-details?id=1638292&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Senoir Java Developer - South Africa Based IT Company Viman Nagar Pune","companyName":"Seventh Contact Hiring Solutions","time":"10 hours ago","location":"Pune","area":null,"country":"India","description":"<br><strong>Roles And Responsibilities</strong><ul><li>As a Java software engineer, you will understand the requirements build great code throughout the full development lifecycle - from concept and design right through to testing.</li><li>Identifying production and non-production application issues</li><li>Contributing in all phases of the development lifecycle</li><li>Supporting continuous improvement by investigating alternatives and technologies and presenting these for architectural review</li></ul><br><strong>Desired Candidate Profile</strong><br><ul><li>3+ years experience working on Core Java / J2EE, Spring, Hibernate, Webservices, AngularJS, JavaScript, JBoss. </li><li>Experience in building <strong>microservices Springboot</strong> using Java is <strong>mandatory</strong>.</li><li>A full stack developer is a definite plus in this role, but not always essential</li><li>Experience in handling a team is good to have.</li><li>Experience in: (relative to seniority)</li><li>OO Principles: polymorphism, inheritance, encapsulation</li><li>Strong Java and OO development knowledge</li><li>Experience in <strong>Node JS</strong> is beneficial.</li><li>RESTful services</li><li>JPA / Hibernate</li><li>Jira and Git</li><li>Testing frameworks like Gherkin</li><li>Testing frameworks for APIs</li><li><strong>Microservices,</strong> Docker and Kubernetes experience beneficial</li><li>AWS experience and or certification beneficial</li><li>Ability to read and identify issues in front-end code in frameworks such as Angular and React<strong>Roles and Responsibilities</strong></li></ul><br>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1638132&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Front end Developer React Native/ JavaScript","companyName":"Talent Corner Hr Services Private Limited","time":"13 hours ago","location":"Delhi, Delhi NCR","area":null,"country":"India","description":"<br>Must have experience on building and deploying mobile application for Android and IOS platform using React Native<br>Must to have hands on experience on ReactJS, Javascript<br>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1638124&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Java Full Stack Lead / Architect For Gurgaon Location","companyName":"Talent Corner Hr Services Private Limited","time":"13 hours ago","location":"Delhi, Delhi NCR","area":null,"country":"India","description":""},{"link":"https://www.monsterindia.com/seeker/job-details?id=1638064&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Vacancy For Full Stack Developer / Architect","companyName":"Talent Corner Hr Services Private Limited","time":"13 hours ago","location":"Chennai","area":null,"country":"India","description":"<br>Skills Required:<br>Writing HTML, CSS, and JavaScript, Back-end programming language.<br>Database design &amp; management, Server management &amp; deployment.<br>Familiarity with framework.<br>Experience implementing testing platforms &amp; unit tests<br>Proficiency with Git. "},{"link":"https://www.monsterindia.com/seeker/job-details?id=1638040&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"React Developer","companyName":"Talent Corner Hr Services Private Limited","time":"13 hours ago","location":"Chennai","area":null,"country":"India","description":"<br>Translating designs and wireframes into high quality code. Web-capable devices and browsers. Strong proficiency in JavaScript, including DOM &amp; JavaScript. Basic knowledge of react, CSS3 and HTML5, JSON Web Token, React.js. "},{"link":"https://www.monsterindia.com/job-vacancy-alfresco-developer-cognizant-technology-solutions-india-pvt-ltd-pune-25293317.html","name":"Alfresco Developer","companyName":"Cognizant Technology Solutions India Pvt Ltd","time":"13 hours ago","location":"Pune","area":null,"country":"India"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637931&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Software Engineer ","companyName":"Js It Tech Solutions","time":"13 hours ago","location":"Gurgaon / Gurugram, Hyderabad / Secunderabad","area":null,"country":"India","description":"Hi All,<br>GREETINGS FROM JS IT TECH SOLUTIONS!<br>We have an urgent requirement for Software Engineer - Full Stack<br>Position: Software Engineer - Full Stack<br>Exp:4-6 years<br>Notice period:Immediate to 15 days<br>Location: Gurgaon<br>Job Description:<br>SKILLS:<br>\tBachelors or Masters Degree in Computer Science or Computer Engineering<br>\t3+ years of relevant experience as aSoftwareEngineer<br>\tStrong understanding of software design concepts, patterns, tools and best practices.<br>\tMust have full stack experience using C# Net Core, React and RDBMS.<br>KeyPoints:Software Engineer C#, .Net, Must have React experience<br>Contact : [HIDDEN TEXT]/ [HIDDEN TEXT]// 7893797028<br>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637857&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"PHP Developer/PHP Programmer/Sr.PHP developer/Sr. PHP programmer/PHP/Laravel","companyName":"Markelytics Solutions India Private Limited","time":"15 hours ago","location":"Mumbai, Mumbai City, Navi Mumbai, Thane","area":null,"country":"India","description":"<div>Openings in the department of Web Applications for Senior PHP developers.<br>Generic Job Description:<br>Key Requirements<br> Sound knowledge of technologies : Web Technologies like PHP, NodeJS etc and Frontend technologies like Javascript, Angular JS,etc<br> Excellent communication skills<br> Database experience (MySQL, Memcache, NoSQL)<br> API fluent (creation &amp; usage REST prefered)<br> Working knowledge of source control tools (git)<br> Ability to research, learn and implement new technologies in short time<br> Ability to work independently and as part of a team<br> Should have worked in all the stages of SDLC<br> AWS experience is a plus.<br>Responsibilities<br> Problem Solving Personality<br> Proactively manage multiple projects and coordinate activities with internal Engineering team<br> Solid understanding of OOP, AJAX, jQuery, NodeJS, NoSQL, Server management, Build &amp; Deployment, and MySQL.<br></div><div><br></div><div>If interested, please send your latest/updated resume to <b>[HIDDEN TEXT].</b></div><div><br></div><div><br></div>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1573566&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Assistant Manager - Spark Developer","companyName":"Genpact","time":"16 hours ago","location":"Hyderabad / Secunderabad","area":null,"country":"India","description":"<br>Job Description :<br>With a startup spirit and 90,000+ curious and courageous minds, we have the expertise to go deep with the world\\u2019s biggest brands\\u2014and we have fun doing it. Now, we\\u2019re calling all you rule-breakers and risk-takers who see the world differently, and are bold enough to reinvent it. Come, transform with us.<br><b> Are you the one we are looking for? </b><br>We are inviting applications for the role of <b> AM, Spark Developer </b> Responsibilities<br><ul><li> Should have experience working on Spark and SQL modules of Spark extensively </li><li> Experience in designing and developing applications in Spark using Scala to compare the performance of Spark with Hive and SQL/Oracle. </li><li> Should have experience in analyzing Hive SQL scripts and crafted a solution to implement using Scala </li><li> Should have experience in crafting and developing applications in Spark using Scala to compare the performance of Spark with Hive and SQL/Oracle. </li><li> Develop Spark scripts by using Scala shell commands as per the requirement </li><li> Develop Scala scripts, UDFs using both Data frames/SQL/Data sets and RDD/MapReduce in Spark for Data Aggregation, queries and writing data back into OLTP system through Sqoop </li><li> Optimizing of existing algorithms in Hadoop using Spark Context, Spark-SQL, Data Frames and Pair RDD's. </li><li> Experienced in performance tuning of Spark Applications for setting right Batch Interval time, accurate level of Parallelism and memory tuning </li><li> Expertise with the tools in Hadoop Ecosystem including Hive, HDFS, MapReduce, Sqoop, Spark, Kafka, Yarn </li><li> Excellent knowledge on Hadoop ecosystems such as HDFS, Job Tracker, Task Tracker, Name Node, Data Node </li><li> Very good understanding of Partitions, Bucketing concepts in Hive and crafted both Managed and External tables in Hive to optimize performance. </li><li> Experienced in handling large datasets using Partitions, Spark in Memory capabilities, Broadcasts in Spark, Effective &amp; efficient Joins, Transformations and other during ingestion process itself </li><li> Develop Hive queries to process the data and generate the data cubes for visualizing </li><li> Implemented Partitioning, Dynamic Partitions, Buckets in HIVE. </li><li> Involved in converting Hive/SQL queries into Spark transformations using Spark RDDs, and Scala. </li><li> Experience in manipulating/analyzing large datasets and finding patterns and insights within structured and unstructured data </li><li> Should be involved in building Hive tables, and loading and analyzing data using hive queries </li><li> Proven experience with SQL queries and database tuning </li><li> Strong knowledge of database design and development with previous experience in developing ETL processes, and multifaceted data models </li><li> Respond to &amp; solving support enquiries from users across various groups including Finance, Digital and Operations </li></ul> Qualifications we seek in you!<br><b> Minimum Qualifications </b><br><ul><li> Programming languages: Java, C, C++, Scala, Python </li><li> Scripting: Shell </li><li> Operating systems: Linux, Unix, Windows </li><li> RDBMS/No SQL: SQL Server, MySQL, Oracle 11g, Azure, HBase </li><li> Hadoop Ecosystem: Spark Scala, Spark Python, Map Reduce, Hive, HBase, HDFS, Sqoop, Pig, , Zookeeper, Kafka, Spark streaming, Oozie </li></ul> Preferred qualifications<br><ul><li> Analytical thinking and problem solving abilities. </li><li> Good Presentation Skills </li></ul><br><b> Genpact is an Equal Opportunity Employer and considers applicants for all positions without regard to race, color, religion or belief, sex, age, national origin, citizenship status, marital status, military/veteran status, genetic information, sexual orientation, gender identity, physical or mental disability or any other characteristic protected by applicable laws. </b> Genpact is committed to creating a dynamic work environment that values diversity and inclusion, respect and integrity, customer focus, and innovation. For more information, visit www.genpact.com. Follow us on Twitter, Facebook, LinkedIn, and YouTube.<br>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1561614&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Manager - Salesforce Lead Developer - Technology","companyName":"Genpact","time":"16 hours ago","location":"Noida","area":null,"country":"India","description":"<br>Job Description :<br>With a startup spirit and 90,000+ curious and courageous minds, we have the expertise to go deep with the world\\u2019s biggest brands\\u2014and we have fun doing it. Now, we\\u2019re calling all you rule-breakers and risk-takers who see the world differently, and are bold enough to reinvent it. Come, transform with us.<br><b><br></b><br><b> Transformation happens here. Come, be a part of our exciting journey! </b><br><b> Are you the one we are looking for? </b><br>Inviting application role for <b> Manager, Salesforce Lead Developer, Technology. </b><br>A candidate with the experience to build a custom lightning component and has knowledge of Salesforce Security Model, Data Model, Design, code, unit test, debug, implement and integrations. Has good Knowledge of JS, CSS, HTML with experience in Agile development methodologies.<br>You will be providing key business insights based on analyzing multiple data sources. You will be thinking through problems and make impactful recommendations. Your job will include collaborating across the organization with PM, architects, UX specialists, product managers and other software developers. You will use your expertise in building high-quality automated cloud solutions in an agile setting. You are encouraged to be hands-on and up to date with the latest technology stack. If this type of position motivates you, tell us why you are the right person for this exciting role! <b> Responsibilities </b><br><ul><li> Able to perform code review and code optimization </li><li> Taking the initiative to identify what the business should be supervising and evaluating </li><li> Can create Technical Design document </li><li> Ensuring that the team is following standard methodologies when architecting, programming or documenting solutions. </li><li> Ensure the timely delivery of improvements or modifications to ongoing production CRM systems. </li><li> Handling the team with the individual contributors. </li></ul><b> Qualifications </b><br><b> Minimum Qualifications </b><ul><li> Good interpersonal skills </li><li> B.Tech./ M.Tech./ MBA </li><li> Robust analytics experience </li></ul><b> Preferred Qualifications </b><br><ul><li> Ability to work Multi-functionally in a creative, Agile environment and lead multiple task assignments </li><li> Problem solving and troubleshooting skills with the ability to exercise mature judgment </li><li> Salesforce admin, dev certifications </li></ul><br><b> Genpact is an Equal Opportunity Employer and considers applicants for all positions without regard to race, color, religion or belief, sex, age, national origin, citizenship status, marital status, military/veteran status, genetic information, sexual orientation, gender identity, physical or mental disability or any other characteristic protected by applicable laws. </b> Genpact is committed to creating a dynamic work environment that values diversity and inclusion, respect and integrity, customer focus, and innovation. For more information, visit www.genpact.com. Follow us on Twitter, Facebook, LinkedIn, and YouTube.<br>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1566275&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Manager - PWA Developer Frontend Full Stack Developer","companyName":"Genpact","time":"16 hours ago","location":"Gurgaon / Gurugram","area":null,"country":"India","description":"<br>Job Description :<br>With a startup spirit and 90,000+ curious and courageous minds, we have the expertise to go deep with the world\\u2019s biggest brands\\u2014and we have fun doing it. Now, we\\u2019re calling all you rule-breakers and risk-takers who see the world differently, and are bold enough to reinvent it. Come, transform with us.<br><b> Are you the one we are looking for? Apply Now ! </b><br>Inviting applications for the role of <b> Manager, PWA Developer Frontend Full Stack Developer! </b><br>In this role you will be responsible for adhering and driving team towards standards driven API Design &amp; REST API spec conformation along with SQL/NoSQL databases performance. <b> Responsibilities </b><br><li> Driving teams towards micro-services while understanding the enterprise specific implementations with different technologies. </li><li> Flexible to work with multi-functional team to create great customer experiences and implement high quality code. </li><li> Continuously discover, evaluate, and implement new technologies to maximize development efficiency. </li><li> You priorities performance in all your development - both network and rendering </li><li> REST API construction, documentation, and architecture, including API description languages like Swagger. </li><li> Basic understanding of CSS pre-processing platforms, such as LESS, SASS &amp; PostCSS </li><li> Experience with state management libraries - Redux, Vuex, Redux-Saga/ Redux hunk </li><li> Deeply understand the Typescript/JavaScript and syntax (ES6 +) Python </li><li> Experience of any NoSQL database or a graph database is a plus. </li><li> Understanding of event patterns like CQRS and micro-services architectures is a plus. </li><li> Demonstrated awareness of cross-browser compatibility issues and client-side performance. </li><b> Qualifications </b><br><b> Minimum Qualifications </b><li> Graduation/ Post-graduation from a reputed university </li><li> Proven ability in creating web application back-end using NodeJS and experience in ReactJS/VueJS/AngularJS, NodeJS, Bootstrap, HTML5, CSS3/CSS4 and modern open-source web frameworks </li><li> Have experience in building highly scalable REST APIs and library design using Node Js, Express js/ Python </li><li> Solid grasp of any SQL database, Hands-on design and implementation experience in IT, with knowledge in a minimum of three of the following technical disciplines: </li><li> Application development, Network design, Middleware, Servers and storage </li><li> Exposure to multiple, diverse technologies and processing environments </li><li> Project solution architecture experience </li><li> Good interpersonal skills in areas such as teamwork, facilitation and negotiation </li><li> Excellent analytical, technical and leadership skills </li><li> Excellent written and verbal communication skill </li><li> Ability to translate business needs into solution architecture requirements </li><li> Ability to quickly comprehend the functions and capabilities of new technologies </li><li> Solid grasp of network and data center architecture, as well as application development methodologies </li><li> Understanding of SOA, object-oriented analysis and design, or client/server system </li><b> Preferred Qualification </b><br><li> Working experience on Git and understanding of tools like npm </li><li> Is knowledgeable about a wide range of web and internet technologies </li><li> Brings creativity to their work and designs resilient, scalable, and maintainable software. </li><li> Candidate can work with engineers, designers, product managers, and engineering managers to prioritize work and find opportunities that will benefit multiple teams. </li><li> Supervise record of designing, developing and supporting highly scalable, responsive web applications and services. </li><li> Capability for being thoughtful, outspoken and collaborative </li><li> Motivation that is focused on long-term results </li><br><b> Genpact is an Equal Opportunity Employer and considers applicants for all positions without regard to race, color, religion or belief, sex, age, national origin, citizenship status, marital status, military/veteran status, genetic information, sexual orientation, gender identity, physical or mental disability or any other characteristic protected by applicable laws. </b> Genpact is committed to creating a dynamic work environment that values diversity and inclusion, respect and integrity, customer focus, and innovation. For more information, visit www.genpact.com. Follow us on Twitter, Facebook, LinkedIn, and YouTube.<br>  "},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637752&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Microsoft Teams Development Application Developer","companyName":"Accenture","time":"16 hours ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"<br>Job Description<br><strong>About Accenture: </strong>Accenture is a leading global professional services company, providing a broad range of services in strategy and consulting, interactive, technology and operations, with digital capabilities across all of these services. We combine unmatched experience and specialized capabilities across more than 40 industries — powered by the world’s largest network of Advanced Technology and Intelligent Operations centers. With 513,000 people serving clients in more than 120 countries, Accenture brings continuous innovation to help clients improve their performance and create lasting value across their enterprises. Visit us at <ul><br><li><strong>Project Role :</strong>Application Developer</li><li><strong>Project Role Description :</strong>Design, build and configure applications to meet business process and application requirements.</li><li><strong>Management Level :</strong>10</li><li><strong>Work Experience :</strong>4-6 years</li><li><strong>Work location :</strong>Bengaluru</li><li><strong>Must Have Skills :</strong>Microsoft Teams Development</li><li><strong>Good To Have Skills :</strong>Node.js</li><li><strong>Job Requirements : </strong><ul><br><li><strong>Key Responsibilities : </strong>1 Developing and deploying Teams App for small, medium and large enterprise 2 Designing and Coding of Complex custom Microsoft Team Apps 3 Understanding of Microsoft Teams Platform and advise when and how new MS Teams components should be leveraged to address business requirements</li><br><li><strong>Technical Experience : </strong>1 Experience on Microsoft Teams and SharePoint online 2 Experience on Microsoft Power automate Office 365 is an added advantage 3 Designing and Coding of custom Microsoft Team Apps 4 Coding of custom Microsoft Teams App using C or Node JS 5 Experience of Java frameworks like AngularJS, React JS Knockout JS 6 Experience of ASPNET 35 and above, Microsoft Graph API, HTML 5, CSS 7 Experience of Microsoft Graph API, HTML 5, CSS</li><br><li><strong>Professional Attributes : </strong>1 Have outstanding verbal communications skills 2 Have good client expectation management and presentation skills 3 Ability to build expertise of other people 4 Should have good problem solving and analytical skills</li><br><li><strong>Educational Qualification : </strong>Full time 15 years of regular education</li><br><li><strong>Additional Information : </strong>Experience on Microsoft Power Apps Office 365 is an added advantage</li></ul></li></ul><br>Qualifications<br>15 years of full time education "},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637753&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Microsoft Teams Development Application Developer","companyName":"Accenture","time":"16 hours ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"<br>Job Description<br><strong>About Accenture: </strong>Accenture is a leading global professional services company, providing a broad range of services in strategy and consulting, interactive, technology and operations, with digital capabilities across all of these services. We combine unmatched experience and specialized capabilities across more than 40 industries — powered by the world’s largest network of Advanced Technology and Intelligent Operations centers. With 513,000 people serving clients in more than 120 countries, Accenture brings continuous innovation to help clients improve their performance and create lasting value across their enterprises. Visit us at <ul><br><li><strong>Project Role :</strong>Application Developer</li><li><strong>Project Role Description :</strong>Design, build and configure applications to meet business process and application requirements.</li><li><strong>Management Level :</strong>9</li><li><strong>Work Experience :</strong>6-8 years</li><li><strong>Work location :</strong>Bengaluru</li><li><strong>Must Have Skills :</strong>Microsoft Teams Development</li><li><strong>Good To Have Skills :</strong>Node.js</li><li><strong>Job Requirements : </strong><ul><br><li><strong>Key Responsibilities : </strong>1 Ability of designing, developing and deploying complex Teams App for small, medium and large enterprise 2 Designing and Coding of Complex custom Microsoft Team Apps 3 Understanding of Microsoft Teams Platform and advise when and how new MS Teams components should be leveraged to address business requirements 4 Identify, understand, define and evangelize best practices in technology 5 Define needed governance standards, principles, and guard rails to meet development best practices, data govern</li><br><li><strong>Technical Experience : </strong>1 Experience on Microsoft Teams and SharePoint online 2 Experience on Microsoft Power automate Office 365 is an added advantage 3 Ability of designing, developing and deploying complex Teams App for small, medium and large enterprise 4 Designing and Coding of Complex and Very Complex custom Microsoft Team Apps 5 Coding of custom Microsoft Teams App using C or Node JS 6 Experience of Java frameworks like AngularJS, React JS Knockout JS 7 Experience of ASPNET 35 and above, Microsoft Graph API,</li><br><li><strong>Professional Attributes : </strong>1 Have outstanding verbal communications skills 2 Have good client expectation management and presentation skills 3 Ability to build expertise of other people 4 Should have good problem solving and analytical skills</li><br><li><strong>Educational Qualification : </strong>Full time 15 years of regular education</li><br><li><strong>Additional Information : </strong>Experience on Microsoft Power Apps Office 365 is an added advantag</li></ul></li></ul><br>Qualifications<br>15 years of full time education "},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637749&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"React.js Application Developer","companyName":"Accenture","time":"16 hours ago","location":"Hyderabad / Secunderabad","area":null,"country":"India","description":""},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637432&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Front Office ","companyName":"Js It Tech Solutions","time":"19 hours ago","location":"Hyderabad / Secunderabad","area":null,"country":"India","description":"Hi All,<br>GREETINGS FROM JS IT TECH SOLUTIONS!<br>We have an urgent requirement for Front Office.<br>Position: Front Office<br>Experience: 1-2 yrs.<br>Location: Hyderabad<br>Notice Period: Immediate<br>Required: Females only<br>Job Description:<br>•\tGood Looking and good communication skills.<br>Contact us: [HIDDEN TEXT] // [HIDDEN TEXT] // 9004049457<br>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637431&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Tele Caller ","companyName":"Js It Tech Solutions","time":"19 hours ago","location":"Hyderabad / Secunderabad","area":null,"country":"India","description":""},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637421&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Mobile Application Developer ","companyName":"Js It Tech Solutions","time":"19 hours ago","location":"Hyderabad / Secunderabad","area":null,"country":"India","description":"Hi All,<br>GREETINGS FROM JS IT TECH SOLUTIONS!<br>We have an urgent requirement for Mobile App Developer<br>Position:Mobile App Developer<br>Exp:4-6 years<br>Notice period:Immediate to 15 days<br>Location: Hyderabad<br>Job Description:<br>SKILLS:<br>•\tHighly proficient with Ionic, Angular, Java Spring along with angular or react or Vue.js or flutter (any two of these skills), AWS or Azure, Kafka.<br>•\tExperience with Mobile App specifically hybrid model, MySQL, NoSQL<br>•\tGood exposure on scalable platform development<br>•\tExperience with agile methodologies<br>Contact : [HIDDEN TEXT]/ [HIDDEN TEXT]// 7893797028<br>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637416&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"PHP Laravel AngularJs Developer","companyName":"Jupiter Consulting","time":"20 hours ago","location":"Pune","area":null,"country":"India","description":""},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637403&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"PHP Web Developer","companyName":"BitsNPixs Technologies Pvt. Ltd. ","time":"20 hours ago","location":"Nagercoil, Thiruvananthapuram / Trivandrum","area":null,"country":"India","description":"• Should be well versed with latest Laravel framework.<br>• Experience in Object oriented PHP programming, Understanding of MVC design patterns.<br>• Experience in web fundamentals HTML, JS, CSS and AJAX.<br>• Familiarity with front-end libraries and framework like jQuery, React, VueJs.<br>• Should be familiar with Git version control"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637390&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"React Native Developer","companyName":"Hucon Solutions India Private Limited","time":"21 hours ago","location":"Hyderabad / Secunderabad","area":null,"country":"India","description":"Proficiency Level: Highly skilled at React Native with around 2-3 years experience of writing React native based Mobile Applications.<br>Strong analytical, problem solving, organisational, and detail oriented skills<br>Must be able to work both on a team or individually, in an adaptable, agile environment<br>Excellent communication skills"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637373&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Software Engineering","companyName":"JP Morgan Chase &amp; Co.","time":"a day ago","location":"Hyderabad / Secunderabad","area":null,"country":"India","description":"<br>Job Description :<br>As a member of our Software Engineering Group, we look first and foremost for people who are passionate around solving business problems through innovation and engineering practices. You'll be required to apply your depth of knowledge and expertise to all aspects of the software development lifecycle, as well as partner continuously with your many stakeholders on a daily basis to stay focused on common goals. We embrace a culture of experimentation and constantly strive for improvement and learning. You’ll work in a collaborative, trusting, thought-provoking environment—one that encourages diversity of thought and creative solutions that are in the best interests of our customers globally.<br>This role requires a wide variety of strengths and capabilities, including:<br><strong>Roles and Responsibilities</strong><ul><li>Designs, analyzes, develops automation framework/scripts, tests, debugs and documents programming to satisfy business requirements</li><li>Utilize excellent organizational skills, proven analytical, planning, problem solving and decision-making skills.</li><li>Ability to work proficiently and effectively in an Agile / Scrum feature team environment</li><li>Provide support to the application in terms of analyzing testing issues, maintaining the regression suite, build test data and build tests as per the acceptance criteria</li><li>Research new technologies, identify and learn best practice, adapt quickly and provide technical guidance to other team members</li><li>Adapt Devops model of continuous and automated integration, test and delivery</li><li>Work with multiple globally distributed teams to deliver end-to-end solution across regions</li></ul><br><strong>Required Skills</strong><ul><li>B.E/B.Tech/MCA degree</li><li>6+years Hands-on experience in designing and developing automation framework for Web based applications, APIs, etc</li><li>Comfortable in bothDevelopment andAutomation experience and sound knowledge in Java, Selenium, Cucumber, Maven, RestAssured, Chromium</li><li>2+ years of experience on testing applications withUI technologies such as Angular JS, React etc.</li><li>2+ year experience in designing automation scripts using BDD approach</li><li>2+ years of experience in working within an Agile team doing in-sprint automation development and managing integration scripts</li><li>Should have hands-on experience in using tools (or similar) like IntelliJ, Eclipse, GIT/BitBucket, BitBucket/Git/Gitflow and JIRA.</li><li>2+ years of experience onwriting complex SQL queries</li><li>Hands-on experience with all the levels of testing including Smoke, Usability, Functional, Integration, Regression, Re-testing, User Acceptance and System Testing.</li><li>Experience in developing tests for Windows as well as UNIX or LINUX environment.</li><li>Strong Team player abilities and Quick Learner, enthusiastic to learn new concepts and technologies.</li><li>Good communication skills</li><li>Good analytical skills for effective problem solving</li></ul><br><strong>Good to have skills</strong><ul><li>Experience in tools such as Jenkins</li><li>Awareness of using SQL, XML message formats is a plus.</li><li>Awareness of Cloud concepts</li></ul>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637365&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Software Engineering","companyName":"JP Morgan Chase &amp; Co.","time":"a day ago","location":"Hyderabad / Secunderabad","area":null,"country":"India","description":"<br>Job Description :<br>As a member of our Software Engineering Group, we look first and foremost for people who are passionate around solving business problems through innovation and engineering practices. You'll be required to apply your depth of knowledge and expertise to all aspects of the software development lifecycle, as well as partner continuously with your many stakeholders on a daily basis to stay focused on common goals. We embrace a culture of experimentation and constantly strive for improvement and learning. You’ll work in a collaborative, trusting, thought-provoking environment—one that encourages diversity of thought and creative solutions that are in the best interests of our customers globally.<br>This role requires a wide variety of strengths and capabilities, including:<br><strong>Roles and Responsibilities</strong><ul><li>Designs, analyzes, develops automation framework/scripts, tests, debugs and documents programming to satisfy business requirements</li><li>Utilize excellent organizational skills, proven analytical, planning, problem solving and decision-making skills.</li><li>Ability to work proficiently and effectively in an Agile / Scrum feature team environment</li><li>Provide support to the application in terms of analyzing testing issues, maintaining the regression suite, build test data and build tests as per the acceptance criteria</li><li>Research new technologies, identify and learn best practice, adapt quickly and provide technical guidance to other team members</li><li>Adapt Devops model of continuous and automated integration, test and delivery</li><li>Work with multiple globally distributed teams to deliver end-to-end solution across regions</li></ul><br><strong>Required Skills</strong><ul><li>B.E/B.Tech/MCA degree</li><li>6+years Hands-on experience in designing and developing automation framework for Web based applications, APIs, etc</li><li>Comfortable in bothDevelopment andAutomation experience and sound knowledge in Java, Selenium, Cucumber, Maven, RestAssured, Chromium</li><li>2+ years of experience on testing applications withUI technologies such as Angular JS, React etc.</li><li>2+ year experience in designing automation scripts using BDD approach</li><li>2+ years of experience in working within an Agile team doing in-sprint automation development and managing integration scripts</li><li>Should have hands-on experience in using tools (or similar) like IntelliJ, Eclipse, GIT/BitBucket, BitBucket/Git/Gitflow and JIRA.</li><li>2+ years of experience onwriting complex SQL queries</li><li>Hands-on experience with all the levels of testing including Smoke, Usability, Functional, Integration, Regression, Re-testing, User Acceptance and System Testing.</li><li>Experience in developing tests for Windows as well as UNIX or LINUX environment.</li><li>Strong Team player abilities and Quick Learner, enthusiastic to learn new concepts and technologies.</li><li>Good communication skills</li><li>Good analytical skills for effective problem solving</li></ul><br><strong>Good to have skills</strong><ul><li>Experience in tools such as Jenkins</li><li>Awareness of using SQL, XML message formats is a plus.</li><li>Awareness of Cloud concepts</li></ul>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637366&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Software Engineering","companyName":"JP Morgan Chase &amp; Co.","time":"a day ago","location":"Hyderabad / Secunderabad","area":null,"country":"India","description":"<br>Job Description :<br>As a member of our Software Engineering Group we look first and foremost for people who are passionate around solving business problems through innovation &amp; engineering practices. You will be required to apply your depth of knowledge and expertise to all aspects of the software development lifecycle, as well as partner continuously with your many stakeholders on a daily basis to stay focused on common goals. We embrace a culture of experimentation and constantly strive for improvement and learning. You’ll work in a collaborative, trusting, thought-provoking environment—one that encourages diversity of thought and creative solutions that are in the best interests of our customers globally.<br>This role requires a wide variety of strengths and capabilities, including: <ul><li>Advanced knowledge of application, data and infrastructure architecture disciplines</li><li>Understanding of architecture and design across all systems</li><li>Working proficiency in developmental toolsets</li><li>Ability to collaborate with high-performing teams and individuals throughout the firm to accomplish common goals</li><li>Proficiency in one or more general purpose programming languages Java/J2EE, Web Service, Cloud, Micro service, Spring Boot, Kafka</li><li>Understanding of software skills such as business analysis, development, maintenance and software improvement</li><li>8 to 10+ Years of Experience in developing, deploying and administering Java applications using JAVA, Spring Boot, Spring Cloud and Web services technologies (REST and SOAP)</li><li>2+ years of experience in Micro service Architecture, Kafka, Pivotal Cloud Foundry or any cloud experience</li><li>6+ years of experience in Java spring, Java Spring MVC, Spring Batch, Spring JPA, React JS, Angular JS, Hibernate, Web services, HTML5, JavaScript, CSS, XML, JQuery, Rest API, GIT, Tomcat, Websphere.</li><li>Experience in application development, including analyzing stories, writing code, implementing automated tests, contributing to release and developing the working practices of the team</li><li>Experience of Agile team working and globally deployed applications working across a Wide Area Network</li><li>Must have experience in developing performance intensive, high availability applications using Kafka, Cassandra, PCF/eHcache etc.</li><li>Candidate should have a strong Infrastructure Architecture understanding with experience with virtualization technologies is a plus.</li><li>Hands on experience with web technologies (e.g. HTTP, XML, REST, HTML, etc)</li><li>Hands on with development and test automation tools/frameworks (e.g. Cucumber/Gherkin, Selenium Grid, Junit, SOAPUI, Eclipse, Jenkins, CA-Lisa, Ant, Maven, Visual Studio, HP ALM/QTP, JIRA, etc)</li><li>Good understanding of Software development lifecycle and agile methodologies</li><li>Good understanding and working experience on TDD, BDD and Shift Left concepts</li><li>Understanding of Database schemas and SQL queries a must</li></ul><br><strong>General Qualifications:</strong><ul><li>B.E/B.Tech degree or equivalent experience</li><li>Overall relevant industry experience of 10+ years</li><li>Excellent organization and communication skills (written, oral and presentation) is must</li><li>Must have full life-cycle experience in large, global multi-tiered systems, preferably in the financial industry</li><li>Excellent interpersonal relationship and communication / presentation skills</li><li>Strong technical documentation skills</li><li>Demonstrates initiative and is a self-starter</li><li>Prepared to challenge when business requirements seem conflicting</li><li>Drive/Determination and knowledge.</li></ul><br><strong>Professional Skills:</strong><br>The behavioral requirements of this role are as follows:- <ul><li>Excellent process discipline in project execution.</li><li>High level of personal commitment to each task, a can do attitude and a drive to deliver.</li><li>Strong communication skills to be able to communicate at all levels.</li><li>High level of responsibility and Ownership from inception through to implementation.</li><li>The candidate should have a proactive approach to problem solving.</li><li>Good analysis skills in order to aid in trouble shooting and problem solving</li></ul>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637359&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Software Engineering","companyName":"JP Morgan Chase &amp; Co.","time":"a day ago","location":"Mumbai","area":null,"country":"India","description":"<br>Job Description :<br>As a member of our Software Engineering Group we look first and foremost for people who are passionate around solving business problems through innovation &amp; engineering practices. You will be required to apply your depth of knowledge and expertise to all aspects of the software development lifecycle, as well as partner continuously with your many stakeholders on a daily basis to stay focused on common goals. We embrace a culture of experimentation and constantly strive for improvement and learning. You’ll work in a collaborative, trusting, thought-provoking environment—one that encourages diversity of thought and creative solutions that are in the best interests of our customers globally.<br>This role requires a wide variety of strengths and capabilities, including: <ul><li>Advanced knowledge of application, data and infrastructure architecture disciplines</li><li>Understanding of architecture and design across all systems</li><li>Working proficiency in developmental toolsets</li><li>Ability to collaborate with high-performing teams and individuals throughout the firm to accomplish common goals</li><li>Proficiency in one or more general purpose programming languages Java/J2EE, Web Service, Cloud, Micro service, Spring Boot, Kafka</li><li>Understanding of software skills such as business analysis, development, maintenance and software improvement</li><li>8 to 10+ Years of Experience in developing, deploying and administering Java applications using JAVA, Spring Boot, Spring Cloud and Web services technologies (REST and SOAP)</li><li>2+ years of experience in Micro service Architecture, Kafka, Pivotal Cloud Foundry or any cloud experience</li><li>6+ years of experience in Java spring, Java Spring MVC, Spring Batch, Spring JPA, React JS, Angular JS, Hibernate, Web services, HTML5, JavaScript, CSS, XML, JQuery, Rest API, GIT, Tomcat, Websphere.</li><li>Experience in application development, including analyzing stories, writing code, implementing automated tests, contributing to release and developing the working practices of the team</li><li>Experience of Agile team working and globally deployed applications working across a Wide Area Network</li><li>Must have experience in developing performance intensive, high availability applications using Kafka, Cassandra, PCF/eHcache etc.</li><li>Candidate should have a strong Infrastructure Architecture understanding with experience with virtualization technologies is a plus.</li><li>Hands on experience with web technologies (e.g. HTTP, XML, REST, HTML, etc)</li><li>Hands on with development and test automation tools/frameworks (e.g. Cucumber/Gherkin, Selenium Grid, Junit, SOAPUI, Eclipse, Jenkins, CA-Lisa, Ant, Maven, Visual Studio, HP ALM/QTP, JIRA, etc)</li><li>Good understanding of Software development lifecycle and agile methodologies</li><li>Good understanding and working experience on TDD, BDD and Shift Left concepts</li><li>Understanding of Database schemas and SQL queries a must</li></ul><br><strong>General Qualifications:</strong><ul><li>B.E/B.Tech degree or equivalent experience</li><li>Overall relevant industry experience of 10+ years</li><li>Excellent organization and communication skills (written, oral and presentation) is must</li><li>Must have full life-cycle experience in large, global multi-tiered systems, preferably in the financial industry</li><li>Excellent interpersonal relationship and communication / presentation skills</li><li>Strong technical documentation skills</li><li>Demonstrates initiative and is a self-starter</li><li>Prepared to challenge when business requirements seem conflicting</li><li>Drive/Determination and knowledge.</li></ul><br><strong>Professional Skills:</strong><ul><li>The behavioral requirements of this role are as follows:-</li><li>Excellent process discipline in project execution.</li><li>High level of personal commitment to each task, a can do attitude and a drive to deliver.</li><li>Strong communication skills to be able to communicate at all levels.</li><li>High level of responsibility and Ownership from inception through to implementation.</li><li>The candidate should have a proactive approach to problem solving.</li><li>Good analysis skills in order to aid in trouble shooting and problem solving</li></ul>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637144&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Software Engineer","companyName":"Wells Fargo","time":"a day ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"<br>Job Description :<br>About Wells Fargo<br>Wells Fargo &amp; Company (NYSE: WFC) is a leading global financial services company headquartered in San Francisco (United States). Wells Fargo has offices in over 30 countries and territories. Our business outside of the U.S. mostly focuses on providing banking services for large corporate, government and financial institution clients. We have worldwide expertise and services to help our customers improve earnings, manage risk, and develop opportunities in the global marketplace. Our global reach offers many opportunities for you to develop a career with Wells Fargo. Join our diverse and inclusive team where you will feel valued and inspired to contribute your unique skills and experience. We are looking for talented people who will put our customers at the center of everything we do. Help us build a better Wells Fargo. It all begins with outstanding talent. It all begins with you.<br>Market Job Description<br><strong>About Wells Fargo India<br></strong><br>Wells Fargo India enables global talent capabilities for Wells Fargo Bank NA., by supporting business lines and staff functions across Technology, Business Services, Risk Services and Product, Analytics and Modeling (PAM). We are operating in Hyderabad, Bengaluru and Chennai locations.<br><strong>Department Overview<br></strong><br>Payments, Virtual Solutions, and Innovation /Community Bank Technology within the Enterprise Information Technology business provides strategic technology solutions to the both the PVSI and Community Banking lines of business, including application design, development, and support.<br><strong>About the Role<br></strong><br>Need to play Senior Developer role that expected to perform front end and back end related design, development and maintenance activities for DAT applications in DODCT area in C&amp;SBBT. Candidate needs to work with US partner teams and it demands to be available as per the delivery timelines<br><strong>Responsibilities<br></strong><br><li><br>Works with diverse group of developers, business subject matter experts, project management from multiple teams with assertiveness and tact</li><li><br>Play a technical lead role (coding, code reviews, design reviews, internal testing sign off etc.) for deliverables from WFI.</li><li><br>Technical point of contact for all technical issues and partner with the team to analyze, investigate and resolve open issues, vulnerabilities, secure coding etc.</li><li><br>Contribute to the design discussions, contribute towards design discussions, perform PoCs where ever required to support/back up design decisions.</li><li><br>Provide technical expertise to support team during incident/problem resolution.</li><li><br>Ability e to monitor and analyze production application logs<br>Ability to do the reviews and follow the process methodologies and documentation</li><br><strong>Essential Qualifications<br></strong><br><li><br>Bachelor's/Master’s degree in Computer Science or equivalent</li><li><br>8-12 yrs. of hands-on IT experience in developing complex, highly integrated, web-based applications using Java/J2EE,Spring web services, Micro services, Spring MVC, Spring boot, Hibernate and worked in Agile teams.</li><li><br>Should have strong work experience in UI tech stack - HTML5, JavaScript(ES5 &amp; ES6) ,Object oriented JavaScript, Ajax, JSON, , Angular/React JS frameworks and Responsive web development. </li><li><br>Knowledge working with GIT, Maven/Gradle , JIRA tools</li><li><br>Experience in implementation of Java, J2EE and JS Design patterns.</li><li><br>Hands-on experience in MSSQL / Oracle databases </li><li><br>Experience in writing unit cases using Junit, Mocha/Jasmine/Jest libraries.</li><li><br>Should be able to deploy the application in non-production environments on Linux platforms.</li><li><br>Experience in Agile methodology</li><br><strong>Desired Qualifications<br></strong><br><li><br>Good verbal and written communication skills</li><li><br>Good problem solving and analytical skills</li><li><br>Should be detail oriented, able to multi task</li><br><strong>Nice to Have - Skills: </strong><br><li><br>Experience in PLSQL and other DB concepts are added advantage.</li><li><br>Banking Applications experience.</li><br>We Value Diversity<br>At Wells Fargo, we believe in diversity and inclusion in the workplace; accordingly, we welcome applications for employment from all qualified candidates, regardless of race, color, gender, national or ethnic origin, age, disability, religion, sexual orientation, gender identity or any other status protected by applicable law. We comply with all applicable laws in every jurisdiction in which we operate."},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637200&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Application Developer: Experience Front End","companyName":"IBM","time":"a day ago","location":"Chennai","area":null,"country":"India","description":"<br>Job Description :<br>Introduction<br>As an Application Developer, you will lead IBM into the future by translating system requirements into the design and development of customized systems in an agile environment. The success of IBM is in your hands as you transform vital business needs into code and drive innovation. Your work will power IBM and its clients globally, collaborating and integrating code into enterprise systems. You will have access to the latest education, tools and technology, and a limitless career path with the world’s technology leader. Come to IBM and make a global impact!<br>Your Role and Responsibilities<br><strong><br>Who you are: </strong><li><br>As Application Developer, you are responsible to develop applications in Experience Front End. </li><strong><br>What you’ll do: </strong><li><br>Develop prototypes and performs hands-on coding to develop and integrate the application user interface.</li><li><br>Translate graphic visual and interactive designs into the presentation layer for highly interactive web and mobile applications using responsive design and development techniques.</li><li><br>Independently plans installs, integrates and validates systems software and hardware solutions.</li><li><br>Leads technical change implementation across environments. Acquires and applies broad knowledge of the business, its products, and processes.</li><li><br>Resolves issues and navigates obstacles to deliver work product.</li><strong><br>How we’ll help you grow:</strong><li><br>You’ll have access to all the technical and management training courses to become the expert you want to be</li><li><br>You’ll learn directly from experienced developers in the field, our team leads love to mentor</li><li><br>You have the opportunity to work in many different areas to figure out what really excites you.</li><br>Required Technical and Professional Expertise<br><li><br>Minimum 6+ years of experience in development using Angular JS 2.0.</li><li><br>Experience in Hypertext Markup Language Revision 5 (HTML5), Cascading Style Sheets (CSS) and ReactJS (javascript)</li><br>Preferred Technical and Professional Expertise<br><li><br>Working knowledge in ES6, React, Redux, React Router, Udesign, art, typography and photography is highly desired</li><li><br>Ambitious individual who can work under their own direction towards agreed targets/goals.</li><li><br>Ability to manage change and be open to it good time management and an ability to work under stress</li><li><br>Proven interpersonal skills while contributing to team effort by accomplishing related results as needed</li><li><br>Maintain technical knowledge by attending educational workshops, reviewing publications</li><br>About Business Unit<br>IBM Services is a team of business, strategy and technology consultants that design, build, and run foundational systems and services that is the backbone of the world's economy. IBM Services partners with the world's leading companies in over 170 countries to build smarter business by reimagining and reinventing through technology, with its outcome-focused methodologies, industry-leading portfolio and world class research and operations expertise leading to results-driven innovation and enduring excellence.<br>Your Life @ IBM<br>What matters to you when you’re looking for your next career challenge?<br>Maybe you want to get involved in work that really changes the world. What about somewhere with incredible and diverse career and development opportunities – where you can truly discover your passion? Are you looking for a culture of openness, collaboration and trust – where everyone has a voice? What about all of these? If so, then IBM could be your next career challenge. Join us, not to do something better, but to attempt things you never thought possible.<br>Impact. Inclusion. Infinite Experiences. Do your best work ever.<br>About IBM<br>IBM’s greatest invention is the IBMer. We believe that progress is made through progressive thinking, progressive leadership, progressive policy and progressive action. IBMers believe that the application of intelligence, reason and science can improve business, society and the human condition. Restlessly reinventing since 1911, we are the largest technology and consulting employer in the world, with more than 380,000 IBMers serving clients in 170 countries.<br>Location Statement<br>For additional information about location requirements, please discuss with the recruiter following submission of your application.<br>Being You @ IBM<br>IBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.<br>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637199&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Application Developer: Java Full Stack","companyName":"IBM","time":"a day ago","location":"Hyderabad / Secunderabad","area":null,"country":"India","description":"<br>Job Description :<br>Introduction<br>As an Application Developer, you will lead IBM into the future by translating system requirements into the design and development of customized systems in an agile environment. The success of IBM is in your hands as you transform vital business needs into code and drive innovation. Your work will power IBM and its clients globally, collaborating and integrating code into enterprise systems. You will have access to the latest education, tools and technology, and a limitless career path with the world’s technology leader. Come to IBM and make a global impact!<br>Your Role and Responsibilities<br><strong><br>Your day in the role will include...</strong><br><li><br>Expert in Backend and Front end technologies</li><li><br>Proven in developing and implementation and providing solutions to the given problem in all the Java technologies</li><li><br>Proficient in stitch together end to end application starting from front end web development, back end development, middleware integration and persisting data in no SQL or DBMS database </li><li><br>Strong into trends and directions of the Industry, marketplace and the players</li><li><br>Provide objective guidance without personal or political considerations </li><strong><br>You will come with...</strong><br><li><br>Hands on experience with JAVA 8 and above – Java 8 or higher. Should know both Spring and Hibernate. Spring 4 or above.</li><li><br>Should be experienced in OOP concepts well. Should be proficient in exception handling , collections, Abstract Classes and Interfaces, Constructors, File IO and Serialization, Collections (List, Map, Set), Access Specifiers, Exceptions (Checked, Unchecked), Generics, Java Keywords (Static, Final, Volatile, Synchronized, Transient), JVM and Memory Management, Multithreading and Synchronization, JSP/ Servlets,JMS . Should be skilled in one of the IDEs like Eclipse , IntelliJ. Should be conversant with Build tools like Ant , Maven.</li><li><br>Experience of working in HTML 5 , CSS3, Angular JS, Spring MVC, Spring Boot, REST API, JUnit </li><strong><br>How we’ll help you grow: </strong><br><li><br>You’ll have access to all the technical and management training courses that will help you</li><li><br>You’ll learn directly from guide developers in the field; our team leads love to mentor</li><li><br>You have the opportunity to work in many different areas to identify what really excites you</li><br>Required Technical and Professional Expertise<br><li><br>Java 8 , JEE, Spring Core, Spring Boot, Spring MVC, REST , Hibernate, Angular JS , Node JS, CSS3 , HTML5, Any RDBMS database (DB2, Postgre, MYSQL, Oracle etc.) and Sql knowledge , Git , Maven, Eclipse / Intellij, Design Patterns</li><br>Preferred Technical and Professional Expertise<br>• Microservices , Docker, Spring Cloud, GW<br>About Business Unit<br>IBM Services is a team of business, strategy and technology consultants that design, build, and run foundational systems and services that is the backbone of the world's economy. IBM Services partners with the world's leading companies in over 170 countries to build smarter business by reimagining and reinventing through technology, with its outcome-focused methodologies, industry-leading portfolio and world class research and operations expertise leading to results-driven innovation and enduring excellence.<br>Your Life @ IBM<br>What matters to you when you’re looking for your next career challenge?<br>Maybe you want to get involved in work that really changes the world. What about somewhere with incredible and diverse career and development opportunities – where you can truly discover your passion? Are you looking for a culture of openness, collaboration and trust – where everyone has a voice? What about all of these? If so, then IBM could be your next career challenge. Join us, not to do something better, but to attempt things you never thought possible.<br>Impact. Inclusion. Infinite Experiences. Do your best work ever.<br>About IBM<br>IBM’s greatest invention is the IBMer. We believe that progress is made through progressive thinking, progressive leadership, progressive policy and progressive action. IBMers believe that the application of intelligence, reason and science can improve business, society and the human condition. Restlessly reinventing since 1911, we are the largest technology and consulting employer in the world, with more than 380,000 IBMers serving clients in 170 countries.<br>Location Statement<br>For additional information about location requirements, please discuss with the recruiter following submission of your application.<br>Being You @ IBM<br>IBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.<br>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637202&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Application Developer: Microsoft .NET","companyName":"IBM","time":"a day ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"<br>Job Description :<br>Introduction<br>As an Application Developer, you will lead IBM into the future by translating system requirements into the design and development of customized systems in anagile environment. The success of IBM is in your hands as you transform vital business needs into code and drive innovation. Your work will power IBM and its clients globally, collaborating and integrating code into enterprise systems. You will have access to the latest education, tools and technology, and a limitless career path with the world’s technology leader. Come to IBM and make a global impact!<br>Your Role and Responsibilities<br>IBM's Purpose is to be essential to our clients, to the world and one another and we are confident that together as IBMers we will drive this purpose. When you join IBM you join a culture of openness, collaboration, trust, and the invitation and expectation to have a voice. Join us and Do your Best Work Ever.<br>We are recognized gold standard for inclusion, reflected in winning, to name a few, the 2018 Catalyst Award for advancing women in business, the National Award Best Employer of People with Disabilities and being named one of the top 5 2018 Top Companies for Women Technologists for building an inclusive workplace — We advocate for fairness and equality as everyone is, and always has been, welcome at IBM.<br>We at IBM Global Business Services (GBS) are a dynamic group of Business, Strategy and Technology professionals - a specific source of best-in-class Industry Consulting, Application and Business process management, supported by the industry's most sophisticated outcome-based delivery model. All designed to be the Digital Reinvention partner for leading clients across the world - providing value-led and asset-powered end to end solutions.<br>With a global footprint in over 170 countries, we are empowering clients to build upon their tremendous heritage in Application Innovation processes and also transform them to a Cloud, Cognitive and Social centric world. With skills across six sectors and 17 industries, all major service lines and competencies, IBM’s GBS is a promising business unit in itself to be a part of.<br>Through our unique global delivery network; IBM offers global expertise coupled with a deep understanding of local capabilities, markets and cultures you could be part of and partner on some great projects with some of the best corporations in the world across geographies.<br><strong><u><br>How we’ll help you grow: </u></strong><li><br>Access to all the technical and management training courses to become the authority you want to be</li><li><br>Learn directly from authority developers in the field; leads who love to mentor.</li><li><br>You have the opportunity to work in many different areas to determine, what really excites you.</li><br>Required Technical and Professional Expertise<br><li><br>Apply knowledge of Business-IT requirements.</li><li><br>Develop program specifications.</li><li><br>Proficient in C#, with a good knowledge of its ecosystems.</li><br>Perform application testing activities writing unit test case<br><li><br>Understanding of object-oriented programming</li><li><br>Should have knowledge on Application Development Methodologies &amp; tools</li><br>Experience with popular web application frameworks<br><li><br>Should have proven knowledge on Programming Languages (C#.NET 2.0 and Above)</li><li><br>Proficient in any one: Web (OOPs, Asp.Net, MVC 1-6, Jquery/JScript/Angular Js, Web API, Web service/WCF, Redux JS, HTML</li><li><br>Proficient understanding of code versioning tools such as Git, SVN, and Mercurial</li><br>Preferred Technical and Professional Expertise<br><li><br>C#.NET 3.5/4.0/4.5</li><li><br>Naming Conventional Practice</li><li><br>Migration Strategy from low version to high version</li><li><br>Migration Specific tool(s)</li><li><br>Basic understanding of Common Language Runtime (CLR), its limitations, weaknesses, and workaround</li><br>About Business Unit<br>IBM Services is a team of business, strategy and technology consultants that design, build, and run foundational systems and services that is the backbone of the world's economy. IBM Services partners with the world's leading companies in over 170 countries to build smarter businesses by reimagining and reinventing through technology, with its outcome-focused methodologies, industry-leading portfolio and world class research and operations expertise leading to results-driven innovation and enduring excellence.<br>Your Life @ IBM<br>What matters to you when you’re looking for your next career challenge?<br>Maybe you want to get involved in work that really changes the world? What about somewhere with incredible and diverse career and development opportunities – where you can truly discover your passion? Are you looking for a culture of openness, collaboration and trust – where everyone has a voice? What about all of these? If so, then IBM could be your next career challenge. Join us, not to do something better, but to attempt things you never thought possible.<br>Impact. Inclusion. Infinite Experiences. Do your best work ever.<br>About IBM<br>IBM’s greatest invention is the IBMer. We believe that progress is made through progressive thinking, progressive leadership, progressive policy and progressive action. IBMers believe that the application of intelligence, reason and science can improve business, society and the human condition. Restlessly reinventing since 1911, we are the largest technology and consulting employer in the world, with more than 380,000 IBMers serving clients in 170 countries.<br>Location Statement<br>For additional information about location requirements, please discuss with the recruiter following submission of your application.<br>Being You @ IBM<br>IBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.<br>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637195&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Package Consultant: Sterling","companyName":"IBM","time":"a day ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"<br>Job Description :<br>Introduction<br>As a Package Consultant at IBM, get ready to tackle numerous mission-critical company directives. Our team takes on the challenge of designing, developing and re-engineering highly complex application components and integrating software packages using various tools. You will use a mix of consultative skills, business knowledge, and technical expertise to effectively integrate packaged technology into our clients business environment and achieve business results.<br>Your Role and Responsibilities<br>As a Package Consultant at IBM, get ready to tackle numerous mission-critical company directives. Our team takes on the challenge of designing, developing and re-engineering highly complex application components and integrating software packages using various tools. You will use a mix of consultative skills, business knowledge, and technical expertise to effectively integrate packaged technology into our clients business environment and achieve business results.<br><strong><br>Responsibilities:</strong><li><br>Participate in the software development, and package implementation using industry standard platforms Sterling</li><li><br>Ensure software developed is held to high quality standards through code and design reviews.</li><li><br>Interface with system integrators and IT engineers on projects to ensure proper adherence to SDLC and platform integrity.</li><br>Required Technical and Professional Expertise<br><li><br>Minimum 4-8 years of experience in IT Industry</li><li><br>Validated knowledge of the various modules in IBM Sterling OMS</li><li><br>Hands-on configuration and development experience using OOTB Sterling APIs in a minimum of one Sterling OMS implementation</li><li><br>Proficient in development of wrapper using Sterling OOTB APIs and configuring them as Sterling services (SDF)</li><li><br>Working knowledge of Sterling Store Web and Sterling Call Center</li><li><br>Customization knowledge of Sterling Store / Call Center web UI will be a huge plus</li><li><br>Ability to create Sterling OMS detailed technical design for business requirements</li><li><br>In-depth experience working with Sterling OMS interfaces with external systems using MQ, JMS</li><li><br>Ability to independently setup a local instance of Sterling OMS for development purpose</li><li><br>Solid understanding of core Java, servlets and web services (ReST &amp; SOAP)</li><li><br>Experience working with XMLs, XSLs and JSON</li><li><br>Working and configuration of any one application server; WAS, Weblogic, JBoss, etc</li><br>Preferred Technical and Professional Expertise<br><li><br>Experience working with Sterling Order Management on Cloud (OM SaaS)</li><li><br>Hands-on knowledge of microservices (Spring, Springboot)</li><li><br>Hands-on experience with UI technologies; Angular JS, React JS, GraphQL</li><li><br>You love collaborative environments that use agile methodologies to encourage creative design thinking and find innovative ways to develop with cutting edge technologies</li><li><br>Ambitious individual who can work under their own direction towards agreed targets/goals and with creative approach to work</li><li><br>Intuitive individual with an ability to manage change and proven time management</li><li><br>Proven interpersonal skills while contributing to team effort by accomplishing related results as needed</li><li><br>Up-to-date technical knowledge by attending educational workshops, reviewing publications</li><li><br>Exposure to one SQL database; DB2, Oracle, MySQL, etc</li><li><br>Basic knowledge of navigating through any one operating system; Linux or Windows</li><li><br>Knowledge of any popular IDE (Eclipse), code repository (SVN, CVS, GitHub)</li><br>About Business Unit<br>IBM Services is a team of business, strategy and technology consultants that design, build, and run foundational systems and services that is the backbone of the world's economy. IBM Services partners with the world's leading companies in over 170 countries to build smarter business by reimagining and reinventing through technology, with its outcome-focused methodologies, industry-leading portfolio and world class research and operations expertise leading to results-driven innovation and enduring excellence.<br>Your Life @ IBM<br>What matters to you when you’re looking for your next career challenge?<br>Maybe you want to get involved in work that really changes the world? What about somewhere with incredible and diverse career and development opportunities – where you can truly discover your passion? Are you looking for a culture of openness, collaboration and trust – where everyone has a voice? What about all of these? If so, then IBM could be your next career challenge. Join us, not to do something better, but to attempt things you never thought possible.<br>Impact. Inclusion. Infinite Experiences. Do your best work ever.<br>About IBM<br>IBM’s greatest invention is the IBMer. We believe that progress is made through progressive thinking, progressive leadership, progressive policy and progressive action. IBMers believe that the application of intelligence, reason and science can improve business, society and the human condition. Restlessly reinventing since 1911, we are the largest technology and consulting employer in the world, with more than 380,000 IBMers serving clients in 170 countries.<br>Location Statement<br>For additional information about location requirements, please discuss with the recruiter following submission of your application.<br>Being You @ IBM<br>IBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.<br>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637192&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Application Developer: Java Full Stack","companyName":"IBM","time":"a day ago","location":"Pune","area":null,"country":"India","description":"<br>Job Description :<br>Introduction<br>As an Application Developer, you will lead IBM into the future by translating system requirements into the design and development of customized systems in an agile environment. The success of IBM is in your hands as you transform vital business needs into code and drive innovation. Your work will power IBM and its clients globally, collaborating and integrating code into enterprise systems. You will have access to the latest education, tools and technology, and a limitless career path with the world’s technology leader. Come to IBM and make a global impact!<br>Your Role and Responsibilities<br><strong><br>Your day in the role will include...</strong><br><li><br>Expert in Backend and Front end technologies</li><li><br>Proven in developing and implementation and providing solutions to the given problem in all the Java technologies</li><li><br>Proficient in stitch together end to end application starting from front end web development, back end development, middleware integration and persisting data in no SQL or DBMS database </li><li><br>Strong into trends and directions of the Industry, marketplace and the players</li><li><br>Provide objective guidance without personal or political considerations </li><strong><br>You will come with...</strong><br><li><br>Hands on experience with JAVA 8 and above – Java 8 or higher. Should know both Spring and Hibernate. Spring 4 or above.</li><li><br>Should be experienced in OOP concepts well. Should be proficient in exception handling , collections, Abstract Classes and Interfaces, Constructors, File IO and Serialization, Collections (List, Map, Set), Access Specifiers, Exceptions (Checked, Unchecked), Generics, Java Keywords (Static, Final, Volatile, Synchronized, Transient), JVM and Memory Management, Multithreading and Synchronization, JSP/ Servlets,JMS . Should be skilled in one of the IDEs like Eclipse , IntelliJ. Should be conversant with Build tools like Ant , Maven.</li><li><br>Experience of working in HTML 5 , CSS3, Angular JS, Spring MVC, Spring Boot, REST API, JUnit </li><strong><br>How we’ll help you grow: </strong><br><li><br>You’ll have access to all the technical and management training courses that will help you</li><li><br>You’ll learn directly from guide developers in the field; our team leads love to mentor</li><li><br>You have the opportunity to work in many different areas to identify what really excites you</li><br>Required Technical and Professional Expertise<br><li><br>Java 8 , JEE, Spring Core, Spring Boot, Spring MVC, REST , Hibernate, Angular JS , Node JS, CSS3 , HTML5, Any RDBMS database (DB2, Postgre, MYSQL, Oracle etc.) and Sql knowledge , Git , Maven, Eclipse / Intellij, Design Patterns</li><br>Preferred Technical and Professional Expertise<br>• Microservices , Docker, Spring Cloud, GW<br>About Business Unit<br>IBM Services is a team of business, strategy and technology consultants that design, build, and run foundational systems and services that is the backbone of the world's economy. IBM Services partners with the world's leading companies in over 170 countries to build smarter business by reimagining and reinventing through technology, with its outcome-focused methodologies, industry-leading portfolio and world class research and operations expertise leading to results-driven innovation and enduring excellence.<br>Your Life @ IBM<br>What matters to you when you’re looking for your next career challenge?<br>Maybe you want to get involved in work that really changes the world. What about somewhere with incredible and diverse career and development opportunities – where you can truly discover your passion? Are you looking for a culture of openness, collaboration and trust – where everyone has a voice? What about all of these? If so, then IBM could be your next career challenge. Join us, not to do something better, but to attempt things you never thought possible.<br>Impact. Inclusion. Infinite Experiences. Do your best work ever.<br>About IBM<br>IBM’s greatest invention is the IBMer. We believe that progress is made through progressive thinking, progressive leadership, progressive policy and progressive action. IBMers believe that the application of intelligence, reason and science can improve business, society and the human condition. Restlessly reinventing since 1911, we are the largest technology and consulting employer in the world, with more than 380,000 IBMers serving clients in 170 countries.<br>Location Statement<br>For additional information about location requirements, please discuss with the recruiter following submission of your application.<br>Being You @ IBM<br>IBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.<br>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637188&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Application Developer: Experience Front End","companyName":"IBM","time":"a day ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"<br>Job Description :<br>Introduction<br>As an Application Developer, you will lead IBM into the future by translating system requirements into the design and development of customized systems in an agile environment. The success of IBM is in your hands as you transform vital business needs into code and drive innovation. Your work will power IBM and its clients globally, collaborating and integrating code into enterprise systems. You will have access to the latest education, tools and technology, and a limitless career path with the world’s technology leader. Come to IBM and make a global impact!<br>Your Role and Responsibilities<br>As UI Developer you will be responsible for developing and upgrading applications is Experience Front End<br><strong>Responsibilities:</strong><li><br>Develop prototypes and performs hands-on coding to develop and integrate the application user interface.</li><li><br>Translate graphic visual and interactive designs into the presentation layer for highly interactive web and mobile applications using responsive design and development techniques.</li><li><br>Independently plans installs, integrates and validates systems software and hardware solutions.</li><li><br>Leads technical change implementation across environments. Acquires and applies broad knowledge of the business, its products, and processes.</li><li><br>Resolves issues and navigates obstacles to deliver work product</li><li><br>Work under minimal supervision in layouts, product support, devices, methods or procedures</li><br>Required Technical and Professional Expertise<br><li><br>Minimum 3+ years of experience in development using Angular JS 2.0.</li><li><br>Experience in Hypertext Markup Language Revision 5 (HTML5), Cascading Style Sheets (CSS) and ReactJS (javascript)</li><li><br>Working knowledge of installing, upgrading and configuring Oracle tools across multiple platforms</li><li><br>Proficiency in working on UI Web portal</li><br>Preferred Technical and Professional Expertise<br><li><br>Working knowledge in ES6, React, Redux, React Router, Udesign, art, typography and photography is highly desired</li><li><br>Ambitious individual who can work under their own direction towards agreed targets/goals.</li><li><br>Ability to manage change and be open to it good time management and an ability to work under stress</li><li><br>Proven interpersonal skills while contributing to team effort by accomplishing related results as needed</li><li><br>Maintain technical knowledge by attending educational workshops, reviewing publications</li><br>About Business Unit<br>IBM Services is a team of business, strategy and technology consultants that design, build, and run foundational systems and services that is the backbone of the world's economy. IBM Services partners with the world's leading companies in over 170 countries to build smarter business by reimagining and reinventing through technology, with its outcome-focused methodologies, industry-leading portfolio and world class research and operations expertise leading to results-driven innovation and enduring excellence.<br>Your Life @ IBM<br>What matters to you when you’re looking for your next career challenge?<br>Maybe you want to get involved in work that really changes the world. What about somewhere with incredible and diverse career and development opportunities – where you can truly discover your passion? Are you looking for a culture of openness, collaboration and trust – where everyone has a voice? What about all of these? If so, then IBM could be your next career challenge. Join us, not to do something better, but to attempt things you never thought possible.<br>Impact. Inclusion. Infinite Experiences. Do your best work ever.<br>About IBM<br>IBM’s greatest invention is the IBMer. We believe that progress is made through progressive thinking, progressive leadership, progressive policy and progressive action. IBMers believe that the application of intelligence, reason and science can improve business, society and the human condition. Restlessly reinventing since 1911, we are the largest technology and consulting employer in the world, with more than 380,000 IBMers serving clients in 170 countries.<br>Location Statement<br>For additional information about location requirements, please discuss with the recruiter following submission of your application.<br>Being You @ IBM<br>IBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.<br>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637184&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Application Developer: Experience Front End","companyName":"IBM","time":"a day ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"<br>Job Description :<br>Introduction<br>As an Application Developer, you will lead IBM into the future by translating system requirements into the design and development of customized systems in an agile environment. The success of IBM is in your hands as you transform vital business needs into code and drive innovation. Your work will power IBM and its clients globally, collaborating and integrating code into enterprise systems. You will have access to the latest education, tools and technology, and a limitless career path with the world’s technology leader. Come to IBM and make a global impact!<br>Your Role and Responsibilities<br>As UI Developer you will be responsible for developing and upgrading applications is Experience Front End<br><strong>Responsibilities:</strong><li><br>Develop prototypes and performs hands-on coding to develop and integrate the application user interface.</li><li><br>Translate graphic visual and interactive designs into the presentation layer for highly interactive web and mobile applications using responsive design and development techniques.</li><li><br>Independently plans installs, integrates and validates systems software and hardware solutions.</li><li><br>Leads technical change implementation across environments. Acquires and applies broad knowledge of the business, its products, and processes.</li><li><br>Resolves issues and navigates obstacles to deliver work product</li><li><br>Work under minimal supervision in layouts, product support, devices, methods or procedures</li><br>Required Technical and Professional Expertise<br><li><br>Minimum 5+ years of experience in development using Angular JS 2.0.</li><li><br>Experience in Hypertext Markup Language Revision 5 (HTML5), Cascading Style Sheets (CSS) and ReactJS (javascript)</li><li><br>Working knowledge of installing, upgrading and configuring Oracle tools across multiple platforms</li><li><br>Proficiency in working on UI Web portal</li><br>Preferred Technical and Professional Expertise<br><li><br>Working knowledge in ES6, React, Redux, React Router, Udesign, art, typography and photography is highly desired</li><li><br>Ambitious individual who can work under their own direction towards agreed targets/goals.</li><li><br>Ability to manage change and be open to it good time management and an ability to work under stress</li><li><br>Proven interpersonal skills while contributing to team effort by accomplishing related results as needed</li><li><br>Maintain technical knowledge by attending educational workshops, reviewing publications</li><br>About Business Unit<br>IBM Services is a team of business, strategy and technology consultants that design, build, and run foundational systems and services that is the backbone of the world's economy. IBM Services partners with the world's leading companies in over 170 countries to build smarter business by reimagining and reinventing through technology, with its outcome-focused methodologies, industry-leading portfolio and world class research and operations expertise leading to results-driven innovation and enduring excellence.<br>Your Life @ IBM<br>What matters to you when you’re looking for your next career challenge?<br>Maybe you want to get involved in work that really changes the world. What about somewhere with incredible and diverse career and development opportunities – where you can truly discover your passion? Are you looking for a culture of openness, collaboration and trust – where everyone has a voice? What about all of these? If so, then IBM could be your next career challenge. Join us, not to do something better, but to attempt things you never thought possible.<br>Impact. Inclusion. Infinite Experiences. Do your best work ever.<br>About IBM<br>IBM’s greatest invention is the IBMer. We believe that progress is made through progressive thinking, progressive leadership, progressive policy and progressive action. IBMers believe that the application of intelligence, reason and science can improve business, society and the human condition. Restlessly reinventing since 1911, we are the largest technology and consulting employer in the world, with more than 380,000 IBMers serving clients in 170 countries.<br>Location Statement<br>For additional information about location requirements, please discuss with the recruiter following submission of your application.<br>Being You @ IBM<br>IBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.<br>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1632322&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Systems Analyst","companyName":"UST Global Singapore Pte Limited","time":"a day ago","location":"Thiruvananthapuram / Trivandrum","area":null,"country":"India","description":"<br>Job Description :<br>Key Responsibilities:<br>8+ years of Front-End experience with focus on JavaScript; React and Node JS<br>Candidate needs to have strong development expertise in Java Script and Reactjs [Must Skill]<br>Full-stack software development experience with Node.js (2 or more years) with express with detailed understanding of user interface frameworks;<br>back-end software architecture interactions and node module capabilities.<br>Technical Requirements:<br>React JS; JavaScript; JQuery; HTML; HTML5; CSS; CSS3; Web Programming Skills; cross-browser compatibility; Web User Interface Design (UI);<br>Security Principles; Object-Oriented Design; Web Services;<br>Regular exposure to business stakeholders and executive management; as well as the authority and scope to apply your expertise to many interesting technical problems.<br>Strong Node JS experience<br>Candidate must have a strong understanding of UI; cross-browser compatibility; general web functions and standards.<br>Experience in planning and delivering software platforms used across multiple products and organizational units.<br>Deep expertise and hands on experience with Web Applications and programming languages such as HTML; CSS; JavaScript; jQuery and API's.<br>Deep functional knowledge or hands on design experience with Web Services; is needed to be successful in this position.<br>Strong grasp of security principles and how they apply to banking applications."},{"link":"https://www.monsterindia.com/seeker/job-details?id=1632324&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Sr. Software Developer","companyName":"UST Global Singapore Pte Limited","time":"a day ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"<br>Job Description :<br>Skilled at Javascript and other UI elements. Experience with React and Node JS (Full Stack)<br>• 3+ years of experience in design and development of highly -scalable applications and platform development in product based companies or R&amp;D divisions.<br>• Strong computer science fundamentals: data structures; algorithms; design patterns<br>• Hands-on experience building services using these technologies and Frameworks (React JS; Node JS; Microservices )<br>• Strong proficiency in JavaScript; including DOM manipulation and the JavaScript object model; HTML5; Type script; CSS<br>• Thorough understanding of React.js; Node.js and its core principles<br>• Experience with popular React.js workflows (such as Flux or Redux)<br>• Familiarity with newer specifications of EcmaScript<br>• Experience with data structure libraries (e.g.; Immutable.js)<br>• Experience with common front-end development tools such as Babel; Webpack; NPM; etc.<br>• Expertise in Node.js and associate frameworks such as Express<br>• Understanding the nature of asynchronous programming and its quirks and workarounds<br>• Good understanding of server-side templating languages such as EJS<br>• Good understanding of server-side CSS pre processors<br>• Understanding accessibility and security compliance<br>• User authentication and authorization between multiple systems; servers; and environments and especially on SSO process<br>• Knowledge on Linux platform<br>• Knowledge on unit testing frameworks like Jest and code quality control platforms like Sonar<br>• CI/CD development environments/tools: Git; Maven; Jenkins; Azure DevOps<br>• Demonstrated ownership for development and design of a few modeules/features in a product.<br>• Working knowledge of SQL and database technologies<br>• Hands on development skills to prototype technical solutions.<br>• Ability to adapt to change quickly; willingness to learn new and emerging technologies<br>• Good communication and interpersonal<br>• Knowledge on cloud platforms like Microsoft Azure<br>• Awarness of Agile (Scrum) methodologies"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1603477&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Software Developer","companyName":"UST Global Singapore Pte Limited","time":"a day ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"<br>Job Description :<br>Job Description<br>- Build powerful, stand out visualizations of process and business operations data<br>- Grasp users needs and translate them into business and technology solutions<br>- Consult on and help with the making of creative data visualization to give users the best experience possible<br>- Prototype and build new ideas and take part in all stages of the product lifecycle from research to release<br>- Help migrate users inhouse developed data visualization applications to enterprise standard<br>- Interact and iterate with business users to define, co create and validate compelling Analytics applications or dashboards that drive value add<br>Needed Skills<br>- Minimum of a bachelor s degree or equivalent 4 years minimum of hands on data visualization experience<br>- Minimum 2 years of full life cycle Development. Agile and waterfall delivery experience<br>- Minimum 2 years of design or development experience with Qlik Sense and Qlik NPrinting, and one or more of the following data visualization tools Tableau, Spotfire, PowerBI, ThoughtSpot, Business Objects and SAP Analytics Cloud<br>- Data Model Design for visualization and specialized data stores.<br>- Minimum of 1 year of data technology experience to include ETL tools BODS, Informatica, Talend, Alteryx, Ab Initio, DataStage or Data Modeling Oracle, SQL Server, Teradata, SAP, Netezza or other reporting tools such as Cognos, MicroStrategy, Business Objects<br>Additional skills Nice to have<br>- Certified in one or many of the technologies mentioned above<br>- Custom data visualization experience using Javascript, R, CSS, HTML5 and or d3.js<br>- Scripting skills in Python, SAS and or R or have integrated this type of statistical analysis tool with data visualization tools.<br>- Full life cycle Development. Agile and waterfall delivery experience<br>- Industry experience financial services, resources, healthcare, government, products, communications, high tech<br>- Previous consulting and Technical team lead experience<br>Professional Skills<br>- Proven ability to work creatively and analytically in a problem solving environment<br>- Desire to work in an information systems environment<br>- Excellent communication written and oral and interpersonal skills<br>- Self starter ad ability to learn quickly"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1622091&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Software Developer","companyName":"UST Global Singapore Pte Limited","time":"a day ago","location":"Thiruvananthapuram / Trivandrum","area":null,"country":"India","description":"<br>Job Description :<br>Primary Skill Angular 2.0 and above<br>Secondary Skill HTML5, CSS3, JavaScript jQuery, Bootstrap<br>Required Skills<br>- 2 to 4 years of front end development work experience<br>- Should have expert level knowledge of Angular Ver 2.0 above , HTML5, CSS3, JavaScript jQuery, Bootstrap<br>- Should have strong debugging skills on Developer Tools of the browser and Working with Cross Browser UI<br>- Good to have knowledge on other JS frameworks KnockoutJS, ExtJS, Ember JS, Backbone JS, RequireJS<br>- Should have experience in Response Adoptive Web Design for desktop, tablet and mobile<br>- Should have experience in Agile Software Development projects<br>- Experience in client communication and working with client on requirements and delivery<br>- Should have experience in publishing and consuming Services using REST API<br>- Knowledge on Java, Web services using REST SOAP over JSON is a plus<br>- Good communication and presentation skills"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1608464&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Sr. Technical Lead","companyName":"UST Global Singapore Pte Limited","time":"a day ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"<br>Job Description :<br>- 8 years experience in Java based Web development with significant experience in Microservices development and expertise on Kubernetes<br>Mandatory<br>- Expertise in the following technologies<br>o Java<br>o Microservices<br>o RESTful service<br>o Spring<br>o Kubernetes<br>o Docker<br>o Hands on experience with deployments on Cloud.<br>Desirable<br>- UI technologies HTML,CSS, Bootstrap, JQuery, Angular JS, ReactJS<br>- Experience with Cloud deployments AWS, Azure etc "},{"link":"https://www.monsterindia.com/seeker/job-details?id=1621381&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Web Development - FrontEnd Developer","companyName":"Verzeo Edutech Private Limited","time":"a day ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"Selected intern's day-to-day responsibilities include:<br>1. Develop user interface using React.js<br>2. Develop reusable components and front-end libraries<br>3. Develop designs and wireframes into User Interface<br>4. Optimize components for maximum performance across a vast array of web-capable devices and browsers<br>Skills:<br>1. Proficiency in JavaScript along with DOM knowledge and logical ability to code in JavaScript<br>2. Thorough understanding of React.js along with core principles<br>3. Experience with Redux Library is advantageous<br>4. Familiarity with new specifications of ES 6<br>5. Experience with data structure libraries (e.g., Immutable.js)<br>6. Knowledge of Isomorphic JavaScript is a plus<br>7. Familiarity with RESTful APIs<br>8. Knowledge of modern authorization mechanisms, such as JSON Web Token (JWT)<br>9. Experience with common front-end development tools such as Babel, Webpack, NPM, etc<div><br></div><div>Note:Only those who are interested to join at office can apply.</div><div>*Stipend can be negotiable.</div>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1621530&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Web Development - Backend Developer Internship","companyName":"Verzeo Edutech Private Limited","time":"a day ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"We are looking for a Node.js Developer to join our fun, energetic team who are running at full speed to ignite a digital disruption in Social Networking and discovery.<br>Node.js Developer duties and responsibilities :<br>- Work as part of a team developing applications and services using Agile development methods<br>- Contribute to team and organizational improvements in process and infrastructure<br>- Build customer-facing UI and back-end services for payment processing administration and management<br>- Code, teste and operate node.js based services<br>- Effectively use tools and ingenuity to identify and fix defects before they become a problem<br>- Node.js Developer requirements and qualifications<br>- In-depth knowledge of Node.js<br>- Hands-on experience with HTML, CSS, and AJAX, Axios<br>- Development experience designing object-oriented JavaScript and SVG<br>- Applicable knowledge of web libraries and frameworks such as AngularJS, Polymer, and Closure<br>- Familiarity with the whole web stack, including protocols and web server optimization techniques<br>- Strong analytical skills and problem solving aptitude<div><br></div><div>Note:Only those who are willing to join office can apply.</div><div>*Stipend is negotiable.</div>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1587141&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Assistant Manager - SharePoint","companyName":"Genpact","time":"a day ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"<br>Job Description :<br>With a startup spirit and 90,000+ curious and courageous minds, we have the expertise to go deep with the world\\u2019s biggest brands\\u2014and we have fun doing it. Now, we\\u2019re calling all you rule-breakers and risk-takers who see the world differently, and are bold enough to reinvent it. Come, transform with us. Transformation happens here. Come, be a part of our exciting journey!<br><b> Inviting applications for the role of Assistant Manager, SharePoint </b><br>We are looking for a team lead/manager who would be responsible for the delivery of SharePoint projects for customers and support the team in completing the overall project goal. Are you the one we are looking for?<br>Responsibilities<br><ul><li> software development experience. </li><li> experience in defining and deploying solutions in Microsoft SharePoint </li><li> years of leading a SharePoint team and delivering projects from scratch </li><li> Should have led client discussions for requirements </li><li> Should be able to prioritize multiple project execution </li><li> Experience in designing and deploying solutions in Microsoft SharePoint Modern Framework using SPFx and Office Fabric UI </li><li> Experience in crafting business process application using Power Platform (Microsoft Flow, Power Apps, and Power BI) </li><li> Experience on Office 365 Tenant Admin activities </li><li> Demonstrate an understanding of SharePoint API's and architecture. </li><li> Ability to communicate effectively with end-users and translate business language into technical requirements. </li><li> Prior experience in a federal agency environment is highly desirable. </li><li> Excellent written and oral communication skills and ability to express complex technical concepts effectively, both verbally and in writing. </li><li> Excellent customer service skills. </li><li> Ability to work in a team-based environment, as well as, the ability to work independently. </li><li> Ability to work effectively with people of many different disciplines with varying degrees of technical experience </li></ul><b> Required Technology Skillset: </b><br><ul><li> Collaboration: SharePoint Portal Server / Windows SharePoint Services, Content Management Server </li><li> Databases: SQL Server 2005, 2008, 2010 </li><li> Frameworks: Framework 3.0,3.5 , SharePoint Modern Framework SPFx </li><li> IDE: Visual Studio 2005, 2008, SharePoint Designer </li><li> Languages: C#,VB.Net, WPF,WCF </li><li> Web Server-side: ASP.Net, IIS, Web Services </li><li> Power Platform : Power Apps, Microsoft Flow </li><li> Web Client-side: HTML, XHTML, CSS, JavaScript, JQuery, Ajax, React JS, TypeScript </li></ul><b> Minimum qualifications </b><br><ul><li> BE/B- Tech, BCA, MCA, BSc/MSc, MBA </li></ul><b> Preferred qualifications </b><br><ul><li> Personal drive and positive work ethic to deliver results within tight deadlines and in demanding situations </li><li> Flexibility to adapt to a variety of engagement types, working hours and work environments and locations </li><li> Superb communication and negotiation skills </li></ul><br><b> Genpact is an Equal Opportunity Employer and considers applicants for all positions without regard to race, color, religion or belief, sex, age, national origin, citizenship status, marital status, military/veteran status, genetic information, sexual orientation, gender identity, physical or mental disability or any other characteristic protected by applicable laws. </b> Genpact is committed to creating a dynamic work environment that values diversity and inclusion, respect and integrity, customer focus, and innovation. For more information, visit www.genpact.com. Follow us on Twitter, Facebook, LinkedIn, and YouTube.<br>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1636906&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Java Full Stack Development Application Lead","companyName":"Accenture","time":"a day ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"<br>Job Description<br><strong>About Accenture: </strong>Accenture is a leading global professional services company, providing a broad range of services in strategy and consulting, interactive, technology and operations, with digital capabilities across all of these services. We combine unmatched experience and specialized capabilities across more than 40 industries — powered by the world’s largest network of Advanced Technology and Intelligent Operations centers. With 513,000 people serving clients in more than 120 countries, Accenture brings continuous innovation to help clients improve their performance and create lasting value across their enterprises. Visit us at <ul><br><li><strong>Project Role :</strong>Application Lead</li><li><strong>Project Role Description :</strong>Lead the effort to design, build and configure applications, acting as the primary point of contact.</li><li><strong>Management Level :</strong>10</li><li><strong>Work Experience :</strong>4-6 years</li><li><strong>Work location :</strong>Bengaluru</li><li><strong>Must Have Skills :</strong>Java Full Stack Development</li><li><strong>Good To Have Skills :</strong>Spring Boot</li><li><strong>Job Requirements : </strong><ul><br><li><strong>Key Responsibilities : </strong>a: Design Develop and configure software systems to meet the client requirements b: Perform Unit Testing and required QA process to test the software component c: Should work on application development projects and have waterfall and agile sdlc development experience d: Apply knowledge of technology, application, methodologies, process and tools to support client requirements e: Should help client in value added activities by introducing automations as needed and deliver the same</li><br><li><strong>Technical Experience : </strong>Must to Have Skills: Java Full Stack Development a: Resource should have minimum 4 yrs of hands-on experience in Front End technologies HTML5, CSS3, JS, JQuery, JSON, Ajax, Angularjs, React, Nodejs and similar, AWS hands-on b: Resource should have hands on in Java/J2EE Object Oriented design and development skills Core Java, Spring Web Services SOAP, REST</li><br><li><strong>Professional Attributes : </strong>a: Very strong communication skills both oral and written b: Very strong analytical skills c: Very strong presentation skills ability to work under pressure</li></ul></li></ul><br>Qualifications<br>15 years of full time education "},{"link":"https://www.monsterindia.com/seeker/job-details?id=1636892&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"User Interface Development Solutions Application Developer","companyName":"Accenture","time":"a day ago","location":"Gurgaon / Gurugram","area":null,"country":"India","description":"<br>Job Description<br><strong>About Accenture: </strong>Accenture is a leading global professional services company, providing a broad range of services in strategy and consulting, interactive, technology and operations, with digital capabilities across all of these services. We combine unmatched experience and specialized capabilities across more than 40 industries — powered by the world’s largest network of Advanced Technology and Intelligent Operations centers. With 513,000 people serving clients in more than 120 countries, Accenture brings continuous innovation to help clients improve their performance and create lasting value across their enterprises. Visit us at <ul><br><li><strong>Project Role :</strong>Application Developer</li><li><strong>Project Role Description :</strong>Design, build and configure applications to meet business process and application requirements.</li><li><strong>Management Level :</strong>10</li><li><strong>Work Experience :</strong>4-6 years</li><li><strong>Work location :</strong>Gurugram</li><li><strong>Must Have Skills :</strong>User Interface Development Solutions</li><li><strong>Good To Have Skills :</strong>Java Enterprise Edition</li><li><strong>Job Requirements : </strong><ul><br><li><strong>Key Responsibilities : </strong>Must have hands on Experience in front End MVC architecture development Single Page Application SPA Development using one of JS MVC framework like - Angular, Angular 20, Backbone, React etc Experience in DevOps tools like Yeoman, NPM, Grunt, Gulp, Webpack, etc Experience in Testing Framework Jasmin, Protractor, Karma, Mocha, Chai, Continuous Integration tool - Jenkins</li><br><li><strong>Technical Experience : </strong>Development Experience in OOPS server side language - Java/J2EE, NET Server side Scripting - Nodejs, Expressjs Understand Componentized Development in Front End</li><br><li><strong>Professional Attributes : </strong>-Good Communication skill -Good team building skill -Should have good analytical skill</li><br><li><strong>Educational Qualification : </strong>B Tech/BE</li></ul></li></ul><br>Qualifications<br>15 years of full time education "},{"link":"https://www.monsterindia.com/seeker/job-details?id=1636883&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Microsoft Front End Development Application Developer","companyName":"Accenture","time":"a day ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"<br>Job Description<br><strong>About Accenture: </strong>Accenture is a leading global professional services company, providing a broad range of services in strategy and consulting, interactive, technology and operations, with digital capabilities across all of these services. We combine unmatched experience and specialized capabilities across more than 40 industries — powered by the world’s largest network of Advanced Technology and Intelligent Operations centers. With 513,000 people serving clients in more than 120 countries, Accenture brings continuous innovation to help clients improve their performance and create lasting value across their enterprises. Visit us at <ul><br><li><strong>Project Role :</strong>Application Developer</li><li><strong>Project Role Description :</strong>Design, build and configure applications to meet business process and application requirements.</li><li><strong>Management Level :</strong>10</li><li><strong>Work Experience :</strong>4-6 years</li><li><strong>Work location :</strong>Bengaluru</li><li><strong>Must Have Skills :</strong>Microsoft Front End Development</li><li><strong>Good To Have Skills :</strong>Accenture Delivery Methods (ADM)</li><li><strong>Job Requirements : </strong><ul><br><li><strong>Key Responsibilities : </strong>FED Design, build and configure applications to meet business process and application requirements</li><br><li><strong>Technical Experience : </strong>Must Have Skills :Microsoft FED Angular Good To Have Skills :Microsoft FED ReactJS,Microsoft Windows Azure PaaS Web fundamentals like HTML, JavaScript, and CSS , React JS Libraries like jQuery or Backbonejs Front-end CSS frameworks like Foundation or Bootstrap AJAX</li><br><li><strong>Professional Attributes : </strong>Smart Working Logical and Analytical</li><br><li><strong>Educational Qualification : </strong>BE or MCA</li></ul></li></ul><br>Qualifications<br>15 years of full time education "},{"link":"https://www.monsterindia.com/seeker/job-details?id=1636881&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Microsoft Teams Development Application Developer","companyName":"Accenture","time":"a day ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"<br>Job Description<br><strong>About Accenture: </strong>Accenture is a leading global professional services company, providing a broad range of services in strategy and consulting, interactive, technology and operations, with digital capabilities across all of these services. We combine unmatched experience and specialized capabilities across more than 40 industries — powered by the world’s largest network of Advanced Technology and Intelligent Operations centers. With 513,000 people serving clients in more than 120 countries, Accenture brings continuous innovation to help clients improve their performance and create lasting value across their enterprises. Visit us at <ul><br><li><strong>Project Role :</strong>Application Developer</li><li><strong>Project Role Description :</strong>Design, build and configure applications to meet business process and application requirements.</li><li><strong>Management Level :</strong>9</li><li><strong>Work Experience :</strong>6-8 years</li><li><strong>Work location :</strong>Bengaluru</li><li><strong>Must Have Skills :</strong>Microsoft Teams Development</li><li><strong>Good To Have Skills :</strong>Node.js</li><li><strong>Job Requirements : </strong><ul><br><li><strong>Key Responsibilities : </strong>1 Ability of designing, developing and deploying complex Teams App for small, medium and large enterprise 2 Designing and Coding of Complex custom Microsoft Team Apps 3 Understanding of Microsoft Teams Platform and advise when and how new MS Teams components should be leveraged to address business requirements 4 Identify, understand, define and evangelize best practices in technology 5 Define needed governance standards, principles, and guard rails to meet development best practices, data govern</li><br><li><strong>Technical Experience : </strong>1 Experience on Microsoft Teams and SharePoint online 2 Experience on Microsoft Power automate Office 365 is an added advantage 3 Ability of designing, developing and deploying complex Teams App for small, medium and large enterprise 4 Designing and Coding of Complex and Very Complex custom Microsoft Team Apps 5 Coding of custom Microsoft Teams App using C or Node JS 6 Experience of Java frameworks like AngularJS, React JS Knockout JS 7 Experience of ASPNET 35 and above, Microsoft Graph API,</li><br><li><strong>Professional Attributes : </strong>1 Should have good team lead capabilities to efficiently collaborate with stakeholders 2 Have outstanding verbal communications skills 3 Have good client expectation management and presentation skills 4 Team Management and Stakeholder Management 5 Ability to build expertise of other people</li><br><li><strong>Educational Qualification : </strong>Full time 15 years of regular education</li><br><li><strong>Additional Information : </strong>Experience on Microsoft Power Apps Office 365 is an added advantage</li></ul></li></ul><br>Qualifications<br>15 years of full time education "},{"link":"https://www.monsterindia.com/seeker/job-details?id=1636876&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Java Enterprise Edition Application Developer","companyName":"Accenture","time":"a day ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"<br>Job Description<br><strong>About Accenture: </strong>Accenture is a leading global professional services company, providing a broad range of services in strategy and consulting, interactive, technology and operations, with digital capabilities across all of these services. We combine unmatched experience and specialized capabilities across more than 40 industries — powered by the world’s largest network of Advanced Technology and Intelligent Operations centers. With 513,000 people serving clients in more than 120 countries, Accenture brings continuous innovation to help clients improve their performance and create lasting value across their enterprises. Visit us at <ul><br><li><strong>Project Role :</strong>Application Developer</li><li><strong>Project Role Description :</strong>Design, build and configure applications to meet business process and application requirements.</li><li><strong>Management Level :</strong>10</li><li><strong>Work Experience :</strong>4-6 years</li><li><strong>Work location :</strong>Bengaluru</li><li><strong>Must Have Skills :</strong>Java Enterprise Edition</li><li><strong>Good To Have Skills :</strong>No Technology Specialization</li><li><strong>Job Requirements : </strong><ul><br><li><strong>Key Responsibilities : </strong>1 Design and implement Java based solutions with scalability, reliability, maintainability testability 2 Strong technical skills with technologies like Java/J2EE/ Hibernate,Spring, SAP HANA, UI Technologies and OData protocols to develop modem cutting edge software that performs and scales in cloud environment 3 Server oriented Knowledge in Java backend development tomcat, JEE, dependency injection 4 At least basic client side knowledge of Web technologies, JS, HTML, CSS</li><br><li><strong>Technical Experience : </strong>1 Sound knowledge in Object Oriented Programming Principles,Design Patterns and Software Architecture, especially in new age Cloud solutions 2 Design and implement across all layers of the software UI, Backend, Database 3Exposure to debugging ,troubleshooting and performance tuning for complex SQL queries 4 Capable of creating High level and low-level design document 5 Knowledge of lean development infrastructure process including Git,TeamCity,Jenkins ,exposure to CD practices</li><br><li><strong>Professional Attributes : </strong>1Outstanding written and verbal communication skills 2 Should have team handling skills 3 Must have analytical skills and presentation skills</li></ul></li></ul><br>Qualifications<br>15 years of full time education "},{"link":"https://www.monsterindia.com/seeker/job-details?id=1636872&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Java Full Stack Development Application Lead","companyName":"Accenture","time":"a day ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"<br>Job Description<br><strong>About Accenture: </strong>Accenture is a leading global professional services company, providing a broad range of services in strategy and consulting, interactive, technology and operations, with digital capabilities across all of these services. We combine unmatched experience and specialized capabilities across more than 40 industries — powered by the world’s largest network of Advanced Technology and Intelligent Operations centers. With 513,000 people serving clients in more than 120 countries, Accenture brings continuous innovation to help clients improve their performance and create lasting value across their enterprises. Visit us at <ul><br><li><strong>Project Role :</strong>Application Lead</li><li><strong>Project Role Description :</strong>Lead the effort to design, build and configure applications, acting as the primary point of contact.</li><li><strong>Management Level :</strong>9</li><li><strong>Work Experience :</strong>6-8 years</li><li><strong>Work location :</strong>Bengaluru</li><li><strong>Must Have Skills :</strong>Java Enterprise Edition,Java Full Stack Development</li><li><strong>Good To Have Skills :</strong></li><li><strong>Job Requirements : </strong><ul><br><li><strong>Key Responsibilities : </strong>a: The person will be responsible for end to end implementation ie gathering requirements, analyzing, designing, coding and deployment to Production b: The person will be in client facing role talking to client SME on regular basis to get requirements and clarifications c: The person will be responsible for reviewing and overseeing team-mates work d: The person should be able to work with different teams to coordinate on requirements and data requirements</li><br><li><strong>Technical Experience : </strong>a:Full Stack Developer b:Github, Hibernate, Java, JEE, mySQL , jUnit, REST, DB Schema design , API, SSL/HTTPs, React JS</li><br><li><strong>Professional Attributes : </strong>a: Resource should have good communication skills b: Resource should have good analytical skills and reasoning skills</li></ul></li></ul><br>Qualifications<br>15 years of full time education "},{"link":"https://www.monsterindia.com/seeker/job-details?id=1586991&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Magento Solutions Application Developer","companyName":"Accenture","time":"a day ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":""},{"link":"https://www.monsterindia.com/seeker/job-details?id=1636867&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Microsoft Teams Development Application Developer","companyName":"Accenture","time":"a day ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"<br>Job Description<br><strong>About Accenture: </strong>Accenture is a leading global professional services company, providing a broad range of services in strategy and consulting, interactive, technology and operations, with digital capabilities across all of these services. We combine unmatched experience and specialized capabilities across more than 40 industries — powered by the world’s largest network of Advanced Technology and Intelligent Operations centers. With 513,000 people serving clients in more than 120 countries, Accenture brings continuous innovation to help clients improve their performance and create lasting value across their enterprises. Visit us at <ul><br><li><strong>Project Role :</strong>Application Developer</li><li><strong>Project Role Description :</strong>Design, build and configure applications to meet business process and application requirements.</li><li><strong>Management Level :</strong>10</li><li><strong>Work Experience :</strong>4-6 years</li><li><strong>Work location :</strong>Bengaluru</li><li><strong>Must Have Skills :</strong>Microsoft Teams Development</li><li><strong>Good To Have Skills :</strong>Node.js</li><li><strong>Job Requirements : </strong><ul><br><li><strong>Key Responsibilities : </strong>1 Developing and deploying Teams App for small, medium and large enterprise 2 Designing and Coding of Complex custom Microsoft Team Apps 3 Understanding of Microsoft Teams Platform and advise when and how new MS Teams components should be leveraged to address business requirements</li><br><li><strong>Technical Experience : </strong>1 Experience on Microsoft Teams and SharePoint online 2 Experience on Microsoft Power automate Office 365 is an added advantage 3 Designing and Coding of custom Microsoft Team Apps 4 Coding of custom Microsoft Teams App using C or Node JS 5 Experience of Java frameworks like AngularJS, React JS Knockout JS 6 Experience of ASPNET 35 and above, Microsoft Graph API, HTML 5, CSS 7 Experience of Microsoft Graph API, HTML 5, CSS</li><br><li><strong>Professional Attributes : </strong>1 Have outstanding verbal communications skills 2 Have good client expectation management and presentation skills 3 Ability to build expertise of other people 4 Should have good problem solving and analytical skills</li><br><li><strong>Educational Qualification : </strong>Full time 15 years of regular education</li><br><li><strong>Additional Information : </strong>Experience on Microsoft Power Apps Office 365 is an added advantage</li></ul></li></ul><br>Qualifications<br>15 years of full time education "},{"link":"https://www.monsterindia.com/seeker/job-details?id=1636847&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Java Full Stack Development Application Developer","companyName":"Accenture","time":"a day ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"<br>Job Description<br><strong>About Accenture: </strong>Accenture is a leading global professional services company, providing a broad range of services in strategy and consulting, interactive, technology and operations, with digital capabilities across all of these services. We combine unmatched experience and specialized capabilities across more than 40 industries — powered by the world’s largest network of Advanced Technology and Intelligent Operations centers. With 513,000 people serving clients in more than 120 countries, Accenture brings continuous innovation to help clients improve their performance and create lasting value across their enterprises. Visit us at <ul><br><li><strong>Project Role :</strong>Application Developer</li><li><strong>Project Role Description :</strong>Design, build and configure applications to meet business process and application requirements.</li><li><strong>Management Level :</strong>10</li><li><strong>Work Experience :</strong>4-6 years</li><li><strong>Work location :</strong>Bengaluru</li><li><strong>Must Have Skills :</strong>Java Full Stack Development</li><li><strong>Good To Have Skills :</strong>No Technology Specialization</li><li><strong>Job Requirements : </strong><ul><br><li><strong>Key Responsibilities : </strong>1 Design and implement Java based solutions with scalability, reliability, maintainability testability 2 Strong technical skills with technologies like Java/J2EE/ Hibernate,Spring, SAP HANA, UI Technologies and OData protocols to develop modem cutting edge software that performs and scales in cloud environment 3 Server oriented Knowledge in Java backend development tomcat, JEE, dependency injection 4 At least basic client side knowledge of Web technologies, JS, HTML, CSS</li><br><li><strong>Technical Experience : </strong>1 Sound knowledge in Object Oriented Programming Principles,Design Patterns and Software Architecture, especially in new age Cloud solutions 2 Design and implement across all layers of the software UI, Backend, Database 3Exposure to debugging ,troubleshooting and performance tuning for complex SQL queries 4 Capable of creating High level and low-level design document 5 Knowledge of lean development infrastructure process including Git,TeamCity,Jenkins ,exposure to CD practices 6 4 years exp</li><br><li><strong>Professional Attributes : </strong>1Outstanding written and verbal communication skills 2 Should have team handling skills 3 Must have analytical skills and presentation skills</li><br><li><strong>Educational Qualification : </strong>Bachelors in Computer Science required, Master preferred</li><br><li><strong>Additional Information : </strong>knowledge of Scrum,TDD,passionate about unit test ,integrity ,stress ,perfor and automation testing</li></ul></li></ul><br>Qualifications<br>15 years of full time education "},{"link":"https://www.monsterindia.com/seeker/job-details?id=1636825&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Angular Application Developer","companyName":"Accenture","time":"a day ago","location":"Gurgaon / Gurugram","area":null,"country":"India","description":""},{"link":"https://www.monsterindia.com/seeker/job-details?id=1636806&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"React.js Application Developer","companyName":"Accenture","time":"a day ago","location":"Hyderabad / Secunderabad","area":null,"country":"India","description":"<br>Job Description<br><strong>About Accenture: </strong>Accenture is a leading global professional services company, providing a broad range of services in strategy and consulting, interactive, technology and operations, with digital capabilities across all of these services. We combine unmatched experience and specialized capabilities across more than 40 industries — powered by the world’s largest network of Advanced Technology and Intelligent Operations centers. With 513,000 people serving clients in more than 120 countries, Accenture brings continuous innovation to help clients improve their performance and create lasting value across their enterprises. Visit us at <ul><br><li><strong>Project Role :</strong>Application Developer</li><li><strong>Project Role Description :</strong>Design, build and configure applications to meet business process and application requirements.</li><li><strong>Management Level :</strong>8</li><li><strong>Work Experience :</strong>8-10 years</li><li><strong>Work location :</strong>Hyderabad</li><li><strong>Must Have Skills :</strong>React.js</li><li><strong>Good To Have Skills :</strong>No Function Specialization</li><li><strong>Job Requirements : </strong><ul><br><li><strong>Key Responsibilities : </strong>a Work on low level design, application build and defect fixes per the business/ functional requirements b Create automated unit test cases c Adhere to the defined coding standards Where possible, recommend best practices to the lead in-charge d Perform peer review of teams build deliverables e Contribute to technical design and creation of reusable components f Application support may be part of the responsibility during the Post-Go Live Support phase</li><br><li><strong>Technical Experience : </strong>a 3 years of experience in Reactjs and sound knowledge of Reactjs hooks b 3 years of experience in Redux and Redux-form frameworks c 4 years of sound knowledge of TypeScript Object-Oriented JavaScript d 4 years of experience with HTML5, CSS3 and writing cross-browser compatible code e Experience creating self-contained, reusable, testable and performant modules/ components which extend the elements and components of core Reactjs f 4 years of experience writing unit tests using automated TDDtask</li><br><li><strong>Professional Attributes : </strong>a Candidate should be a good team player b Candidate should also demonstrate good analytical and problem-solving skills c Candidate should have good written and verbal communication skills</li><br><li><strong>Educational Qualification : </strong>Any degree</li></ul></li></ul><br>Qualifications<br>15 years of full time education "},{"link":"https://www.monsterindia.com/seeker/job-details?id=1636803&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"React.js Application Developer","companyName":"Accenture","time":"a day ago","location":"Hyderabad / Secunderabad","area":null,"country":"India","description":"<br>Job Description<br><strong>About Accenture: </strong>Accenture is a leading global professional services company, providing a broad range of services in strategy and consulting, interactive, technology and operations, with digital capabilities across all of these services. We combine unmatched experience and specialized capabilities across more than 40 industries — powered by the world’s largest network of Advanced Technology and Intelligent Operations centers. With 513,000 people serving clients in more than 120 countries, Accenture brings continuous innovation to help clients improve their performance and create lasting value across their enterprises. Visit us at <ul><br><li><strong>Project Role :</strong>Application Developer</li><li><strong>Project Role Description :</strong>Design, build and configure applications to meet business process and application requirements.</li><li><strong>Management Level :</strong>9</li><li><strong>Work Experience :</strong>6-8 years</li><li><strong>Work location :</strong>Hyderabad</li><li><strong>Must Have Skills :</strong>React.js</li><li><strong>Good To Have Skills :</strong>No Function Specialization</li><li><strong>Job Requirements : </strong><ul><br><li><strong>Key Responsibilities : </strong>a Work on low level design, application build and defect fixes per the business/ functional requirements b Create automated unit test cases c Adhere to the defined coding standards Where possible, recommend best practices to the lead in-charge d Perform peer review of teams build deliverables e Contribute to technical design and creation of reusable components f Application support may be part of the responsibility during the Post-Go Live Support phase</li><br><li><strong>Technical Experience : </strong>a 3 years of experience in Reactjs and sound knowledge of Reactjs hooks b 3 years of experience in Redux and Redux-form frameworks c 4 years of sound knowledge of TypeScript Object-Oriented JavaScript d 4 years of experience with HTML5, CSS3 and writing cross-browser compatible code e Experience creating self-contained, reusable, testable and performant modules/ components which extend the elements and components of core Reactjs f 4 years of experience writing unit tests using automated TDDtask</li><br><li><strong>Professional Attributes : </strong>a Candidate should be a good team player b Candidate should also demonstrate good analytical and problem-solving skills c Candidate should have good written and verbal communication skills</li><br><li><strong>Educational Qualification : </strong>Any degree</li></ul></li></ul><br>Qualifications<br>15 years of full time education "},{"link":"https://www.monsterindia.com/seeker/job-details?id=1636801&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"React.js Application Developer","companyName":"Accenture","time":"a day ago","location":"Hyderabad / Secunderabad","area":null,"country":"India","description":""},{"link":"https://www.monsterindia.com/seeker/job-details?id=1636682&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"E2E_PYTHON / DJANGO Software Developer [ R ]","companyName":"D Source","time":"a day ago","location":"Nashik","area":null,"country":"India","description":"<br>Qualification<br>Education Specialisation Details<br>Graduate \tBE Computers<br>Graduate \tBE IT<br>Graduate \tBSc Computer Science<br>Job Description<br>Vacancy Uploaded On : 30/07/20<br>Vacancy Uploaded By Rohini<br>===============================================<br><strong>Responsibilities:</strong><ul><li>Understanding of the threading limitations of Python, and multi process architecture</li><li>Understanding of fundamental design principles behind a scalable application</li><li>Strong unit test and debugging skills</li><li>Able to integrate multiple data sources and databases into one system</li><li>Good understanding of RESTful APIs Analytical mind with problem-solving aptitude and ability to work independently</li></ul><br>===============================================<br><strong>Skills:</strong><ul><li>Proficient knowledge of code versioning tools Experience on CI/CD process Exposure to Agile Methodologies Good understanding of front-end technologies such as JavaScript, React JS, HTML5, and CSS3</li></ul><br>===============================================<br><strong>Salary is negotiable as per candidates experience and skills</strong><br>===============================================<br>Key Skills<br>.Net, ASP.NET "},{"link":"https://www.monsterindia.com/seeker/job-details?id=1636658&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Full Stack Developer","companyName":"Superior Talent","time":"a day ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"<br>Description<br><li><strong>Fulltime, should know Laravel, React JS, MySQL, jQuery</strong></li><br><br>Job Requirements<br><strong>3 to 4 years exp</strong><br><strong>Bangalore Location</strong><br>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1508686&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":" JavaScript Software Engineer - A South Africa Based IT Company, Pune","companyName":"Seventh Contact Hiring Solutions","time":"2 days ago","location":"Pune","area":null,"country":"India","description":"Job specifications:<br><ul><li>Current proficiency in JavaScript with 3+ years solid exposure at  professional level<br></li><li>Dedication to getting the job done no matter the obstacles<br></li><li>A full stack developer is a definite plus in this role</li><li>Experience in: (relative to seniority)<br></li><li>JavaScript ,React,Angular2.0,Angular4.0 or latest version .</li><li>Hands on experience in HTML, CSS,JQuery.<br></li><li>Back-end service integration typically - REST Web Services: Node.js, Java, .Net, Go and Java EE<br></li><li>Jira and Git<br></li><li>Testing frameworks<br></li><li>Microservices, Docker and Kubernetes experience beneficial<br></li><li>AWS experience and or certification beneficial<br></li><li>Ability to read and identify issues in back-end code in languages such as Node.js, Java, .Net, Go and Java EE<br></li></ul>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1509540&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Lead Java  -South Africa Based IT Company Viman Nagar Pune","companyName":"Seventh Contact Hiring Solutions","time":"2 days ago","location":"Pune","area":null,"country":"India","description":"Job description:<br><ul><li>8+years of development experience on Java technologies.<br></li><li>Provide technical solutions and need based supervision to complete projects; possess initiative to address issues and opportunities.<br></li><li>Sound knowledge of programming and problem solving within JAVA environment, ideally in the telecommunications industry environment.<br></li></ul><br>Job Specifications:<br><ul><li>8+ years experience working on Core Java / J2EE, Spring, Hibernate, Webservices, AngularJS, JavaScript, JBoss. <br></li><li>Experience in building micro services Spring boot using Java is mandatory.<br></li><li>Experience of OO programming, Multi threading, Collection API and Exception handling<br></li><li>Experience in handling a team.<br></li><li>Experience in Angular and Node will be an added advantage.<br></li><li>Expertise in Web services like WebSphere/ WebLogic.</li></ul><div></div>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1301403&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Technology Consultant (Dot Net) with a Microsoft Gold Partner company for Bavdhan, Pune","companyName":"Seventh Contact Hiring Solutions","time":"2 days ago","location":"Pune","area":null,"country":"India","description":"Role &amp; Responsibilities:<br>As a part of agile team environment, you are expected to independently work on end-to-end project delivery which includes –<br>1. To design and build applications using n-tier architectures (preferably in MVC using C#)<br>2. Analyzing and designing software as per the project requirements<br>3. Developing and implementing quality software solutions as per the requirements as per defined timelines<br>4. Exercising independent judgment in evaluating alternative technical solutions<br>5. Preparing unit test cases for quality check of the deliverables<br>6. Constantly upgrading by learning technologies beyond traditional area of expertise<br>Job Requirements/Qualifications:<br>1. Minimum 2yrs hands-on experience in programming in ASP, .Net Framework 4.0/ 4.5, JavaScript<br>2. Knowledge of MVC / Azure JSON, XML, WebAPI, AngularJS, and Entity Framework would be a definite advantage.<br>3. Ability to independently deliver complex development projects<br>4. Must enjoy hands on programming work<br>5. Excellent written and oral communication skills<br>6. Enjoys working as part of agile teams in a start-up environment."},{"link":"https://www.monsterindia.com/seeker/job-details?id=1636463&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Node.JS Technical Lead-Bangalore-FTE","companyName":"Best infosystems Ltd","time":"2 days ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"Node.JS Technical Lead<br>Job Title:NodeJS<br>Exp: 3-12 years<br>• Proficient in JavaScript (NodeJS) development<br>• Knowledge of cloud technologies (preferably AWS)<br>• Good experience with data persistence, really great if you worked with SQL, noSQL and event sourcing.<br>• Knowledge of web software architectures - Client-server, Microservices, SOA<br>• Familiar with Agile<br>• API development<br>• Individual development, training and a tech community<br>If you are open for this job opportunity please forward your latest CV along with fill up Information so that we can process your candidature to next level.<br>====================================================<br># Your full name ( First : Middle : Last ) ( All expanded ) :<br># Present Employer Name &amp; Work Location :<br># Permanent / Contract Employee :<br># Highest Qualification (University Name and Passing year):<br># Total experience:<br># Relevant experience:<br># Current CTC:<br># Expected CTC:<br># Official Notice Period:<br># Are you serving notice period if yes then mention LWD:<br># Any offer you are holding (if yes please share the offer amount):<br># PAN number:<br>====================================================<br>Thanks &amp; Regards,<br>Rajiv<br>Lead-IT Resourcing Specialist<br>Best Infosystems Limited<br>Email : rajiv(at)bestinfosystems(dot)co(dot)in  "},{"link":"https://www.monsterindia.com/seeker/job-details?id=1636457&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"ReactJS with Java Module Lead / Tech Lead-Bangalore-FTE","companyName":"Best infosystems Ltd","time":"2 days ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"Job Title: React JS with JAVA<br>Job Location:Bangalore<br>• Over all 6 to 10 yrs of IT Exp<br>• Developing and maintaining web applications written in ReactJS/HTML/CSS/JavaScript<br>• Experience with a variety of JavaScript libraries and frameworks<br>• Know W3C-compliant markup that looks pixel-perfect<br>• Experience with code repositories (e.g., SVN / Git)<br>• Ability to become proficient with new technologies quickly<br>• Experience in ReactJS, NodeJS. Developing singe page apps using React JS &amp; Redux<br>If you are open for this job opportunity please forward your latest CV along with fill up Information so that we can process your candidature to next level.<br>====================================================<br># Your full name ( First : Middle : Last ) ( All expanded ) :<br># Present Employer Name &amp; Work Location :<br># Permanent / Contract Employee :<br># Highest Qualification (University Name and Passing year):<br># Total experience:<br># Relevant experience:<br># Current CTC:<br># Expected CTC:<br># Official Notice Period:<br># Are you serving notice period if yes then mention LWD:<br># Any offer you are holding (if yes please share the offer amount):<br># PAN number:<br>====================================================<br>Thanks &amp; Regards,<br>Rajiv<br>Lead-IT Resourcing Specialist<br>Best Infosystems Limited<br>Email : rajiv(at)bestinfosystems(dot)co(dot)in "},{"link":"https://www.monsterindia.com/seeker/job-details?id=1636333&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Urgent job opening in a CMM5 level Company @ Bangalore Location (Node.JS Technical Lead)","companyName":"Best infosystems Ltd","time":"2 days ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"<u><b>JD of Node.JS Technical Lead:</b></u><div>NodeJS, Typescript, React, Redux, Webpack, HTML5/ES6/CSS3/SCSS<br></div><div>experience in working with fast paced web development with agile/ scrum methodology<br>Experience with building eCommerce solutions.<br></div><div><br></div><div>Location: Bangalore</div><div>Experience: 5-10 Years<br></div><div>Notice Period: 0-45 Days<br></div><div><br></div><div>Questionnaries:<br>1. Total experience:<br>2. Relevant experience:<br>3. Current CTC:<br>4. Expected CTC:<br>5. Official Notice Period:<br>6. Are you serving notice period if yes then mention LWD:<br>7. Any offer you are holding (if yes please share the offer amount):<br>8. PAN number:<br>With regards<br>Ujjwal Ghosh<br></div>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1636326&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Urgent Job opening in a CMM5 level company_Bangalore location_React.JS Lead/Module Lead","companyName":"Best infosystems Ltd","time":"2 days ago","location":"Bengaluru / Bangalore","area":null,"country":"India"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1636280&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"UI UX Designer ","companyName":"Innovius Overseas Consultants Private Limited","time":"2 days ago","location":"Hyderabad / Secunderabad","area":null,"country":"India","description":"Design and develop user-friendly, reusable, intuitive, innovative and a feel of nextgeneration User Interface.<br> Translate the UI/UX design wireframes to codes that will produce visual elements of the<br>application Design the UI framework.<br> Experience in design and delivery of Web UI Applications using in Angular JS development<br>Should be proficient with Angular 6+, TypeScript, JavaScript, RESTful services, jQuery .<br> Must have prior hands-on experience in delivering highly scalable client-side applications<br>Desired: Experience with design and development of mobile applications is a plus<div> Real time experience in UI development owning major deliverables, providing solutions and<br>driving innovations.<br> Strong expertise in with HTML5, CSS3, JavaScript, ES6, Web Pack and other tools related to<br>React Front End Development.<br> Strong analytical and problem solving skills.<br> Expertise in unit testing with Karma, Jasmine, Jest, Enzyme etc. and end to end testing with<br>Protractor.<br> Experience in source control using Git, SVN etc.<br> Strong communication skills to interact with stakeholders<br> Should understand the UX design and design/develop optimal solutions for UI<br> Experience in consuming Restful web services using various Ajax techniques.<br></div>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1636265&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Data Scientist ","companyName":"Innovius Overseas Consultants Private Limited","time":"2 days ago","location":"Hyderabad / Secunderabad","area":null,"country":"India","description":"Design and develop machine learning and data mining algorithms<br> Must have hands-on experience in Java, C++, Python, Node JS, C#, programming<br>languages<br> Contribute to data mining techniques and applications using state-of-the-art<br>methods Hands on expertise in Artificial Intelligence, Machine Learning, Neural<br>www.innoviusconsultants.com<br>Networks, Human -Computer interaction, data science, applied mathematics and<br>Computer<br> Development of end to end AI based product. Discover, design, and develop<br>analytical methods to support novel approaches of data and information processing<br> Develop innovative products, modules and solutions<br> Explore and examine data from multiple disparate sources and communicate the<br>findings, orally and visually.<br> Develop and design algorithms and frameworks in terms of API to leverage this<br>data.<br> Develop and integrate algorithms in Tensorflow and Caffe<br> Given a business problem, estimate solution feasibility and potential approaches<br>based on available data<br> Ensure best practices for processing, cleansing, and verifying the integrity of data<br>used for analysis and learning<br> Quickly prototype solutions and build models to test feasibility of solution approach<br> Work across the spectrum of reporting and data visualization, statistical modeling<br>and supervised learning tools and techniques and apply the right level of solution to<br>the right problem<br> Research deep learning approaches: Develop and integrate deep learning<br>algorithms for transfer learning end-end reinforcement learning for control."},{"link":"https://www.monsterindia.com/seeker/job-details?id=1636253&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"MeanStack Developer","companyName":"Company Name Confidential","time":"2 days ago","location":"Hyderabad / Secunderabad","area":null,"country":"India","description":"<b>Roles &amp; Responsibilities<br></b><br><b>Responsibilities:<br></b><br><ul><li>Hands-on Design, Development &amp; Support of Software Solutions.<br></li><li>Architect and develop the next generation components for the Web platform.<br></li><li>Drive the design and build out of a new platform, including user-facing features and core back-end functionality.<br></li><li>Work in small, cross-functional teams committed to building cutting edge applications.<br></li><li>Innovate at a very fast pace to maintain our competitive edge. </li></ul><div><b>Eligibility<br></b><br>Experience: 4 to 6years</div>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1636058&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Developer Angular - Pune - Officer/C11 (R2040206)","companyName":"Citi","time":"2 days ago","location":"Pune","area":null,"country":"India","description":"<br>Job Description :<br>The Applications Development Intermediate Programmer Analyst is an intermediate level position responsible for participation in the establishment and implementation of new or revised application systems and programs in coordination with the Technology team. The overall objective of this role is to contribute to applications systems analysis and programming activities.<br><b><u>Responsibilities:</u></b><ul><li>Utilize knowledge of applications development procedures and concepts, and basic knowledge of other technical areas to identify and define necessary system enhancements, including using script tools and analyzing/interpreting code</li><li>Consult with users, clients, and other technology groups on issues, and recommend programming solutions, install, and support customer exposure systems</li><li>Apply fundamental knowledge of programming languages for design specifications.</li><li>Analyze applications to identify vulnerabilities and security issues, as well as conduct testing and debugging</li><li>Serve as advisor or coach to new or lower level analysts</li><li>Identify problems, analyze information, and make evaluative judgements to recommend and implement solutions</li><li>Resolve issues by identifying and selecting solutions through the applications of acquired technical experience and guided by precedents</li><li>Has the ability to operate with a limited level of direct supervision. </li><li>Can exercise independence of judgement and autonomy. </li><li>Acts as SME to senior stakeholders and /or other team members.</li><li>Appropriately assess risk when business decisions are made, demonstrating particular consideration for the firm's reputation and safeguarding Citigroup, its clients and assets, by driving compliance with applicable laws, rules and regulations, adhering to Policy, applying sound ethical judgment regarding personal behavior, conduct and business practices, and escalating, managing and reporting control issues with transparency.</li></ul><br><b><u>Qualifications:</u></b><ul><li>6-8 years of relevant experience in the Financial Service industry</li><li>Intermediate level experience in Applications Development role</li><li>Consistently demonstrates clear and concise written and verbal communication</li><li>Demonstrated problem-solving and decision-making skills</li><li>Ability to work under pressure and manage deadlines or unexpected changes in expectations or requirements</li></ul><br><b><u>Education:</u></b><ul><li>Bachelor’s degree/University degree or equivalent experience</li></ul><br>This job description provides a high-level review of the types of work performed. Other job-related duties may be assigned as required.<br><b><u>Mandatory Qualifications:</u></b><ul><li>Bachelor’s degree in Computer Science, Information Systems Management, or related field preferred</li></ul><ul><li>6-8 years of strong experience in UI technologies like Java Script, Angular Js, with expertise in design, development, performance tuning, troubleshooting and deployment.</li><li>Expert knowledge in Angular &amp; Angular js framework</li><li>Good Knowledge about Karma testing framework .</li><li>Strong knowledge about the Designing of UI frameworks.</li><li>Strong on the fundamentals of HTML5 Technologies, CSS 2/3</li><li>Good to have an exposure on SASS or Less or Stylus</li><li>Good understanding on reactive functional programming paradigm and its concepts.</li><li>Subject matter expert on JavaScript – till ES2015 and better to have understanding on ECMA future proposals</li><li>Hands on + solid experiences on Angular 4 &amp; above.</li><li>Good knowledge on Babel, Web pack, Grunt, Gulp etc.</li><li>Should be well versed with Web Sphere</li><li>Aware of Linux or UNIX.</li><li>Familiar with standard SDLC and Agile processes</li><li>Experience in Documentum is desirable.</li></ul><br><b><u>Desirable Qualifications:</u></b><ul><li>Experience with caching solution</li><li>Experience in leading a team and able to guide the team on complex technical implementation.</li><li>Experience with Android, iOS technologies, or mobile apis.</li><li>Ability to prioritize and manage schedules under tight, fixed deadlines</li><li>Ability to produce professional, technically-sound, and visually-appealing presentations and graphics</li><li>Strong writing, communication, time-management, decision-making, and basic task organization skills</li></ul><br>-------------------------------------------------<br><b>Job Family Group: </b>Technology<br>-------------------------------------------------<br><b>Job Family:</b>Applications Development<br>------------------------------------------------------<br><b>Time Type:</b><br>------------------------------------------------------<br>Citi is an equal opportunity and affirmative action employer.<br>Qualified applicants will receive consideration without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.<br>Citigroup Inc. and its subsidiaries (\"Citi) invite all qualified interested applicants to apply for career opportunities. If you are a person with a disability and need a reasonable accommodation to use our search tools and/or apply for a career opportunity review .<br>View the \"\" poster. View the .<br>View the .<br>View the "},{"link":"https://www.monsterindia.com/seeker/job-details?id=1636139&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Software Engineering","companyName":"JP Morgan Chase &amp; Co.","time":"2 days ago","location":"Hyderabad / Secunderabad","area":null,"country":"India","description":""},{"link":"https://www.monsterindia.com/seeker/job-details?id=1636121&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Software Engineering","companyName":"JP Morgan Chase &amp; Co.","time":"2 days ago","location":"Hyderabad / Secunderabad","area":null,"country":"India","description":"<br>Job Description :<br>As a member of our Software Engineering Group, we look first and foremost for people who are passionate around solving business problems through innovation and engineering practices. You'll be required to apply your depth of knowledge and expertise to all aspects of the software development lifecycle, as well as partner continuously with your many stakeholders on a daily basis to stay focused on common goals. We embrace a culture of experimentation and constantly strive for improvement and learning. You’ll work in a collaborative, trusting, thought-provoking environment—one that encourages diversity of thought and creative solutions that are in the best interests of our customers globally.<br>This role requires a wide variety of strengths and capabilities, including:<br><strong>Roles and Responsibilities</strong><ul><li>Designs, analyzes, develops automation framework/scripts, tests, debugs and documents programming to satisfy business requirements</li><li>Utilize excellent organizational skills, proven analytical, planning, problem solving and decision-making skills.</li><li>Ability to work proficiently and effectively in an Agile / Scrum feature team environment</li><li>Provide support to the application in terms of analyzing testing issues, maintaining the regression suite, build test data and build tests as per the acceptance criteria</li><li>Research new technologies, identify and learn best practice, adapt quickly and provide technical guidance to other team members</li><li>Adapt Devops model of continuous and automated integration, test and delivery</li><li>Work with multiple globally distributed teams to deliver end-to-end solution across regions</li></ul><br><strong>Required Skills</strong><ul><li>B.E/B.Tech/MCA degree</li><li>6+years Hands-on experience in designing and developing automation framework for Web based applications, APIs, etc</li><li>Comfortable in bothDevelopment andAutomation experience and sound knowledge in Java, Selenium, Cucumber, Maven, RestAssured, Chromium</li><li>2+ years of experience on testing applications withUI technologies such as Angular JS, React etc.</li><li>2+ year experience in designing automation scripts using BDD approach</li><li>2+ years of experience in working within an Agile team doing in-sprint automation development and managing integration scripts</li><li>Should have hands-on experience in using tools (or similar) like IntelliJ, Eclipse, GIT/BitBucket, BitBucket/Git/Gitflow and JIRA.</li><li>2+ years of experience onwriting complex SQL queries</li><li>Hands-on experience with all the levels of testing including Smoke, Usability, Functional, Integration, Regression, Re-testing, User Acceptance and System Testing.</li><li>Experience in developing tests for Windows as well as UNIX or LINUX environment.</li><li>Strong Team player abilities and Quick Learner, enthusiastic to learn new concepts and technologies.</li><li>Good communication skills</li><li>Good analytical skills for effective problem solving</li></ul><br><strong>Good to have skills</strong><ul><li>Experience in tools such as Jenkins</li><li>Awareness of using SQL, XML message formats is a plus.</li><li>Awareness of Cloud concepts</li></ul> "},{"link":"https://www.monsterindia.com/seeker/job-details?id=1635632&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Software Sr Engineer","companyName":"Wells Fargo","time":"2 days ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":""},{"link":"https://www.monsterindia.com/seeker/job-details?id=1635626&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Software Engineer","companyName":"Wells Fargo","time":"2 days ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"<br>Job Description :<br>About Wells Fargo<br>Wells Fargo &amp; Company (NYSE: WFC) is a leading global financial services company headquartered in San Francisco (United States). Wells Fargo has offices in over 30 countries and territories. Our business outside of the U.S. mostly focuses on providing banking services for large corporate, government and financial institution clients. We have worldwide expertise and services to help our customers improve earnings, manage risk, and develop opportunities in the global marketplace. Our global reach offers many opportunities for you to develop a career with Wells Fargo. Join our diverse and inclusive team where you will feel valued and inspired to contribute your unique skills and experience. We are looking for talented people who will put our customers at the center of everything we do. Help us build a better Wells Fargo. It all begins with outstanding talent. It all begins with you.<br>Market Job Description<br><strong>About Wells Fargo India<br></strong><br>Wells Fargo India and Philippines enables global talent capabilities for Wells Fargo Bank NA., by supporting over half of Wells Fargo's business lines and staff functions across Technology, Business Services, Risk Services and Knowledge Services. Wells Fargo operates in Hyderabad, Bengaluru and Chennai in India and in Manila, Philippines. Learn more about Wells Fargo India and Philippines at our International Careers website.<br><strong>Department Overview<br></strong><br>Enterprise Function Technology within the Enterprise Information Technology (EIT) business is responsible for supporting Enterprise Data technology, Enterprise technology initiatives related to messaging &amp; collaboration, risk technology, corporate systems data, and various internal systems and tools.<br><strong>About the Role<br></strong><br>Wells Fargo Enterprise Data technology team is seeking a hands-on experienced senior Java developer with experience knowledge on Big data Hadoop platform Access Control\\\\Entitlements and Privacera/Apache Ranger. The Job responsibilities include gathering and analyzing requirements and provisioning Entitlements on Hadoop/MapR platform. The position will be hands-on test automation using any frameworks or tools. The candidate should be comfortable working on multiple deliverables often with tight deadlines, write code, create automation test suit and unit test and assures quality, security and compliance for supported systems and applications.<br><strong>Responsibilities<br></strong><br><li><br>Java full stack development experience with exposure to Big data platforms like Hadoop/MapR</li><li><br>Strong Analytical skills </li><li><br>Gather and Analyze requirements and design solutions that meet the requirements</li><li><br>Meticulous in detailing and capturing Data Team needs</li><li><br>Good knowledge on Access Control / Entitlements for Big data platforms like MapR</li><li><br>Develop Test automation scripts using tools/frameworks</li><li><br>Experience or knowledge on Entitlements, Privacera or Apache Ranger</li><li><br>Provide UAT support &amp; needed assistance for release management activities. </li><br><strong>Essential Qualifications<br></strong><br><li><br>8-10 years of Java hands-on experience </li><li><br>Test Automation experience using Frameworks/Tools </li><li><br>Good communication skills</li><li><br>Quick learner, self-starter</li><li><br>Has good written and verbal communication skills, quick learner</li><li><br>Excellent team player, ability to work in a global team and follow through on deadlines</li><li><br>Preferring knowledge and hands-on experience working on Hadoop platform.</li><li><br>Ability to adapt to evolving technology, strong sense of responsibility.</li><br><strong>Desired Qualifications<br></strong><br><li><br>Experience on Big data Entitlements using Privacera or Apache Ranger will be huge plus</li><li><br>Experience working on Hadoop (MapR, HBASE, Hive etc.) </li><br>Market Skills and Certifications<br><strong><br>Essential Qualifications</strong><br><li><br>8 – 10 years of hands-on experience with Java and Spark development with restful Web services development/integration experience. </li><li><br>3+ years of UI development with Angular/React JS and integration experience</li><li><br>Exposure or experience in API integration and Groovy. </li><li><br>Strong knowledge of Database /Data concepts.</li><li><br>Good communication skills.</li><li><br>Quick learner, self-starter.</li><li><br>Has good written and verbal communication skills, quick learner.</li><li><br>Excellent team player, ability to work in a global team and follow through on deadlines. </li><li><br>Ability to adapt to evolving technology, strong sense of responsibility.</li><br><strong><br>Desired Qualifications</strong><br><li><br>Exposure to Data Quality tools like Databuck and Bigdata Platforms will be a huge plus</li><li><br>Exposure to Machine Learning will be a plus</li><li><br>Experience in developing and maintaining Autosys jobs</li><li><br>Experience in working in Agile projects</li><br>We Value Diversity<br>At Wells Fargo, we believe in diversity and inclusion in the workplace; accordingly, we welcome applications for employment from all qualified candidates, regardless of race, color, gender, national or ethnic origin, age, disability, religion, sexual orientation, gender identity or any other status protected by applicable law. We comply with all applicable laws in every jurisdiction in which we operate."},{"link":"https://www.monsterindia.com/seeker/job-details?id=1635627&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Software Sr Engineer","companyName":"Wells Fargo","time":"2 days ago","location":"Hyderabad / Secunderabad","area":null,"country":"India","description":"<br>Job Description :<br>About Wells Fargo<br>Wells Fargo &amp; Company (NYSE: WFC) is a leading global financial services company headquartered in San Francisco (United States). Wells Fargo has offices in over 30 countries and territories. Our business outside of the U.S. mostly focuses on providing banking services for large corporate, government and financial institution clients. We have worldwide expertise and services to help our customers improve earnings, manage risk, and develop opportunities in the global marketplace. Our global reach offers many opportunities for you to develop a career with Wells Fargo. Join our diverse and inclusive team where you will feel valued and inspired to contribute your unique skills and experience. We are looking for talented people who will put our customers at the center of everything we do. Help us build a better Wells Fargo. It all begins with outstanding talent. It all begins with you.<br>Market Job Description<br><strong><br>About Wells Fargo India<br></strong><br>enables global talent capabilities for Wells Fargo Bank NA., by supporting business lines and staff functions across Technology, Operations, Risk, Audit, Process Excellence, Automation and Product, Analytics and Modeling. We are operating in Hyderabad, Bengaluru and Chennai locations.<br><strong><br>About the Role<br></strong><br><li><br>This position will be an integral part of Wholesale Enrollments team within the CCIBT - TMPS technology group. Acts as a Sr. Developer in providing application coding, design guidance and consultation, utilizing a thorough understanding of applicable technology, tools and existing designs. Provides coding direction to team and develops highly complex original code. Oversees the preparation of test data, testing and debugging of programs. </li><br><strong><br>Responsibilities<br></strong><br><li><br>As a senior team member, ability understand the requirements, design documents and convert them into secure code by using <strong>Java/J2EE stack.</strong></li><li><strong><br>Capable of providing technical solutions</strong><br>to the business problems</li><li><br>Ability talk to different partners in understanding different systems and be able to negotiate and provide direction to business on technology and other partners.</li><li><br>Understand the risks and make all the stakeholders informed of the risks, plan and mitigate them on a timely basis.</li><li><br>Should have <strong>guided and mentored</strong> the junior team members in the technology.</li><li><br>Troubleshoot and tune for performance</li><br><strong><br>Essential Qualifications<br></strong><br><li><strong><br>Bachelor/Master</strong><br>degree with <strong>12+ years of IT</strong> experience <strong>in </strong><strong>application development and implementation experience using </strong><strong>Java/J2EE</strong><strong> stack with deeper knowledge in </strong><strong>Spring Core, Spring MVC, Spring Boot</strong><strong> Framework and API’s.</strong></li><li><strong><br>Considerable</strong><strong><br>experience and hands on with Cloud Management and services pertaining to PCF and AWS</strong></li><li><strong><br>8+ years of </strong><strong><br>Hibernate</strong><strong><br>/</strong><strong><br>JPA </strong><strong><br>experience</strong></li><li><strong><br>8+ years of </strong><strong><br>JAX-WS, Axis, SOAP, REST</strong><strong><br>web services development</strong><strong><br>experience</strong></li><li><strong><br>3+ years of </strong><strong><br>Micro Services and Cloud</strong><strong><br>experience</strong></li><li><strong><br>Well versed with services testing like </strong><strong><br>JMeter</strong><strong><br>and </strong><strong><br>SOAPUI</strong></li><li><strong><br>8+ years of </strong><strong><br>Oracle</strong><strong><br>and </strong><strong><br>SQL</strong><strong><br>experience</strong></li><li><br>Should have work experience in Java Script(ES5 &amp; ES6) ,Object oriented JavaScript, Ajax, JSON, React JS library, Responsive web development. Knowledge working with Node &amp; GIT.</li><li><br>Experience in implementation of Java, J2EE, and JS Design patterns.</li><li><br>Experience in writing unit cases using Junit, RTL/Mocha/Jasmine/Jest libraries.</li><li><br>Should be able to deploy the application in non-production environments on Linux platforms.</li><li><strong><br>3+ years of team</strong><br>leadership/management experience, leading 5+ member  <strong>development</strong> teams preferably in banking domain.</li><li><br>Familiar and direct experience of Agile development and dev ops tools such as Jira, confluence, Rally and automated regression testing</li><li><br>Should have worked on DEVOPS, CI/CD using GITHUB, MAVEN, Artifactory, UDeploy, Jenkins</li><br><strong><br>Desired Qualifications<br></strong><br><li><br>Certification in AWS or Cloud foundry (PCF) is plus</li><li><br>Hands on experience of Front End Technologies such as HTML5, Angular JS, and React JS is an added advantage.</li><li><br>Good verbal and written communication skills</li><li><br>Good problem solving and analytical skills</li><li><br>Exposure to banking domain is a plus</li><br>We Value Diversity<br>At Wells Fargo, we believe in diversity and inclusion in the workplace; accordingly, we welcome applications for employment from all qualified candidates, regardless of race, color, gender, national or ethnic origin, age, disability, religion, sexual orientation, gender identity or any other status protected by applicable law. We comply with all applicable laws in every jurisdiction in which we operate."},{"link":"https://www.monsterindia.com/seeker/job-details?id=1635620&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Software Engineer","companyName":"Wells Fargo","time":"2 days ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"<br>Job Description :<br>About Wells Fargo<br>Wells Fargo &amp; Company (NYSE: WFC) is a leading global financial services company headquartered in San Francisco (United States). Wells Fargo has offices in over 30 countries and territories. Our business outside of the U.S. mostly focuses on providing banking services for large corporate, government and financial institution clients. We have worldwide expertise and services to help our customers improve earnings, manage risk, and develop opportunities in the global marketplace. Our global reach offers many opportunities for you to develop a career with Wells Fargo. Join our diverse and inclusive team where you will feel valued and inspired to contribute your unique skills and experience. We are looking for talented people who will put our customers at the center of everything we do. Help us build a better Wells Fargo. It all begins with outstanding talent. It all begins with you.<br>Market Job Description<br><strong>About Wells Fargo India<br></strong><br>Wells Fargo India and Philippines enables global talent capabilities for Wells Fargo Bank NA., by supporting over half of Wells Fargo's business lines and staff functions across Technology, Business Services, Risk Services and Knowledge Services. Wells Fargo operates in Hyderabad, Bengaluru and Chennai in India and in Manila, Philippines. Learn more about Wells Fargo India and Philippines at our International Careers website.<br><strong>Department Overview<br></strong><br>Enterprise Function Technology within the Enterprise Information Technology (EIT) business is responsible for supporting Enterprise Data technology, Enterprise technology initiatives related to messaging &amp; collaboration, risk technology, corporate systems data, and various internal systems and tools.<br><strong>About the Role<br></strong><br>Wells Fargo Enterprise Data technology team is seeking a hands-on experienced senior Java developer with experience knowledge on Big data Hadoop platform Access Control\\\\Entitlements and Privacera/Apache Ranger. The Job responsibilities include gathering and analyzing requirements and provisioning Entitlements on Hadoop/MapR platform. The position will be hands-on test automation using any frameworks or tools. The candidate should be comfortable working on multiple deliverables often with tight deadlines, write code, create automation test suit and unit test and assures quality, security and compliance for supported systems and applications.<br><strong>Responsibilities<br></strong><br><li><br>Java full stack development experience with exposure to Big data platforms like Hadoop/MapR</li><li><br>Strong Analytical skills </li><li><br>Gather and Analyze requirements and design solutions that meet the requirements</li><li><br>Meticulous in detailing and capturing Data Team needs</li><li><br>Good knowledge on Access Control / Entitlements for Big data platforms like MapR</li><li><br>Develop Test automation scripts using tools/frameworks</li><li><br>Experience or knowledge on Entitlements, Privacera or Apache Ranger</li><li><br>Provide UAT support &amp; needed assistance for release management activities. </li><br><strong>Essential Qualifications<br></strong><br><li><br>8-10 years of Java hands-on experience </li><li><br>Test Automation experience using Frameworks/Tools </li><li><br>Good communication skills</li><li><br>Quick learner, self-starter</li><li><br>Has good written and verbal communication skills, quick learner</li><li><br>Excellent team player, ability to work in a global team and follow through on deadlines</li><li><br>Preferring knowledge and hands-on experience working on Hadoop platform.</li><li><br>Ability to adapt to evolving technology, strong sense of responsibility.</li><br><strong>Desired Qualifications<br></strong><br><li><br>Experience on Big data Entitlements using Privacera or Apache Ranger will be huge plus</li><li><br>Experience working on Hadoop (MapR, HBASE, Hive etc.) </li><br>Market Skills and Certifications<br><strong><br>Essential Qualifications</strong><br><li><br>8 – 10 years of hands-on experience with Java and Spark development with restful Web services development/integration experience. </li><li><br>3+ years of UI development with Angular/React JS and integration experience</li><li><br>Exposure or experience in API integration and Groovy. </li><li><br>Strong knowledge of Database /Data concepts.</li><li><br>Good communication skills.</li><li><br>Quick learner, self-starter.</li><li><br>Has good written and verbal communication skills, quick learner.</li><li><br>Excellent team player, ability to work in a global team and follow through on deadlines. </li><li><br>Ability to adapt to evolving technology, strong sense of responsibility.</li><br><strong><br>Desired Qualifications</strong><br><li><br>Exposure to Data Quality tools like Databuck and Bigdata Platforms will be a huge plus</li><li><br>Exposure to Machine Learning will be a plus</li><li><br>Experience in developing and maintaining Autosys jobs</li><li><br>Experience in working in Agile projects</li><br>We Value Diversity<br>At Wells Fargo, we believe in diversity and inclusion in the workplace; accordingly, we welcome applications for employment from all qualified candidates, regardless of race, color, gender, national or ethnic origin, age, disability, religion, sexual orientation, gender identity or any other status protected by applicable law. We comply with all applicable laws in every jurisdiction in which we operate."},{"link":"https://www.monsterindia.com/seeker/job-details?id=1635701&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Application Consultant: Site Reliability","companyName":"IBM","time":"2 days ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"<br>Job Description :<br>Introduction<br>IBM Application Consultants work directly with our clients on key initiatives. You will have the opportunity to build an in-depth understanding of their business issues and implement organizational strategies that drive adoption of change. We are looking for experts who can build credibility and trust with our clients and provide knowledge that addresses individual and unique business needs.<br>Your Role and Responsibilities<br><strong><br>Your day in the role will include...</strong><br>The Site Reliability Engineer is a critical role in Cloud based projects. An SRE works with the development squads to build platform &amp; infrastructure management/provisioning automation and service monitoring using the same methods used in software development to support application development. SREs create a bridge between development and operations by applying a software engineering mindset to system administration topics. They split their time between operations/on-call duties and developing systems and software that help increase site reliability and performance.<br><strong><br>You will come with...</strong><br>·Platform Architecture and Engineering – Ability to design, architect a Cloud platform that can meet Client SLAs /NFRs such as Availability, system performance etc. SRE will define the environment provisions framework, identify potential performance bottlenecks and design a cloud platform.<br>·Design/Build activities – ability to define coding standards, quality gates, security frameworks and ensure that they are comprehensively implemented across all design &amp; build activities.<br>·Run &amp; Manage activities – ability to work with Operations teams to define IPC processes, define monitoring frameworks, build automation runbooks, conceptualise and implement performance dashboards.<br>Required Technical and Professional Expertise<br><li><br>Platform Architecture and Engineering – Ability to design, architect a Cloud platform that can meet Client SLAs /NFRs such as Availability, system performance etc. SRE will define the environment provisions framework, identify potential performance bottlenecks and design a cloud platform.</li><li><br>Design/Build activities – ability to define coding standards, quality gates, security frameworks and ensure that they are comprehensively implemented across all design &amp; build activities.</li><li><br>Run &amp; Manage activities – ability to work with Operations teams to define IPC processes, define monitoring frameworks, build automation runbooks, conceptualise and implement performance dashboards.</li><li><br>Have development background (SDLC, Agile, Programming languages like JEE, .NET, Node JS etc, Code quality, security, Unit Testing)<br>Excellent DevOps Skills inlcuding IAAS, Jenkins, etc<br></li><br>Preferred Technical and Professional Expertise<br><li>Have good exposure to Operational aspects (Monitoring, Automation, Remediations) - Monitoring tools exposure like NewRelic, Prometheus, ELK, Distributed tracing, APM, App Dynamics, etc.</li><li>Troubleshooting and documenting Root cause analysis and automate the incident</li><li>Understands the Architecture</li><li>SRE mindset</li><li>Understands data model</li><li>Good knowledge on the infrastructure (Bare metal, OS, Cloud, networking)</li><li>Have performance engineering/testing exposure (testing, planning, analyzing)</li><br>About Business Unit<br>IBM Services is a team of business, strategy and technology consultants that design, build, and run foundational systems and services that is the backbone of the world's economy. IBM Services partners with the world's leading companies in over 170 countries to build smarter businesses by reimagining and reinventing through technology, with its outcome-focused methodologies, industry-leading portfolio and world class research and operations expertise leading to results-driven innovation and enduring excellence.<br>Your Life @ IBM<br>What matters to you when you’re looking for your next career challenge?<br>Maybe you want to get involved in work that really changes the world? What about somewhere with incredible and diverse career and development opportunities – where you can truly discover your passion? Are you looking for a culture of openness, collaboration and trust – where everyone has a voice? What about all of these? If so, then IBM could be your next career challenge. Join us, not to do something better, but to attempt things you never thought possible.<br>Impact. Inclusion. Infinite Experiences. Do your best work ever.<br>About IBM<br>IBM’s greatest invention is the IBMer. We believe that progress is made through progressive thinking, progressive leadership, progressive policy and progressive action. IBMers believe that the application of intelligence, reason and science can improve business, society and the human condition. Restlessly reinventing since 1911, we are the largest technology and consulting employer in the world, with more than 380,000 IBMers serving clients in 170 countries.<br>Location Statement<br>For additional information about location requirements, please discuss with the recruiter following submission of your application.<br>Being You @ IBM<br>IBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.<br>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1635693&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Package Consultant: Sterling","companyName":"IBM","time":"2 days ago","location":"Pune","area":null,"country":"India","description":"<br>Job Description :<br>Introduction<br>As a Package Consultant at IBM, get ready to tackle numerous mission-critical company directives. Our team takes on the challenge of designing, developing and re-engineering highly complex application components and integrating software packages using various tools. You will use a mix of consultative skills, business knowledge, and technical expertise to effectively integrate packaged technology into our clients business environment and achieve business results.<br>Your Role and Responsibilities<br>As a Package Consultant at IBM, get ready to tackle numerous mission-critical company directives. Our team takes on the challenge of designing, developing and re-engineering highly complex application components and integrating software packages using various tools. You will use a mix of consultative skills, business knowledge, and technical expertise to effectively integrate packaged technology into our clients business environment and achieve business results.<br><strong><br>Responsibilities:</strong><li><br>Participate in the software development, and package implementation using industry standard platforms Sterling</li><li><br>Ensure software developed is held to high quality standards through code and design reviews.</li><li><br>Interface with system integrators and IT engineers on projects to ensure proper adherence to SDLC and platform integrity.</li><li><br>Knowledge of any popular IDE (Eclipse), code repository (SVN, CVS, GitHub)</li><li><br>Experience to independently build and deploy Sterling OMS locally and on to any environment</li><br>Required Technical and Professional Expertise<br><li><br>Minimum 4-8 years of experience in IT Industry</li><li><br>Validated knowledge of the various modules in IBM Sterling OMS</li><li><br>Hands-on configuration and development experience using OOTB Sterling APIs in a minimum of one Sterling OMS implementation</li><li><br>Proficient in development of wrapper using Sterling OOTB APIs and configuring them as Sterling services (SDF)</li><li><br>Working knowledge of Sterling Store Web and Sterling Call Center</li><li><br>Customization knowledge of Sterling Store / Call Center web UI will be a huge plus</li><li><br>Ability to create Sterling OMS detailed technical design for business requirements</li><li><br>In-depth experience working with Sterling OMS interfaces with external systems using MQ, JMS</li><li><br>Ability to independently setup a local instance of Sterling OMS for development purpose</li><li><br>Solid understanding of core Java, servlets and web services (ReST &amp; SOAP)</li><li><br>Experience working with XMLs, XSLs and JSON</li><br>Preferred Technical and Professional Expertise<br><li><br>Experience working with Sterling Order Management on Cloud (OM SaaS)</li><li><br>Hands-on knowledge of microservices (Spring, Springboot)</li><li><br>Hands-on experience with UI technologies; Angular JS, React JS, GraphQL</li><li><br>You love collaborative environments that use agile methodologies to encourage creative design thinking and find innovative ways to develop with cutting edge technologies</li><li><br>Ambitious individual who can work under their own direction towards agreed targets/goals and with creative approach to work</li><li><br>Intuitive individual with an ability to manage change and proven time management</li><li><br>Proven interpersonal skills while contributing to team effort by accomplishing related results as needed</li><li><br>Up-to-date technical knowledge by attending educational workshops, reviewing publications</li><li><br>Working and configuration of any one application server; WAS, Weblogic, JBoss, etc</li><li><br>Exposure to one SQL database; DB2, Oracle, MySQL, etc</li><li><br>Basic knowledge of navigating through any one operating system; Linux or Windows</li><br>About Business Unit<br>IBM Services is a team of business, strategy and technology consultants that design, build, and run foundational systems and services that is the backbone of the world's economy. IBM Services partners with the world's leading companies in over 170 countries to build smarter business by reimagining and reinventing through technology, with its outcome-focused methodologies, industry-leading portfolio and world class research and operations expertise leading to results-driven innovation and enduring excellence.<br>Your Life @ IBM<br>What matters to you when you’re looking for your next career challenge?<br>Maybe you want to get involved in work that really changes the world? What about somewhere with incredible and diverse career and development opportunities – where you can truly discover your passion? Are you looking for a culture of openness, collaboration and trust – where everyone has a voice? What about all of these? If so, then IBM could be your next career challenge. Join us, not to do something better, but to attempt things you never thought possible.<br>Impact. Inclusion. Infinite Experiences. Do your best work ever.<br>About IBM<br>IBM’s greatest invention is the IBMer. We believe that progress is made through progressive thinking, progressive leadership, progressive policy and progressive action. IBMers believe that the application of intelligence, reason and science can improve business, society and the human condition. Restlessly reinventing since 1911, we are the largest technology and consulting employer in the world, with more than 380,000 IBMers serving clients in 170 countries.<br>Location Statement<br>For additional information about location requirements, please discuss with the recruiter following submission of your application.<br>Being You @ IBM<br>IBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.<br>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1635685&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Intern","companyName":"IBM","time":"2 days ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"<br>Job Description :<br>Introduction<br>At IBM, work is more than a job - it's a calling: To build. To design. To code. To consult. To think along with clients and sell. To make markets. To invent. To collaborate. Not just to do something better, but to attempt things you've never thought possible. Are you ready to lead in this new era of technology and solve some of the world's most challenging problems? If so, lets talk.<br>Your Role and Responsibilities<br>As a DevOps engineer in IBM Cloud organization, you will be working on development of functions and features for an award winning Cloud product as a part of a high growth software product market segment. You will participate in, practice and help evolve the Agile Methodology.<br>You are responsible to drive innovation within the product portfolio.<br><strong><br>Responsibilities:</strong><li><br>Deliver design, code and automated test cases for a Cloud product.</li><li><br>Apply principles of Agile and DevOps in day to day work.</li><li><br>Participate in planning of Epics and help architects and managers prepare estimations.</li><li><br>Handle interrupts such as customer issues.</li><li><br>Participate in daily scrums and technical initiatives for the organisation.</li><li><br>Drive innovation within the product portfolio.</li><li><br>Help in achieving a high customer satisfaction through technical deliverables.</li><br>Required Technical and Professional Expertise<br><li><br>Sound Knowledge in majority among NodeJS, Angular JS / React JS, Java / J2EE, Cloud and UI development.</li><li><br>Knowledge with Docker/Kubernetes and Jenkins will be added advantage.</li><li><br>Proven interpersonal skills and attitude</li><br>Preferred Technical and Professional Expertise<br><li><br>Ability to handle complex customer issues</li><li><br>Experience in improving Software product quality including creation of test cases to validate new function or minimize the risk of regressions</li><li><br>Participation in planning and sizing of work as part of an Agile DevOps Squad</li><li><br>Creation and improvement of software product documentation</li><br>About Business Unit<br>Digitization is accelerating the ongoing evolution of business, and clouds - public, private, and hybrid - enable companies to extend their existing infrastructure and integrate across systems. IBM Cloud provides the security, control, and visibility that our clients have come to expect. We are working to provide the right tools and environment to combine all of our client’s data, no matter where it resides, to respond to changing market dynamics.<br>Your Life @ IBM<br>What matters to you when you’re looking for your next career challenge?<br>Maybe you want to get involved in work that really changes the world? What about somewhere with incredible and diverse career and development opportunities – where you can truly discover your passion? Are you looking for a culture of openness, collaboration and trust – where everyone has a voice? What about all of these? If so, then IBM could be your next career challenge. Join us, not to do something better, but to attempt things you never thought possible.<br>Impact. Inclusion. Infinite Experiences. Do your best work ever.<br>About IBM<br>IBM’s greatest invention is the IBMer. We believe that progress is made through progressive thinking, progressive leadership, progressive policy and progressive action. IBMers believe that the application of intelligence, reason and science can improve business, society and the human condition. Restlessly reinventing since 1911, we are the largest technology and consulting employer in the world, with more than 380,000 IBMers serving clients in 170 countries.<br>Location Statement<br>For additional information about location requirements, please discuss with the recruiter following submission of your application.<br>Being You @ IBM<br>IBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.<br>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1635691&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Package Consultant: Sterling","companyName":"IBM","time":"2 days ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":""},{"link":"https://www.monsterindia.com/seeker/job-details?id=1635673&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"EMC Networker","companyName":"IBM","time":"2 days ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":""},{"link":"https://www.monsterindia.com/seeker/job-details?id=1635662&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"EDI Consultant","companyName":"IBM","time":"2 days ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"<br>Job Description :<br>Introduction<br>Software Developers at IBM are the backbone of our strategic initiatives to design, code, test, and provideindustry-leading solutions that make the world run today - planes and trains take off on time, bank transactions complete in the blink of an eye and the world remains safe because of the work our software developers do. Whether you are working on projects internally or for a client, software development is critical to the success of IBMand our clients worldwide. At IBM, you will use the latest software development tools, techniques and approaches and work with leading minds in the industry to build solutions you can be proud of.<br>Your Role and Responsibilities<br><li><br>As a EDI Specialist/Consultant you will be responsible to deliver to the Client mapping requests ensuring client satisfaction. A Developer who would work with delivery team to have the daily deliverables completed on time working on SaaS Applications</li><li><br>Delivery on Services side, Interaction with clients / on site leads to firm-up requirements </li><li><br>Regular &amp; prompt status updates </li><li><br>Ramp-up on new skills as per business need, </li><li><br>Active involvement in Knowledge sharing &amp; training sessions, </li><li><br>Readiness to work in two shifts, collaboration with the larger group.</li><br>Required Technical and Professional Expertise<br><li><br>0-3 years of industry experience</li><li><br>EDI knowledge/work experience</li><li><br>Exposure to SaaS applications</li><li><br>Working knowledge on Open programming languages such as Java, XML, Unix scripting.</li><li><br>Preferably 2 years of EDI mapping experience on IBM map editor tools.</li><br>Preferred Technical and Professional Expertise<br><li><br>Proven understanding of UI Interface development using Node and Angulas Js.</li><li><br>Application development programming using Python.</li><li><br>Programming Languages like Go should be known. </li><li><br>Familiar with NoSQL Databases. Good with AI services. </li><li><br>Should be willing to work on client and other associated delivery while scaling up based on demands.</li><br>About Business Unit<br>IBM’s Cloud and Cognitive software business is committed to bringing the power of IBM’s Cloud and Watson/AI technologies to life for our clients and ecosystem partners around the world. IBM provides you with the most comprehensive and consistent approach to development, security and operations across hybrid environments—with complete software solutions for business and IT operations, development, data science, security, and management. Our experts and software capabilities help organizations develop applications once and deploy them anywhere, integrate security across the breadth of their IT estate, and automate operations with management visibility. With IBM, you also have access to new skills and methods, governance and management approaches, and a deep ecosystem of industry experts and partners.<br>Your Life @ IBM<br>What matters to you when you’re looking for your next career challenge?<br>Maybe you want to get involved in work that really changes the world? What about somewhere with incredible and diverse career and development opportunities – where you can truly discover your passion? Are you looking for a culture of openness, collaboration and trust – where everyone has a voice? What about all of these? If so, then IBM could be your next career challenge. Join us, not to do something better, but to attempt things you never thought possible.<br>Impact. Inclusion. Infinite Experiences. Do your best work ever.<br>About IBM<br>IBM’s greatest invention is the IBMer. We believe that progress is made through progressive thinking, progressive leadership, progressive policy and progressive action. IBMers believe that the application of intelligence, reason and science can improve business, society and the human condition. Restlessly reinventing since 1911, we are the largest technology and consulting employer in the world, with more than 380,000 IBMers serving clients in 170 countries.<br>Location Statement<br>For additional information about location requirements, please discuss with the recruiter following submission of your application.<br>Being You @ IBM<br>IBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.<br>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1635659&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Application Developer: Java Full Stack","companyName":"IBM","time":"2 days ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"<br>Job Description :<br>Introduction<br>As an Application Developer, you will lead IBM into the future by translating system requirements into the design and development of customized systems in an agile environment. The success of IBM is in your hands as you transform vital business needs into code and drive innovation. Your work will power IBM and its clients globally, collaborating and integrating code into enterprise systems. You will have access to the latest education, tools and technology, and a limitless career path with the world’s technology leader. Come to IBM and make a global impact!<br>Your Role and Responsibilities<br><strong><br>Your day in the role will include...</strong><br><li><br>Expert in Backend and Front end technologies</li><li><br>Proven in developing and implementation and providing solutions to the given problem in all the Java technologies</li><li><br>Proficient in stitch together end to end application starting from front end web development, back end development, middleware integration and persisting data in no SQL or DBMS database </li><li><br>Strong into trends and directions of the Industry, marketplace and the players</li><li><br>Provide objective guidance without personal or political considerations </li><strong><br>You will come with...</strong><br><li><br>Hands on experience with JAVA 8 and above – Java 8 or higher. Should know both Spring and Hibernate. Spring 4 or above.</li><li><br>Should be experienced in OOP concepts well. Should be proficient in exception handling , collections, Abstract Classes and Interfaces, Constructors, File IO and Serialization, Collections (List, Map, Set), Access Specifiers, Exceptions (Checked, Unchecked), Generics, Java Keywords (Static, Final, Volatile, Synchronized, Transient), JVM and Memory Management, Multithreading and Synchronization, JSP/ Servlets,JMS . Should be skilled in one of the IDEs like Eclipse , IntelliJ. Should be conversant with Build tools like Ant , Maven.</li><li><br>Experience of working in HTML 5 , CSS3, Angular JS, Spring MVC, Spring Boot, REST API, JUnit </li><strong><br>How we’ll help you grow: </strong><br><li><br>You’ll have access to all the technical and management training courses that will help you</li><li><br>You’ll learn directly from guide developers in the field; our team leads love to mentor</li><li><br>You have the opportunity to work in many different areas to identify what really excites you</li><br>Required Technical and Professional Expertise<br><li><br>Java 8 , JEE, Spring Core, Spring Boot, Spring MVC, REST , Hibernate, Angular JS , Node JS, CSS3 , HTML5, Any RDBMS database (DB2, Postgre, MYSQL, Oracle etc.) and Sql knowledge , Git , Maven, Eclipse / Intellij, Design Patterns</li><br>Preferred Technical and Professional Expertise<br>• Microservices , Docker, Spring Cloud, GW<br>About Business Unit<br>IBM Services is a team of business, strategy and technology consultants that design, build, and run foundational systems and services that is the backbone of the world's economy. IBM Services partners with the world's leading companies in over 170 countries to build smarter business by reimagining and reinventing through technology, with its outcome-focused methodologies, industry-leading portfolio and world class research and operations expertise leading to results-driven innovation and enduring excellence.<br>Your Life @ IBM<br>What matters to you when you’re looking for your next career challenge?<br>Maybe you want to get involved in work that really changes the world. What about somewhere with incredible and diverse career and development opportunities – where you can truly discover your passion? Are you looking for a culture of openness, collaboration and trust – where everyone has a voice? What about all of these? If so, then IBM could be your next career challenge. Join us, not to do something better, but to attempt things you never thought possible.<br>Impact. Inclusion. Infinite Experiences. Do your best work ever.<br>About IBM<br>IBM’s greatest invention is the IBMer. We believe that progress is made through progressive thinking, progressive leadership, progressive policy and progressive action. IBMers believe that the application of intelligence, reason and science can improve business, society and the human condition. Restlessly reinventing since 1911, we are the largest technology and consulting employer in the world, with more than 380,000 IBMers serving clients in 170 countries.<br>Location Statement<br>For additional information about location requirements, please discuss with the recruiter following submission of your application.<br>Being You @ IBM<br>IBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.<br>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1635651&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Software Developer","companyName":"IBM","time":"2 days ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"<br>Job Description :<br>Introduction<br>Software Developers at IBM are the backbone of our strategic initiatives to design, code, test, and provideindustry-leading solutions that make the world run today - planes and trains take off on time, bank transactions complete in the blink of an eye and the world remains safe because of the work our software developers do. Whether you are working on projects internally or for a client, software development is critical to the success of IBMand our clients worldwide. At IBM, you will use the latest software development tools, techniques and approaches and work with leading minds in the industry to build solutions you can be proud of.<br>Your Role and Responsibilities<br><strong><br>Who you are:</strong><br>As a Software engineer in IBM Cloud organization,<li><br>You will be working on development of functions and features for an award winning SaaS product as a part of a high growth software product market segment.</li><li><br>Participate in, practice and help evolve the Agile Methodology</li><li><br>Drive innovation within the product portfolio</li><strong><br>What you’ll do:</strong><li><br>Deliver design, code and automated test cases for a SaaS product.</li><li><br>Apply principles of Agile in day to day work.</li><li><br>Participate in planning of Epics and help architects and managers prepare estimations.</li><li><br>Handle customer issues.</li><li><br>Participate in daily scrums and technical initiatives for the organisation.</li><li><br>Drive innovation within the product portfolio.</li><li><br>Help in achieving a high customer satisfaction through technical deliverables.</li><br><strong><br>How we’ll help you grow:</strong><li><br>You’ll have access to all the technical and management training courses you need to become the expert you want to be.</li><li><br>You’ll learn directly from expert developers in the field; our team leads love to mentor.</li><li><br>You will learn of other IBM initiatives to move your career forward within areas that really excite you.</li><br>Required Technical and Professional Expertise<br><li><br>0-2 years of software design and development experience on NodeJS, Angular JS / React JS</li><li><br>Experience in Java / J2EE, Cloud integration and UI development</li><li><br>Knowledge with Docker/Kubernetes and Jenkins will be added advantage.</li><li><br>Proven interpersonal skills and attitude</li><li><br>Ability to debug complex issues</li><li><br>Contribution to software product documentation</li><br>Preferred Technical and Professional Expertise<br><li><br>Experience in software problem solving &amp; diagnosis</li><li><br>Contributions in Github</li><br>About Business Unit<br>IBM’s Cloud and Cognitive software business is committed to bringing the power of IBM’s Cloud and Watson/AI technologies to life for our clients and ecosystem partners around the world. IBM provides you with the most comprehensive and consistent approach to development, security and operations across hybrid environments—with complete software solutions for business and IT operations, development, data science, security, and management. Our experts and software capabilities help organizations develop applications once and deploy them anywhere, integrate security across the breadth of their IT estate, and automate operations with management visibility. With IBM, you also have access to new skills and methods, governance and management approaches, and a deep ecosystem of industry experts and partners.<br>Your Life @ IBM<br>What matters to you when you’re looking for your next career challenge?<br>Maybe you want to get involved in work that really changes the world? What about somewhere with incredible and diverse career and development opportunities – where you can truly discover your passion? Are you looking for a culture of openness, collaboration and trust – where everyone has a voice? What about all of these? If so, then IBM could be your next career challenge. Join us, not to do something better, but to attempt things you never thought possible.<br>Impact. Inclusion. Infinite Experiences. Do your best work ever.<br>About IBM<br>IBM’s greatest invention is the IBMer. We believe that progress is made through progressive thinking, progressive leadership, progressive policy and progressive action. IBMers believe that the application of intelligence, reason and science can improve business, society and the human condition. Restlessly reinventing since 1911, we are the largest technology and consulting employer in the world, with more than 380,000 IBMers serving clients in 170 countries.<br>Location Statement<br>For additional information about location requirements, please discuss with the recruiter following submission of your application.<br>Being You @ IBM<br>IBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, pregnancy, disability, age, veteran status, or other characteristics. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.<br>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1635450&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Solace Admin","companyName":"Larsen &amp; Toubro Infotech Limited","time":"2 days ago","location":"India","area":null,"country":"India","description":"<br><strong> Job Description </strong><br>Expertise in installing , maintaining and configuring Solace Single instances as well as clustered instances, in High Availability mode.<br>Expertise in Installing, Configuring, Maintaining Software AG components including Integration Server, Trading Network Server, My webMethods Server(MWS), webMethods Broker,and BPM in Unix(Sun Solaris) and Linux(Red Hat) v9.7 and v9.9<br>Troubleshooting Integration server for problems in Server/Interface level.<br>Good working experience in webMethods Integration Server, Trading network Server, Solace Broker handling of 45+ Production Integration server connected with Broker and 20+ DQT Integration server connected with Broker, along with 20 single Solace instances and 10+ clustered instances.<br>Extensive working Knowledge in JDBC Adapter and SAP Adapters.<br>Have working knowledge in XML files and IDocs<br>Configuring and monitoring Solace instances via Soladmin and Nagios as well as Splunk; and webMethods Components via Internal Monitoring (services and scripts) and by using external Monitoring tools like Nagios and Data analyzing tool Splunk.<br>Knowledge in Shell Scripting.<br>Working experience in certificate and key pair creation, CSR creation and requesting CA for signing( in E2 and BPM).<br>Worked on VPN creation, ssl handling,Endpoint configurations ( in Solace). Installing &amp; configuring Solace PubSub + messaging platform v9.x on Redhat Servers.<br>Experience in deploying and managing applications and services in on premise and Docker containers. Configuring the message-vpn setup, Endpoints like queues and topics and DMQ, Creating the ACL profiles, client profiles and Client username and providing the access to the applications.<br>Providing the support to various environments (DEV,UAT,E2E, DR/Production) Configuring the Static bridges and dynamic bridges while configuring the Multi node Dynamic message routing.<br>Configuring the HA Configuration, Redundancy, Config-sync, message spool and site replication setup. Good experience in working on high availability failover activities from active node to standby node.<br>Configuring the SSL configuration and LDAP configurations for authentications. Responsible for the day to day monitoring and troubleshooting of application related issues and networking teams, debugging, troubleshooting and fixing the issues.<br>Escalating the vendor support team for fixing the issues. Having experience in upgradation/fix packs and DR Activities.<br>Monitoring the Health check status by using the Site-Activator.<br>Willingness / flexibility to work in different shift timing of support customers at different parts of the world.<br>Worked with 24/7 production control support and on-call support. "},{"link":"https://www.monsterindia.com/seeker/job-details?id=1635437&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"JAVA Script , CSS, HTML UI Developer","companyName":"Larsen &amp; Toubro Infotech Limited","time":"2 days ago","location":"India","area":null,"country":"India","description":"<br><strong> Job Description </strong><ul><li> Use markup languages like HTML to create user-friendly web pages and design responsive and mobile-based features. </li><li> The person should be able to design UI in all resolutions. </li><li> Collaborate with back-end developers and web designers to improve usability </li><li> Get feedback from, and build solutions for, users and customers </li><li> Hands on experience with markup languages like HTML, CS3, CSS etc. </li><li> Experience with JavaScript, CSS, jQuery, Node and Angular etc. </li><li> Familiarity with browser testing and debugging this UI Issue and fix that. </li><li> Familiarity with software like Adobe Suite and content management systems. </li><li> Knowledge on Git, stash to commit code on repository. </li><li> Familiar with troubleshoot existing design. CS3, CSS, SASS is must The person should be able to develop design in all resolutions. <strong><strong></strong></strong></li></ul> "},{"link":"https://www.monsterindia.com/seeker/job-details?id=1635416&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"SHAREPOINT-POWER-PLATFORM","companyName":"Larsen &amp; Toubro Infotech Limited","time":"2 days ago","location":"India","area":null,"country":"India","description":"<br><strong> Job Description </strong><br>Hands on experience in Web programming technologies (e.g. JQuery, Scripting in JavaScript, HTML5) ,C# .Net Framework, ASP.NET, XML, Microsoft SharePoint 2010/2013/SharePoint Online(Office 365)<br>Have a background in business application development with strong understanding of collaboration, intranet, extranet and public internet solutions, specifically on SharePoint technologies.<br>Strong Experience in developing Power Apps with CDS/model driven/canvas apps, MS Flow and SPFX, SP customization<br>Experience in O365 connectors, Teams channels, document and libraries, custome lists<br>Good knowledge and experience in C#, Asp.net coding, Bootstrap, HTML5, CSS3, Angular JS/React &amp; MVC will be added advantage<br>Good knowledge in SharePoint apps (Provider hosted &amp; SharePoint hosted). Should have knowledge in SharePoint Supporting tools such as Nintex &amp; Migration tools will be added advantage<br>Having good understanding of Microsoft SharePoint &amp; Web applications architecture and problem solving/analytical skills "},{"link":"https://www.monsterindia.com/seeker/job-details?id=1635412&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"UI Developer -React JS","companyName":"Larsen &amp; Toubro Infotech Limited","time":"2 days ago","location":"India","area":null,"country":"India","description":"<br><strong> Job Description </strong><br>5+ years of strong hands on experience in latest version of ReactJS, Redux Strong hold on JavaScript, ES6, ES7<br>Hands on experience in HTML5, CSS3, JS libraries like Dojo, Bootstrap, JQuery,<br>Hands on experience in creating on Rest APIs using SpringBoot.<br>Hands on experience in writing queries and optimizing them for large data sets in MongoDB and MySQL.<br>Exposure working in an agile development environment.<br>Strong analytical and problem-solving skills - Knowledge of SVNGit repository Knowledge of Agile &amp; Automation Unit Test Knowledge, experience in using Jest. Good Communication and client facing experience.<br>Practice and enforce Agile and Scrum development methodologies<br>Provide technical direction to the development teams including hands-on development of POCs where appropriate <strong><strong></strong></strong> "},{"link":"https://www.monsterindia.com/seeker/job-details?id=1635399&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"React + Java Spring Boot Developer","companyName":"Larsen &amp; Toubro Infotech Limited","time":"2 days ago","location":"Pune","area":null,"country":"India","description":""},{"link":"https://www.monsterindia.com/seeker/job-details?id=1603510&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Systems Analyst","companyName":"UST Global Singapore Pte Limited","time":"2 days ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":""},{"link":"https://www.monsterindia.com/seeker/job-details?id=1603324&searchId=43423c0a-63a0-42dc-8bc4-99685edca16c","name":"Software Developer","companyName":"UST Global Singapore Pte Limited","time":"2 days ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"<br>Job Description :<br>Job Description –.Net Developer<br>The.Net Developer role is to create and maintain enterprise software applications used across the organization. They are typically Web / Windows based (client Server) applications created using various Microsoft technologies. A penchant for new developments in the industry is a must. Good interpersonal skills are required for effective communication with the Business and Development teams.<br>• 2.5-3.5 years of Hands-On experience in web based applications<br>• Evaluate new tools &amp; technologies; deliver Proof-of-Concepts and define best practices.<br>• Create reference architecture(s) and framework(s) by understanding the broader requirements.<br>• Design experience with familiarity with design patterns.<br>• Requires working knowledge of design patterns with the ability to code to architectural documentation.<br>• Mentoring and providing technical support for other developers.<br>• Constantly strive towards improving the scalability and maintainability of the product by providing technical inputs wherever needed.<br>• Interacting effectively with Development Lead; Peers; Business System Analysts; and Quality Assurance Professionals on project activities/deliverables/issues.<br>• Able to see through code; troubleshoot and fix issues quickly.<br>• Troubleshoot and maintain the existing applications.<br>• Address complex issues technically both from the development standpoint.<br>Technical Skills:<br>• Mandatory: Hands on expertise with extensive C#; ASP.Net; Web API; MVC; Entity Framework; JQuery; Angular JS/ Angular 2 &amp; above.<br>• Experience in SQL programming (MS SQL2008 or higher).<br>Qualifications<br>• Bachelor's degree in Information Systems; Information Technology; Computer Science or Engineering (or a high school diploma/GED)<br>Desired Skills<br>• Evaluate existing implementations; recommend improvement opportunities where applicable<br>• Build a technical roadmap for upgrading the technology stack; work with product owners to plan; implement and rollout the changes while/along with supporting the products business releases<br>• Train and groom junior members in the team.<br>• Deliver artifacts using industry standard techniques.<br>• Ability to concisely explain technical concepts to non-technical audiences and present key business and technical value for a given solution architecture.<br>• Excellent presentation skills; ability to present to small and large groups of mixed business; technical; management; and leadership audiences.<br>• Excellent English communication skills; both written and verbal."}]