[{"link":"https://www.monsterindia.com/seeker/job-details?id=1637857&searchId=c7af840b-adcf-49ef-9ba7-a80f4c3372e5","name":"PHP Developer/PHP Programmer/Sr.PHP developer/Sr. PHP programmer/PHP/Laravel","companyName":"Markelytics Solutions India Private Limited","time":"4 minutes ago","location":"Mumbai, Mumbai City, Navi Mumbai, Thane","area":null,"country":"India","description":"<div>Openings in the department of Web Applications for Senior PHP developers.<br>Generic Job Description:<br>Key Requirements<br> Sound knowledge of technologies : Web Technologies like PHP, NodeJS etc and Frontend technologies like Javascript, Angular JS,etc<br> Excellent communication skills<br> Database experience (MySQL, Memcache, NoSQL)<br> API fluent (creation &amp; usage REST prefered)<br> Working knowledge of source control tools (git)<br> Ability to research, learn and implement new technologies in short time<br> Ability to work independently and as part of a team<br> Should have worked in all the stages of SDLC<br> AWS experience is a plus.<br>Responsibilities<br> Problem Solving Personality<br> Proactively manage multiple projects and coordinate activities with internal Engineering team<br> Solid understanding of OOP, AJAX, jQuery, NodeJS, NoSQL, Server management, Build &amp; Deployment, and MySQL.<br></div><div><br></div><div>If interested, please send your latest/updated resume to <b>[HIDDEN TEXT].</b></div><div><br></div><div><br></div>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637852&searchId=c7af840b-adcf-49ef-9ba7-a80f4c3372e5","name":"Java Developer","companyName":"Yellow Umbrella Group","time":"12 minutes ago","location":"Bhubaneswar","area":null,"country":"India","description":"<div><div><div><br></div></div></div><div><b>Position: Java Developer </b></div><div><br>Qualification\tB.Tech / MCA<br></div><div>Experience<b>:</b><b>2+ Yrs (CTC @ 22K)<br></b><br><b> : 4+ Yrs (CTC @ 32K)<br></b><br>Type of Hiring\tFull Time Employment </div><div><br>Location: <b>Bhubaneswar </b><br></div><div><br></div><div><u><b>Candidate Profile\t</b></u></div><div><u><b><br></b></u></div><div>1.\tCandidate should have very good technical skill in Java technologies </div><div>2.\tCandidate should be smart &amp; personality should be very good<br>3. Developing and designing using Adv. Java, Spring Boot, Hibernate / JPA and RDBMS<br>4.\tReceiving reports on errors and problems as experienced by clients concerning software<br>5.\tAssisting in the interpretation of customer reports and documentation of these reports<br>6.\tAssisting in the development of software test scenarios<br>7.\tAssisting in the implementation of software tests<br>8.\tAssisting in the investigation of client needs, requirements and specifications for software development<br>9.\tPreparation of reports on software development<br></div><div>if interested, share resume on [HIDDEN TEXT] or call me on 9560877128.</div><div><br></div><div>Regards, </div><div>Subhasis Mohanty</div><div>Yellow Umbrella Group</div><div>Cell : <b>09560877128</b></div>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637821&searchId=c7af840b-adcf-49ef-9ba7-a80f4c3372e5","name":"Data Engineer for UAE","companyName":"Vinirma Consulting Private Limited","time":"an hour ago","location":"United Arab Emirates","area":null,"country":"India","description":"VAM Systems is a Business Consulting, IT Solutions and Services company.<br>VAM Systems is currently looking for Data Engineer for our UAE operations with the following skillsets &amp; terms and conditions:<br>Skill set Required:<br>Essential:<br>•\tDemonstrable, strong analysis skills are a must.<br>•\tProgramming skills utilizing Scala, Java, T-SQL, JSON<br>•\tThe ability to create and debug complex stored procedures, SQL statements, views, triggers, and functions for MS SQL Server.<br>•\tDemonstrable, strong expertise in data modeling<br>•\tStrong Database administration skill for MS SQL Server, Oracle, and MS EDW<br>•\tAn understanding of utilizing Visual Studio and Team Foundation Server\\GitHub.<br>•\tExperience with MS Azure Cloud<br>•\tExperience with data modeling tools such as Erwin<br>•\tGood communication skills<br>Desirable:<br>•\tExperience with Tableau platform.<br>Years of Experience<br>Essential:<br>•\t4+ years’ experience of ETL development using Azure Data Factory\\SSIS<br>•\t4+ years’ experience of data modeling using Kimball.<br>•\t3+ years’ experience of Developing SQL queries, Stored Procedures, and Views.<br>•\t2+ years’ experience of Database administration<br>•\t1+ years’ experience of Databricks development<br>Desirable:<br>•\t2 years’ experience of Apache Spark<br>•\t2 Years experiences using Talend system<br>Qualifications<br>Essential:<br>•\tMicrosoft Certified Querying Microsoft SQL Server<br>•\tBachelor’s Degree in Computer Science<br>Desirable:<br>•\tCertificate in Talend<br>•\tAzure Data Engineer<br>JOB SCOPE<br>•\tResponsible for the understanding and documenting the business requirements,<br>•\tDeep understanding of ETL methodologies, Business Intelligence and Data Warehousing principles, approaches, technologies, and architectures including the concepts, designs and usage of data warehouses and data marts<br>•\tWorks closely with business and technical teams to understand, document, design, develop, code, and test ETL processes<br>•\tDemonstrated experience in ETL design and options to improve load and extract performance<br>•\tTranslate source to target mapping documents into ETL processes<br>•\tDesign, Develop, Test, Optimize and Deploy ETL code and stored procedures to perform all ETL related functions<br>•\tExperience with Agile methodologies<br>•\tDesign the data model for the BI system and other applications<br>•\tResponsible for designing/implementing/managing ETL processes using Azure Data Factory\\SSIS<br>•\tResponsible to administrate and maintain the SQL server Databases and Microsoft Enterprise Data warehouse.<br>•\tDeveloping Spark Job in Scala or Java.<br>•\tWrite, implement, and maintain appropriate ETL processes<br>•\tTroubleshooting any bug\\issue in the system and identifying the appropriate fix.<br>•\tResponsible for the Integrity, Maintenance and changes to the databases.<br>•\tMaximizing applications performance by monitoring performance, troubleshooting database.<br>•\tLead, train and support the work of other staff engaged in similar functions.<br>•\tMonitoring and maintain the following all the databases and al the ETL components<br>Terms and conditions<br>Joining time frame: (15 - 30 days)<br>The selected candidates shall join VAM Systems - UAE and shall be deputed to one of the Organizations in UAE.<br>Should you be interested in this opportunity, please send your latest resume in MS Word format at the earliest at joinus(at)vamsystems.com<br>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1620304&searchId=c7af840b-adcf-49ef-9ba7-a80f4c3372e5","name":"Lead Consultant, Java Full Stack Developer","companyName":"Genpact","time":"an hour ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"<br>Job Description :<br>Lead Consultant, Java<br>(https://careers.google.com/jobs#t=sq&amp;q=j&amp;li=20&amp;l=False&amp;jlo=en-US&amp;jc=PROGRAM_MANAGEMENT&amp;) : <b> Operations </b><br>Location: (https://www.google.com/maps/place/8+Rue+de+Londres,+75009+Paris,+France/@48.877418,2.329943,15z?_ga=2.141878834.162674710.1517466468-1035144028.1517466468)<br>With a startup spirit and 90,000+ curious and courageous minds, we have the expertise to go deep with the world\\u2019s biggest brands\\u2014and we have fun doing it. Now, we\\u2019re calling all you rule-breakers and risk-takers who see the world differently, and are bold enough to reinvent it. Come, transform with us.<br><b> Are you the One we are looking for? </b><br>If you are a go getter Peron with understanding of human dynamics in a complex and high stress environment, then you are the right person for the job!<br>We are inviting applications for the role of <b> Lead Consultant, Java </b><br>Responsibilities<br>We require a resource who will be responsible to collaborate with design team, technology, and architecture teams. Responsible for the usage of technologies across the existing client products. Build components, and perform integration testing. Design and maintain coding standards to improve user experience.<br>We will involve you in crafting and documenting of the software architecture based on existing architecture and inputs received from Client from time to time. This opportunity shall involve performing unit testing, integration testing and UAT as and when required. Also, engage with Client in requirement gathering, Status update on work, UAT and be the key partner in the overall engagement.<br>Your responsibilities shall include conducting compelling technical briefing &amp; demonstrations, undertake requirement gathering, Designing and Solutioning The candidate should have a technical capability to implement new technologies and articulate the solutions to the customer. Qualifications<br>Minimum qualifications <li> BE/B Tech/MCA/BCA </li><li> Excellent written and verbal communication skills </li><li> Technology Skills such as Java/J2EE, Spring Boot, Web Services, Oracle </li><li> We will give an opportunity to work with crafting and maintaining large Java based application in different middleware! </li> Preferred qualifications<br><li> Good experience in Core Java (1.8 or higher) and Spring framework (Core, AOP, Batch, JMS). </li><li> Good experience of developing multi-threaded and synchronization application </li><li> Shown delivery experience of Micro services APIs using Spring-boot, Oracle PL/SQL development and activities like Performance tuning / Optimization. Experience of using Git/Bitbucket, Maven/Bamboo, &amp; related tools. </li><li> Good Understanding of Agile Delivery Methodology &amp; experience in working with Scrum teams. Java8, Spring with Database &amp; Unix </li><br><b> Genpact is an Equal Opportunity Employer and considers applicants for all positions without regard to race, color, religion or belief, sex, age, national origin, citizenship status, marital status, military/veteran status, genetic information, sexual orientation, gender identity, physical or mental disability or any other characteristic protected by applicable laws. </b> Genpact is committed to creating a dynamic work environment that values diversity and inclusion, respect and integrity, customer focus, and innovation. For more information, visit www.genpact.com. Follow us on Twitter, Facebook, LinkedIn, and YouTube. "},{"link":"https://www.monsterindia.com/seeker/job-details?id=1569969&searchId=c7af840b-adcf-49ef-9ba7-a80f4c3372e5","name":"Senior Consultant - Analytics","companyName":"Genpact","time":"an hour ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"<br>Job Description :<br>With a startup spirit and 90,000+ curious and courageous minds, we have the expertise to go deep with the world\\u2019s biggest brands\\u2014and we have fun doing it. Now, we\\u2019re calling all you rule-breakers and risk-takers who see the world differently, and are bold enough to reinvent it. Come, transform with us. Inviting applications for the role of <b> Senior Consultant, Analytics </b><br>In this role, you will be responsible for handling projects involving audit analytics and continuous control monitoring.<br>Your role will function as an overlay of existing technical and domain specialists and bring value through principled audit analytics and solution management skills.<br>You will be encouraged to be passionate about the industry\\u2019s realities and problems and know how to tackle these using analytics and technology. Responsibilities<br><ul><li> Work with business partners to scope potential processes for automation and understand the efficiency impact of the automation </li><li> Ability to conceptualize appropriate logic for analyzing potential risk scenarios </li><li> Ability to understand requirements clearly and to be flexible in learning new data sources and technologies, meeting tight deadlines, and delivering quality reports for auditors. </li><li> Maintain strong customer focus by building positive relationships with clients, scheduling, conducting and making pitches on key client meetings. </li><li> Should be able to write/optimize sophisticated scripts in the technology of expertise. Should be able to review results and identify False positives basis business understanding </li><li> Should be a self-starter and eager to seek business problem using experience and skills </li><li> Play a key role in the development of less experienced staff through mentoring, training and advising. </li><li> Superb communication skills and willingness to stretch and multi-task </li><li> May be assigned on a project on a long term basis </li></ul> Skills Sets<br><ul><li> Knowledge of analytical tools \\u2013 </li><li> ACL, Qlikview/Tableau, SQL, Alteryx \\u2013 Should have any 2 or more </li><li> VBA, Power BI, Power Point, GRC Solutions \\u2013 Good to have </li></ul><b> Qualifications we seek in you! </b><br>Minimum qualifications<br><ul><li> Demonstrated ability in a related field of Audit\\ Business \\ Financial analytics (Non-banking </li></ul><b> Preferred qualifications </b><br><ul><li> Post Graduates\\u2013 MCom\\ MSc (IT)\\ MBA (IT)\\ BE </li><li> Confirmed process skills with an understanding of change control processes and handling critical production environments </li><li> Understanding of business process (Accounts Payable, Revenue, Fixed Asset, Inventory, MJEs etc.) from analytics requirements </li><li> Understanding of ERPs (SAP\\ JDE\\ Oracle\\ Concur etc.) \\u2013 Techno-Functional side (Tables and Reports) </li><li> Have worked on data analytics support work either as tool implementation, automation of control or MIS development </li></ul><br><b> Genpact is an Equal Opportunity Employer and considers applicants for all positions without regard to race, color, religion or belief, sex, age, national origin, citizenship status, marital status, military/veteran status, genetic information, sexual orientation, gender identity, physical or mental disability or any other characteristic protected by applicable laws. </b> Genpact is committed to creating a dynamic work environment that values diversity and inclusion, respect and integrity, customer focus, and innovation. For more information, visit www.genpact.com. Follow us on Twitter, Facebook, LinkedIn, and YouTube. "},{"link":"https://www.monsterindia.com/seeker/job-details?id=1560442&searchId=c7af840b-adcf-49ef-9ba7-a80f4c3372e5","name":"PeopleSoft PeopleTools Application Developer","companyName":"Accenture","time":"an hour ago","location":"Pune","area":null,"country":"India","description":"<br>Job Description<br><strong>About Accenture: </strong>Accenture is a leading global professional services company, providing a broad range of services in strategy and consulting, interactive, technology and operations, with digital capabilities across all of these services. We combine unmatched experience and specialized capabilities across more than 40 industries — powered by the world’s largest network of Advanced Technology and Intelligent Operations centers. With 513,000 people serving clients in more than 120 countries, Accenture brings continuous innovation to help clients improve their performance and create lasting value across their enterprises. Visit us at <ul><br><li><strong>Project Role :</strong>Application Developer</li><li><strong>Project Role Description :</strong>Design, build and configure applications to meet business process and application requirements.</li><li><strong>Management Level :</strong>11</li><li><strong>Work Experience :</strong>2.5-4 years</li><li><strong>Work location :</strong>Pune</li><li><strong>Must Have Skills :</strong>PeopleSoft PeopleTools</li><li><strong>Good To Have Skills :</strong>Oracle PeopleSoft General Ledger,PeopleSoft Financials Procure to Pay,PeopleSoft Financials Record to Report</li><li><strong>Job Requirements : </strong><ul><br><li><strong>Key Responsibilities : </strong>- PeopleSoft FSCM 9,1 or above - Should have experience in new development, modifications / medium to complex customization Online pages, App Engines, App Packages etc - Lead the effort to design, build and configure applications, acting as the primary point of contact PeopleSoft Technical and Functional knowledge - Sound understanding of PeopleSoft Business Process flows and transaction</li><br><li><strong>Technical Experience : </strong>- PeopleSoft People Tools, PeopleSoft Administration, - PeopleSoft upgrade, App Designer, People Code, SQR, - App Engine, App Packages, Integration Broker, PS/Query - Knowledge of configurations / setups of PeopleSoft Financials - Knowledge of General finance fundamental concepts / processes - Experience of financials modules like BI, AR, CM, KK, AP, Banking, AM, CM and GL</li><br><li><strong>Professional Attributes : </strong>- Good Communication skills ability to interact with client teams - Positive Attitude - Great at Time and Task Management - Quick Learning Ability - Deep and Broad Technical Experience - A Good Team Player - High-End User Focus - Good Analytical Skills - Should be able to work under pressure</li><br><li><strong>Educational Qualification : </strong>- BE/BTech Degree in Computer Science or related technical discipline</li><br><li><strong>Additional Information : </strong>Potential Shift work</li></ul></li></ul><br>Qualifications<br>15 years of full time education "},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637770&searchId=c7af840b-adcf-49ef-9ba7-a80f4c3372e5","name":"Oracle Applications Development Application Developer","companyName":"Accenture","time":"an hour ago","location":"Hyderabad / Secunderabad","area":null,"country":"India","description":"<br>Job Description<br><strong>About Accenture: </strong>Accenture is a leading global professional services company, providing a broad range of services in strategy and consulting, interactive, technology and operations, with digital capabilities across all of these services. We combine unmatched experience and specialized capabilities across more than 40 industries — powered by the world’s largest network of Advanced Technology and Intelligent Operations centers. With 513,000 people serving clients in more than 120 countries, Accenture brings continuous innovation to help clients improve their performance and create lasting value across their enterprises. Visit us at <ul><br><li><strong>Project Role :</strong>Application Developer</li><li><strong>Project Role Description :</strong>Design, build and configure applications to meet business process and application requirements.</li><li><strong>Management Level :</strong>9</li><li><strong>Work Experience :</strong>6-8 years</li><li><strong>Work location :</strong>Hyderabad</li><li><strong>Must Have Skills :</strong>Oracle Applications Development</li><li><strong>Good To Have Skills :</strong>No Technology Specialization</li><li><strong>Job Requirements : </strong><ul><br><li><strong>Key Responsibilities : </strong>1 This position will be responsible for doing analysis, design and implementation of Oracle Applications 2 Follow documentation, software development methodology, version control, unit testing, and migration standards 3 Work the team to achieve project release goals</li><br><li><strong>Technical Experience : </strong>1 Experience in SQL Oracle PL/SQL 2 TOAD 3 SQL Developer 4 Code, test Debug program 5 Good Knowledge on Oracle EBS 6 Experience on Integrations, Conversions Migrations</li><br><li><strong>Professional Attributes : </strong>1 Excellent problem solving and analytical skills 2 Strong organizational skills and the ability to adhere to deadlines with reliability and accuracy 3 The ability to communicate effectively with business users, managers, peers, project teams, etc</li><br><li><strong>Educational Qualification : </strong>Good to have Oracle PL/SQL Developer Certified Bachelor or Masters degree in computer science</li></ul></li></ul><br>Qualifications<br>15 years of full time education "},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637772&searchId=c7af840b-adcf-49ef-9ba7-a80f4c3372e5","name":"10-Senior Analyst-Marketing &amp; Customer Analytics","companyName":"Accenture","time":"an hour ago","location":"Mumbai","area":null,"country":"India","description":"<br>Job Description<br><b>Designation: </b>Management Level - 10-Senior Analyst<br><b>About Accenture</b><br>Accenture is a leading global professional services company, providing a broad range of services in strategy and consulting, interactive, technology and operations, with digital capabilities across all of these services. We combine unmatched experience and specialized capabilities across more than 40 industries - powered by the world's largest network of Advanced Technology and Intelligent Operations centers. With 513,000 people serving clients in more than 120 countries, Accenture brings continuous innovation to help clients improve their performance and create lasting value across their enterprises. Visit us at <b>Job Summary</b><br>You will be aligned with our Insights &amp; Intelligence vertical and help us generate insights by leveraging different analytics tools and techniques to deliver value to our clients. You will also help us apply your expertise in building world class solutions, conquering the business problems, addressing technical challenges using AI Platforms and technologies. You will be required to utilize the existing frameworks, standards, patterns to create architectural foundation and services necessary for AI applications that scale from multi-user to enterprise class and demonstrate self as an expert by actively blogging, publishing research papers and creating awareness in this emerging area.<br>You will be working as a part of Marketing &amp; Customer Analytics team which provides a set of processes that measure, manage and analyze marketing activities in order to provide actionable insights and recommendations to marketing organizations in terms of optimizing ROI &amp; performance efficiency in operations.Customer analytics is a process by which data from customer behavior is used to help make key business decisions via market segmentation and predictive analytics. This information is used by businesses for direct marketing, site selection, and customer relationship management. You should have exposure to digital marketing, A/B testing, MVT, Google Analytics/Site Catalyst.<br>The Campaign Management focuses on planning, executing, tracking and analysis of direct marketing campaigns. The team is responsible for the entire lifecycle of a marketing campaign, from inception to launch to evaluation of result. The team is accountable for analyzing the effectiveness of marketing campaigns using ROI calculations. The role may require for you to have a good understanding of digital marketing, email marketing and technologies like Salesforce Marketing Cloud, Salesforce CRM, Salesforce Automation studio, Google DV360 and Responsys.<br>Good to have skills: HTML (Hypertext Markup Language),Salesforce Marketing Cloud,Cascading Style Sheets (CSS),Good communication skills <b>Roles and Responsibilities</b><br>In this role you are required to do analysis and solving of increasingly complex problems. Your day to day interactions are with peers within Accenture. You are likely to have some interaction with clients and/or Accenture management. You will be given minimal instruction on daily work/tasks and a moderate level of instruction on new assignments. Decisions that are made by you impact your own work and may impact the work of others. In this role you would be an individual contributor and/or oversee a small work effort and/or team. Please note that this role may require you to work in rotational shifts.<br>Qualifications<br>Any Graduation "},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637771&searchId=c7af840b-adcf-49ef-9ba7-a80f4c3372e5","name":"Infrastructure Service Management Cloud Operations Administrator","companyName":"Accenture","time":"an hour ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"<br>Job Description<br><strong>About Accenture: </strong>Accenture is a leading global professional services company, providing a broad range of services in strategy and consulting, interactive, technology and operations, with digital capabilities across all of these services. We combine unmatched experience and specialized capabilities across more than 40 industries — powered by the world’s largest network of Advanced Technology and Intelligent Operations centers. With 513,000 people serving clients in more than 120 countries, Accenture brings continuous innovation to help clients improve their performance and create lasting value across their enterprises. Visit us at <ul><br><li><strong>Project Role : </strong>Cloud Operations Administrator</li><li><strong>Project Role Description : </strong>Work with the Service Delivery Manager to perform capacity management, billing/show back operations, and cost optimization activities across multiple cloud environments.</li><li><strong>Management Level : </strong>11</li><li><strong>Work Experience : </strong>2.5-4 years</li><li><strong>Work Location : </strong>Bengaluru</li><li><strong>Must Have Skills :</strong>Infrastructure Service Management</li><li><strong>Good To Have Skills :</strong>Cloud Infrastructure</li><li><strong>Job Requirements : </strong><ul><br><li><strong>Key Responsibilities : </strong>Change, Incident, Problem, Configuration Management, BizOps and SLA management</li><br><li><strong>Technical Experience : </strong>Candidate should have 2 years of experience in Cloud Infra Service Management</li><br><li><strong>Professional Attributes : </strong>Resource should have good communication skills Resource should have good analytical skills</li><br><li><strong>Educational Qualification : </strong>15 Years of Experience</li></ul></li></ul><br>Qualifications<br>15 years of full time education "},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637769&searchId=c7af840b-adcf-49ef-9ba7-a80f4c3372e5","name":"Microsoft Dynamics CRM Technical Application Developer","companyName":"Accenture","time":"an hour ago","location":"Gurgaon / Gurugram","area":null,"country":"India","description":"<br>Job Description<br><strong>About Accenture: </strong>Accenture is a leading global professional services company, providing a broad range of services in strategy and consulting, interactive, technology and operations, with digital capabilities across all of these services. We combine unmatched experience and specialized capabilities across more than 40 industries — powered by the world’s largest network of Advanced Technology and Intelligent Operations centers. With 513,000 people serving clients in more than 120 countries, Accenture brings continuous innovation to help clients improve their performance and create lasting value across their enterprises. Visit us at <ul><br><li><strong>Project Role :</strong>Application Developer</li><li><strong>Project Role Description :</strong>Design, build and configure applications to meet business process and application requirements.</li><li><strong>Management Level :</strong>9</li><li><strong>Work Experience :</strong>6-8 years</li><li><strong>Work location :</strong>Gurugram</li><li><strong>Must Have Skills :</strong>Microsoft Dynamics CRM Technical</li><li><strong>Good To Have Skills :</strong>No Technology Specialization</li><li><strong>Job Requirements : </strong><ul><br><li><strong>Key Responsibilities : </strong>a:CRM configuration, customization and development b: Must be knowledgeable in creating managed and unmanaged solutions</li><br><li><strong>Technical Experience : </strong>a: 4-6 year of experience in Microsoft Dynamics b:Must have experience with Dynamics 365 Customer Engagement c:Experience with CRM SDK and SDK tools d:Experience with PowerApps and Common Data Service CDS is a plus e: Working experience of code packaging tools such as Nuget is a plus</li><br><li><strong>Professional Attributes : </strong>a:Good Communication skills</li></ul></li></ul><br>Qualifications<br>15 years of full time education "},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637767&searchId=c7af840b-adcf-49ef-9ba7-a80f4c3372e5","name":"JDA Warehouse Management Application Support Engineer","companyName":"Accenture","time":"an hour ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"<br>Job Description<br><strong>About Accenture: </strong>Accenture is a leading global professional services company, providing a broad range of services in strategy and consulting, interactive, technology and operations, with digital capabilities across all of these services. We combine unmatched experience and specialized capabilities across more than 40 industries — powered by the world’s largest network of Advanced Technology and Intelligent Operations centers. With 513,000 people serving clients in more than 120 countries, Accenture brings continuous innovation to help clients improve their performance and create lasting value across their enterprises. Visit us at <ul><br><li><strong>Project Role :</strong>Application Support Engineer</li><li><strong>Project Role Description :</strong>Act as software detectives, provide a dynamic service identifying and solving issues within multiple components of critical business systems.</li><li><strong>Management Level :</strong>9</li><li><strong>Work Experience :</strong>6-8 years</li><li><strong>Work location :</strong>Bengaluru</li><li><strong>Must Have Skills :</strong>JDA Warehouse Management</li><li><strong>Good To Have Skills :</strong>No Technology Specialization</li><li><strong>Job Requirements : </strong><ul><br><li><strong>Key Responsibilities : </strong>1:Functional and technical design experience with JDA 1 Red Prairie WMS solution 2: Development experience with JDA Red 3: Prairie including: Configuration of package 4: Experience on MOCA , DDA, Jasper reports, JDA Integrator and JDA Connect</li><br><li><strong>Technical Experience : </strong>1: 6 Year experience with Supply Chain systems and solutions 2: Experience with Linux / Oracle or Windows SQL Server platforms 3: Unit / integration / system test development and execution, including test script development</li><br><li><strong>Professional Attributes : </strong>1: Should be a good team player with good communication skill, team manangement 2: Broad experience with Supply Chain systems and solutions 3: Experience with Linux / Oracle or Windows SQL Server platforms 4: Unit / integration / system test development and execution</li><br><li><strong>Educational Qualification : </strong>Technical Degree in Computer Science / IT</li></ul></li></ul><br>Qualifications<br>15 years of full time education "},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637764&searchId=c7af840b-adcf-49ef-9ba7-a80f4c3372e5","name":"Oracle Applications Development Application Developer","companyName":"Accenture","time":"an hour ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"<br>Job Description<br><strong>About Accenture: </strong>Accenture is a leading global professional services company, providing a broad range of services in strategy and consulting, interactive, technology and operations, with digital capabilities across all of these services. We combine unmatched experience and specialized capabilities across more than 40 industries — powered by the world’s largest network of Advanced Technology and Intelligent Operations centers. With 513,000 people serving clients in more than 120 countries, Accenture brings continuous innovation to help clients improve their performance and create lasting value across their enterprises. Visit us at <ul><br><li><strong>Project Role :</strong>Application Developer</li><li><strong>Project Role Description :</strong>Design, build and configure applications to meet business process and application requirements.</li><li><strong>Management Level :</strong>10</li><li><strong>Work Experience :</strong>4-6 years</li><li><strong>Work location :</strong>Bengaluru</li><li><strong>Must Have Skills :</strong>Oracle Applications Development</li><li><strong>Good To Have Skills :</strong>No Technology Specialization</li><li><strong>Job Requirements : </strong><ul><br><li><strong>Key Responsibilities : </strong>1 : Own complete delivery 2: Efficient Status handling 3: Metrics Management</li><br><li><strong>Technical Experience : </strong>1 Expertise in caching mechanisms, security feature and understanding of Oracle Applications Development 2 Ability to write clean, reliable and highly maintainable</li><br><li><strong>Professional Attributes : </strong>1 Proven problem-solving abilities and affinity to take on complex challenges 2 Professional with ability to properly handle internal and external confidential data 3 Ability to handle multiple modules/tasks, prioritize and meet deadlines</li></ul></li></ul><br>Qualifications<br>15 years of full time education "},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637766&searchId=c7af840b-adcf-49ef-9ba7-a80f4c3372e5","name":"Oracle Planning and Budgeting (EPBCS) Application Support Engineer","companyName":"Accenture","time":"an hour ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"<br>Job Description<br><strong>About Accenture: </strong>Accenture is a leading global professional services company, providing a broad range of services in strategy and consulting, interactive, technology and operations, with digital capabilities across all of these services. We combine unmatched experience and specialized capabilities across more than 40 industries — powered by the world’s largest network of Advanced Technology and Intelligent Operations centers. With 513,000 people serving clients in more than 120 countries, Accenture brings continuous innovation to help clients improve their performance and create lasting value across their enterprises. Visit us at <ul><br><li><strong>Project Role :</strong>Application Support Engineer</li><li><strong>Project Role Description :</strong>Act as software detectives, provide a dynamic service identifying and solving issues within multiple components of critical business systems.</li><li><strong>Management Level :</strong>10</li><li><strong>Work Experience :</strong>4-6 years</li><li><strong>Work location :</strong>Bengaluru</li><li><strong>Must Have Skills :</strong>Oracle Planning and Budgeting (EPBCS)</li><li><strong>Good To Have Skills :</strong>No Technology Specialization</li><li><strong>Job Requirements : </strong><ul><br><li><strong>Key Responsibilities : </strong>1: Good knowledge in database design 2: 5 years of working experience in Oracle Forms and Reports 3: Experience in Supporting Live Projects is a must 4: Good knowledge in converting the business requirements into relational data model 5: Good knowledge in creating Database and Database objects and writing complex SQL queries 6: Ability to exhibit strong discipline in the software development process</li><br><li><strong>Technical Experience : </strong>1: Hand on experience in Expertise in Oracle Forms and Reports 2: Experience in DBA is a strong plus Good prioritization skills 3: To delivery and maintenance of the software product or system or for a specific phase of the lifecycle 4: Apply knowledge of technologies, applications, methodologies, processes and tools to support a client, project or entity</li><br><li><strong>Professional Attributes : </strong>1: Good communication quick learner 2: Good problem solving skills to investigate and resolve various archiving issues 3: Good presentation skills 4: Good team handling skills 5: Ability to work under pressure</li><br><li><strong>Educational Qualification : </strong>Technical Degree in Computer Science / IT</li></ul></li></ul><br>Qualifications<br>15 years of full time education "},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637765&searchId=c7af840b-adcf-49ef-9ba7-a80f4c3372e5","name":"Informatica Axon Application Developer","companyName":"Accenture","time":"an hour ago","location":"Bengaluru / Bangalore","area":null,"country":"India"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637762&searchId=c7af840b-adcf-49ef-9ba7-a80f4c3372e5","name":"Spring Boot Application Developer","companyName":"Accenture","time":"an hour ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"<br>Job Description<br><strong>About Accenture: </strong>Accenture is a leading global professional services company, providing a broad range of services in strategy and consulting, interactive, technology and operations, with digital capabilities across all of these services. We combine unmatched experience and specialized capabilities across more than 40 industries — powered by the world’s largest network of Advanced Technology and Intelligent Operations centers. With 513,000 people serving clients in more than 120 countries, Accenture brings continuous innovation to help clients improve their performance and create lasting value across their enterprises. Visit us at <ul><br><li><strong>Project Role :</strong>Application Developer</li><li><strong>Project Role Description :</strong>Design, build and configure applications to meet business process and application requirements.</li><li><strong>Management Level :</strong>10</li><li><strong>Work Experience :</strong>4-6 years</li><li><strong>Work location :</strong>Bengaluru</li><li><strong>Must Have Skills :</strong>Spring Boot</li><li><strong>Good To Have Skills :</strong>No Technology Specialization</li><li><strong>Job Requirements : </strong><ul><br><li><strong>Key Responsibilities : </strong>1 Knowledge on DevOps tools in writing automated scripts - in Code build, Code Test and Code Review tools such as Junit, Mochita, Sonarqube, Sourceclear etc 2 Experience in Agile methodology 3 CI/CD enabled delivery experience 4 Able to work in Dev Ops culture mindset</li><br><li><strong>Technical Experience : </strong>1 Must have Skills Springboot /Core Java /AWS Lambda 2 3 to 4 years of experience is mandatory</li><br><li><strong>Professional Attributes : </strong>1 Candidate must have good communication skills Should be able manage Stakeholder and learn and adapt quickly</li><br><li><strong>Educational Qualification : </strong>15 years of full time education is mandatory</li><br><li><strong>Additional Information : </strong>NA</li></ul></li></ul><br>Qualifications<br>15 years of full time education "},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637763&searchId=c7af840b-adcf-49ef-9ba7-a80f4c3372e5","name":"Workday Core HCM Application Developer","companyName":"Accenture","time":"an hour ago","location":"Bengaluru / Bangalore","area":null,"country":"India"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637761&searchId=c7af840b-adcf-49ef-9ba7-a80f4c3372e5","name":"SAP Business Planning and Consolidation Application Developer","companyName":"Accenture","time":"an hour ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"<br>Job Description<br><strong>About Accenture: </strong>Accenture is a leading global professional services company, providing a broad range of services in strategy and consulting, interactive, technology and operations, with digital capabilities across all of these services. We combine unmatched experience and specialized capabilities across more than 40 industries — powered by the world’s largest network of Advanced Technology and Intelligent Operations centers. With 513,000 people serving clients in more than 120 countries, Accenture brings continuous innovation to help clients improve their performance and create lasting value across their enterprises. Visit us at <ul><br><li><strong>Project Role :</strong>Application Developer</li><li><strong>Project Role Description :</strong>Design, build and configure applications to meet business process and application requirements.</li><li><strong>Management Level :</strong>11</li><li><strong>Work Experience :</strong>2.5-4 years</li><li><strong>Work location :</strong>Bengaluru</li><li><strong>Must Have Skills :</strong>SAP Business Planning and Consolidation</li><li><strong>Good To Have Skills :</strong>No Technology Specialization</li><li><strong>Job Requirements : </strong><ul><br><li><strong>Key Responsibilities : </strong>1: Good working experience Various archiving technologies like OTAS, ILM etc from SAP end 2: Configuration and maintenance of Archiving objects 3: Creation and configuration of new archiving objects 4: TAANA analysis and residue analysis of archiving data 5: Experience of archiving compliance as per Audits and data integrity requirements</li><br><li><strong>Technical Experience : </strong>1: SAP Business Planning DP 2: DP Master Data CVC, Product, location master, Transportation lane etc 3: Heuristics, Optimizer, Deployment 4: Transport Load Builder 5: Production planning and detailed scheduling</li><br><li><strong>Professional Attributes : </strong>1: Good communication and written skills 2: Good problem solving skills to investigate and resolve various archiving issues 3: Good presentation skills 4: Good team handling skills 5: Ability to work under pressure</li></ul></li></ul><br>Qualifications<br>15 years of full time education "},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637758&searchId=c7af840b-adcf-49ef-9ba7-a80f4c3372e5","name":"ASP.NET MVC Application Developer","companyName":"Accenture","time":"an hour ago","location":"Bengaluru / Bangalore","area":null,"country":"India"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637760&searchId=c7af840b-adcf-49ef-9ba7-a80f4c3372e5","name":"SAP Business Planning and Consolidation Application Developer","companyName":"Accenture","time":"an hour ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"<br>Job Description<br><strong>About Accenture: </strong>Accenture is a leading global professional services company, providing a broad range of services in strategy and consulting, interactive, technology and operations, with digital capabilities across all of these services. We combine unmatched experience and specialized capabilities across more than 40 industries — powered by the world’s largest network of Advanced Technology and Intelligent Operations centers. With 513,000 people serving clients in more than 120 countries, Accenture brings continuous innovation to help clients improve their performance and create lasting value across their enterprises. Visit us at <ul><br><li><strong>Project Role :</strong>Application Developer</li><li><strong>Project Role Description :</strong>Design, build and configure applications to meet business process and application requirements.</li><li><strong>Management Level :</strong>10</li><li><strong>Work Experience :</strong>4-6 years</li><li><strong>Work location :</strong>Bengaluru</li><li><strong>Must Have Skills :</strong>SAP Business Planning and Consolidation</li><li><strong>Good To Have Skills :</strong>No Technology Specialization</li><li><strong>Job Requirements : </strong><ul><br><li><strong>Key Responsibilities : </strong>1: Good working experience Various archiving technologies like OTAS, ILM etc from SAP end 2: Configuration and maintenance of Archiving objects 3: Creation and configuration of new archiving objects 4: TAANA analysis and residue analysis of archiving data 5: Experience of archiving compliance as per Audits and data integrity requirements</li><br><li><strong>Technical Experience : </strong>1: SAP Business Planning DP 2: DP Master Data CVC, Product, location master, Transportation lane etc 3: Heuristics, Optimizer, Deployment 4: Transport Load Builder 5: Production planning and detailed scheduling</li><br><li><strong>Professional Attributes : </strong>1: Good communication and written skills 2: Good problem solving skills to investigate and resolve various archiving issues 3: Good presentation skills 4: Good team handling skills 5: Ability to work under pressure</li><br><li><strong>Additional Information : </strong>we need SAP BCS skilled resource for this RRD as we dont see SAP BCS as ABACUS skill</li></ul></li></ul><br>Qualifications<br>15 years of full time education "},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637759&searchId=c7af840b-adcf-49ef-9ba7-a80f4c3372e5","name":"Network Infrastructure SW/Application Tech Support Practitioner","companyName":"Accenture","time":"an hour ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"<br>Job Description<br><strong>About Accenture: </strong>Accenture is a leading global professional services company, providing a broad range of services in strategy and consulting, interactive, technology and operations, with digital capabilities across all of these services. We combine unmatched experience and specialized capabilities across more than 40 industries — powered by the world’s largest network of Advanced Technology and Intelligent Operations centers. With 513,000 people serving clients in more than 120 countries, Accenture brings continuous innovation to help clients improve their performance and create lasting value across their enterprises. Visit us at <ul><br><li><strong>Project Role :</strong>SW/Application Tech Support Practitioner</li><li><strong>Project Role Description :</strong>Act as the ongoing interface between the client and the system or application. Dedicated to quality, using exceptional communication skills to keep our world class systems running. Can accurately define a client issue and can interpret and design a resolution based on deep product knowledge.</li><li><strong>Management Level :</strong>11</li><li><strong>Work Experience :</strong>2.5-4 years</li><li><strong>Work location :</strong>Bengaluru</li><li><strong>Must Have Skills :</strong>Network Infrastructure</li><li><strong>Good To Have Skills :</strong>No Technology Specialization</li><li><strong>Job Requirements : </strong><ul><br><li><strong>Key Responsibilities : </strong>A: Plan and implement low to medium risk changes on production systemsB: Analyze and assess the impact and risk of low to medium risk changes on production systemsC: Resolve standard incidents affecting the operation or availability of systemsD: Daily Monitoring of Network Devices and Reporting E: Review the problem management register and identify and implement actionsF: Documentation Assist disaster recovery tests</li><br><li><strong>Technical Experience : </strong>A: Basics of OSI model TCP IP and IP SubnettingB: Understanding of Virtual MachinesC: Powershell scriptingD: Experience in configuration of Cisco Switches Routers and wireless devicesE: Good Troubleshooting skills in Cisco Switches and Routers</li><br><li><strong>Professional Attributes : </strong>A: Good verbal and written communication skill to connect with customer at varying levels of organization B: Ability to operate interdependently and make decision</li><br><li><strong>Educational Qualification : </strong>BE</li></ul></li></ul><br>Qualifications<br>15 years of full time education "},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637756&searchId=c7af840b-adcf-49ef-9ba7-a80f4c3372e5","name":"IBM Sterling Commerce Application Developer","companyName":"Accenture","time":"an hour ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"<br>Job Description<br><strong>About Accenture: </strong>Accenture is a leading global professional services company, providing a broad range of services in strategy and consulting, interactive, technology and operations, with digital capabilities across all of these services. We combine unmatched experience and specialized capabilities across more than 40 industries — powered by the world’s largest network of Advanced Technology and Intelligent Operations centers. With 513,000 people serving clients in more than 120 countries, Accenture brings continuous innovation to help clients improve their performance and create lasting value across their enterprises. Visit us at <ul><br><li><strong>Project Role :</strong>Application Developer</li><li><strong>Project Role Description :</strong>Design, build and configure applications to meet business process and application requirements.</li><li><strong>Management Level :</strong>10</li><li><strong>Work Experience :</strong>4-6 years</li><li><strong>Work location :</strong>Bengaluru</li><li><strong>Must Have Skills :</strong>IBM Sterling Commerce</li><li><strong>Good To Have Skills :</strong>No Technology Specialization</li><li><strong>Job Requirements : </strong><ul><br><li><strong>Key Responsibilities : </strong>a: Create Technical design, independently code, unit test, and deploy various components of IBM Sterling Commerce OMS like services b: Perform Database design for custom components c Support various phases of testing in Agile delivery Apply strong design, development, and troubleshooting skills to deliver quality work d: custom APIs, transactions, events, DB extensions etc e: Take initiative to research new concepts, and technologies quickly and work in a team-oriented, collaborative</li><br><li><strong>Technical Experience : </strong>a: Hands on knowledge of developing new features using IBM Sterling Commerce Order Management system b: Java/J2EE, XML, XSD, XSL, SOAP, REST Webservice, MQ is must Working knowledge of Spring Framework and latest Java/J2EE concepts c: Working knowledge of Agile methodology is a plus d: Object Oriented Analysis, SQL Oracle 11g, SQL Designer, SQL Developer e: IBM Rational Team Concert and Eclipse or RAD IDE Knowledge of Sterling Package implementation</li><br><li><strong>Professional Attributes : </strong>a: Technical Skill b: Consultant Mindset c: Development and testing skills d: Strong Communication Skills e: The Ability to be a Good Team Member</li></ul></li></ul><br>Qualifications<br>15 years of full time education "},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637755&searchId=c7af840b-adcf-49ef-9ba7-a80f4c3372e5","name":"Data Modeling Techniques and Methodologies Application Developer","companyName":"Accenture","time":"an hour ago","location":"Hyderabad / Secunderabad","area":null,"country":"India","description":"<br>Job Description<br><strong>About Accenture: </strong>Accenture is a leading global professional services company, providing a broad range of services in strategy and consulting, interactive, technology and operations, with digital capabilities across all of these services. We combine unmatched experience and specialized capabilities across more than 40 industries — powered by the world’s largest network of Advanced Technology and Intelligent Operations centers. With 513,000 people serving clients in more than 120 countries, Accenture brings continuous innovation to help clients improve their performance and create lasting value across their enterprises. Visit us at <ul><br><li><strong>Project Role :</strong>Application Developer</li><li><strong>Project Role Description :</strong>Design, build and configure applications to meet business process and application requirements.</li><li><strong>Management Level :</strong>10</li><li><strong>Work Experience :</strong>4-6 years</li><li><strong>Work location :</strong>Hyderabad</li><li><strong>Must Have Skills :</strong>Data Modeling Techniques and Methodologies</li><li><strong>Good To Have Skills :</strong>No Technology Specialization</li><li><strong>Job Requirements : </strong><ul><br><li><strong>Key Responsibilities : </strong>1 Design, build and configure applications to meet business process and application requirements 2 we need data modelers resources only</li><br><li><strong>Technical Experience : </strong>1Must have at least 4 yrs of exp in primary skill 2 Define and ensure data models are in conformance with relevant industry standards and best practices are followed 3 Document and maintain business glossary in the enterprise data catalog solution 4 Evaluate business data models and physical data models for variances and discrepancies 5 Guide project team to map physical data models to business glossary</li><br><li><strong>Professional Attributes : </strong>1 Work with business stakeholders and subject matter export SME to understand business processes and translate them into data models 2 Develop and maintain conceptual, logical, and Physical data models using Novartis data modeling guidelines</li><br><li><strong>Educational Qualification : </strong>1 Must have good knowledge and verbal analytical skills</li><br><li><strong>Additional Information : </strong>WE need Data Engineers/Architects resources</li></ul></li></ul><br>Qualifications<br>15 years of full time education "},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637752&searchId=c7af840b-adcf-49ef-9ba7-a80f4c3372e5","name":"Microsoft Teams Development Application Developer","companyName":"Accenture","time":"an hour ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"<br>Job Description<br><strong>About Accenture: </strong>Accenture is a leading global professional services company, providing a broad range of services in strategy and consulting, interactive, technology and operations, with digital capabilities across all of these services. We combine unmatched experience and specialized capabilities across more than 40 industries — powered by the world’s largest network of Advanced Technology and Intelligent Operations centers. With 513,000 people serving clients in more than 120 countries, Accenture brings continuous innovation to help clients improve their performance and create lasting value across their enterprises. Visit us at <ul><br><li><strong>Project Role :</strong>Application Developer</li><li><strong>Project Role Description :</strong>Design, build and configure applications to meet business process and application requirements.</li><li><strong>Management Level :</strong>10</li><li><strong>Work Experience :</strong>4-6 years</li><li><strong>Work location :</strong>Bengaluru</li><li><strong>Must Have Skills :</strong>Microsoft Teams Development</li><li><strong>Good To Have Skills :</strong>Node.js</li><li><strong>Job Requirements : </strong><ul><br><li><strong>Key Responsibilities : </strong>1 Developing and deploying Teams App for small, medium and large enterprise 2 Designing and Coding of Complex custom Microsoft Team Apps 3 Understanding of Microsoft Teams Platform and advise when and how new MS Teams components should be leveraged to address business requirements</li><br><li><strong>Technical Experience : </strong>1 Experience on Microsoft Teams and SharePoint online 2 Experience on Microsoft Power automate Office 365 is an added advantage 3 Designing and Coding of custom Microsoft Team Apps 4 Coding of custom Microsoft Teams App using C or Node JS 5 Experience of Java frameworks like AngularJS, React JS Knockout JS 6 Experience of ASPNET 35 and above, Microsoft Graph API, HTML 5, CSS 7 Experience of Microsoft Graph API, HTML 5, CSS</li><br><li><strong>Professional Attributes : </strong>1 Have outstanding verbal communications skills 2 Have good client expectation management and presentation skills 3 Ability to build expertise of other people 4 Should have good problem solving and analytical skills</li><br><li><strong>Educational Qualification : </strong>Full time 15 years of regular education</li><br><li><strong>Additional Information : </strong>Experience on Microsoft Power Apps Office 365 is an added advantage</li></ul></li></ul><br>Qualifications<br>15 years of full time education "},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637753&searchId=c7af840b-adcf-49ef-9ba7-a80f4c3372e5","name":"Microsoft Teams Development Application Developer","companyName":"Accenture","time":"an hour ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"<br>Job Description<br><strong>About Accenture: </strong>Accenture is a leading global professional services company, providing a broad range of services in strategy and consulting, interactive, technology and operations, with digital capabilities across all of these services. We combine unmatched experience and specialized capabilities across more than 40 industries — powered by the world’s largest network of Advanced Technology and Intelligent Operations centers. With 513,000 people serving clients in more than 120 countries, Accenture brings continuous innovation to help clients improve their performance and create lasting value across their enterprises. Visit us at <ul><br><li><strong>Project Role :</strong>Application Developer</li><li><strong>Project Role Description :</strong>Design, build and configure applications to meet business process and application requirements.</li><li><strong>Management Level :</strong>9</li><li><strong>Work Experience :</strong>6-8 years</li><li><strong>Work location :</strong>Bengaluru</li><li><strong>Must Have Skills :</strong>Microsoft Teams Development</li><li><strong>Good To Have Skills :</strong>Node.js</li><li><strong>Job Requirements : </strong><ul><br><li><strong>Key Responsibilities : </strong>1 Ability of designing, developing and deploying complex Teams App for small, medium and large enterprise 2 Designing and Coding of Complex custom Microsoft Team Apps 3 Understanding of Microsoft Teams Platform and advise when and how new MS Teams components should be leveraged to address business requirements 4 Identify, understand, define and evangelize best practices in technology 5 Define needed governance standards, principles, and guard rails to meet development best practices, data govern</li><br><li><strong>Technical Experience : </strong>1 Experience on Microsoft Teams and SharePoint online 2 Experience on Microsoft Power automate Office 365 is an added advantage 3 Ability of designing, developing and deploying complex Teams App for small, medium and large enterprise 4 Designing and Coding of Complex and Very Complex custom Microsoft Team Apps 5 Coding of custom Microsoft Teams App using C or Node JS 6 Experience of Java frameworks like AngularJS, React JS Knockout JS 7 Experience of ASPNET 35 and above, Microsoft Graph API,</li><br><li><strong>Professional Attributes : </strong>1 Have outstanding verbal communications skills 2 Have good client expectation management and presentation skills 3 Ability to build expertise of other people 4 Should have good problem solving and analytical skills</li><br><li><strong>Educational Qualification : </strong>Full time 15 years of regular education</li><br><li><strong>Additional Information : </strong>Experience on Microsoft Power Apps Office 365 is an added advantag</li></ul></li></ul><br>Qualifications<br>15 years of full time education "},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637754&searchId=c7af840b-adcf-49ef-9ba7-a80f4c3372e5","name":"SAP ECC PM Plant Maintenance Application Developer","companyName":"Accenture","time":"an hour ago","location":"Pune","area":null,"country":"India","description":"<br>Job Description<br><strong>About Accenture: </strong>Accenture is a leading global professional services company, providing a broad range of services in strategy and consulting, interactive, technology and operations, with digital capabilities across all of these services. We combine unmatched experience and specialized capabilities across more than 40 industries — powered by the world’s largest network of Advanced Technology and Intelligent Operations centers. With 513,000 people serving clients in more than 120 countries, Accenture brings continuous innovation to help clients improve their performance and create lasting value across their enterprises. Visit us at <ul><br><li><strong>Project Role :</strong>Application Developer</li><li><strong>Project Role Description :</strong>Design, build and configure applications to meet business process and application requirements.</li><li><strong>Management Level :</strong>9</li><li><strong>Work Experience :</strong>6-8 years</li><li><strong>Work location :</strong>Pune</li><li><strong>Must Have Skills :</strong>SAP ECC PM Plant Maintenance</li><li><strong>Good To Have Skills :</strong>No Function Specialization</li><li><strong>Job Requirements : </strong><ul><br><li><strong>Key Responsibilities : </strong>a: Experience with multiple implementation projects in S/4HANA as a developer / designer / lead b: Deliver SAP S4 HANA SAP ECC PM Plant Management projects c: Able to handle cross functional teams offshore-client site for project delivery</li><br><li><strong>Technical Experience : </strong>a: Should have Hands - on experience in Scope document, Business process study b: Experience in requirement analysis, Gap Identification, Business Blueprint, Process Mapping, Configuration, Functional and Technical Specifications Document, Test Case Document, Training Presentation, Configuration Guide and User Manual c: 5 years plus of professional experience in SAP ECC PM Plant Management Including SAP S/4 HANA</li><br><li><strong>Professional Attributes : </strong>a: Should have ability to handle client escalation b: Project delivery and Team management skill is mandatory c: Should have good analytical and troubleshooting skills</li></ul></li></ul><br>Qualifications<br>15 years of full time education "},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637749&searchId=c7af840b-adcf-49ef-9ba7-a80f4c3372e5","name":"React.js Application Developer","companyName":"Accenture","time":"an hour ago","location":"Hyderabad / Secunderabad","area":null,"country":"India","description":"<br>Job Description<br><strong>About Accenture: </strong>Accenture is a leading global professional services company, providing a broad range of services in strategy and consulting, interactive, technology and operations, with digital capabilities across all of these services. We combine unmatched experience and specialized capabilities across more than 40 industries — powered by the world’s largest network of Advanced Technology and Intelligent Operations centers. With 513,000 people serving clients in more than 120 countries, Accenture brings continuous innovation to help clients improve their performance and create lasting value across their enterprises. Visit us at <ul><br><li><strong>Project Role :</strong>Application Developer</li><li><strong>Project Role Description :</strong>Design, build and configure applications to meet business process and application requirements.</li><li><strong>Management Level :</strong>9</li><li><strong>Work Experience :</strong>6-8 years</li><li><strong>Work location :</strong>Hyderabad</li><li><strong>Must Have Skills :</strong>React.js</li><li><strong>Good To Have Skills :</strong>No Function Specialization</li><li><strong>Job Requirements : </strong><ul><br><li><strong>Key Responsibilities : </strong>a Work on low level design, application build and defect fixes per the business/ functional requirements b Create automated unit test cases c Adhere to the defined coding standards Where possible, recommend best practices to the lead in-charge d Perform peer review of teams build deliverables e Contribute to technical design and creation of reusable components f Application support may be part of the responsibility during the Post-Go Live Support phase</li><br><li><strong>Technical Experience : </strong>a 3 years of experience in Reactjs and sound knowledge of Reactjs hooks b 3 years of experience in Redux and Redux-form frameworks c 4 years of sound knowledge of TypeScript Object-Oriented JavaScript d 4 years of experience with HTML5, CSS3 and writing cross-browser compatible code e Experience creating self-contained, reusable, testable and performant modules/ components which extend the elements and components of core Reactjs f 4 years of experience writing unit tests using automated TDDtask</li><br><li><strong>Professional Attributes : </strong>a Candidate should be a good team player b Candidate should also demonstrate good analytical and problem-solving skills c Candidate should have good written and verbal communication skills</li><br><li><strong>Educational Qualification : </strong>any degree</li></ul></li></ul><br>Qualifications<br>15 years of full time education "},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637750&searchId=c7af840b-adcf-49ef-9ba7-a80f4c3372e5","name":"11-Augmented Insights","companyName":"Accenture","time":"an hour ago","location":"Mumbai","area":null,"country":"India","description":"<br>Job Description<br><b>Designation: </b>Management Level - 11-Analyst<br><b>About Accenture</b><br>Accenture is a leading global professional services company, providing a broad range of services in strategy and consulting, interactive, technology and operations, with digital capabilities across all of these services. We combine unmatched experience and specialized capabilities across more than 40 industries - powered by the world's largest network of Advanced Technology and Intelligent Operations centers. With 513,000 people serving clients in more than 120 countries, Accenture brings continuous innovation to help clients improve their performance and create lasting value across their enterprises. Visit us at <b>Job Summary</b><br>You will be aligned with our Insights &amp; Intelligence vertical and help us generate insights by leveraging different analytics tools and techniques to deliver value to our clients. You will also help us apply your expertise in building world class solutions, conquering the business problems, addressing technical challenges using AI Platforms and technologies. You will be required to utilize the existing frameworks, standards, patterns to create architectural foundation and services necessary for AI applications that scale from multi-user to enterprise class and demonstrate self as an expert by actively blogging, publishing research papers and creating awareness in this emerging area.<br>In the Augmented Insights team, you will be designing &amp; implementing solutions to convey functional &amp; industry insights through a range of user interfaces including visualization, voice &amp; natural language search. You will be working on data wrangling,information architecture,experience design,platform configuration. An understanding of platforms used for visualization &amp; the ability to understand audience needs through design thinking &amp; apply user-centric design approach is critical to this role.<br>In User Interface Design, you will be designing user interfaces for machines and software, such as computers, home appliances, mobile devices, and other electronic devices, with the focus on maximizing usability and the user experience. The team also works on writing use cases and test cases along with conducting UAT, functional, regression and usability testing.<br>Good to have skills: Content management,Good communication skills <b>Roles and Responsibilities</b><br>In this role you are required to do analysis and solving of lower-complexity problems. Your day to day interaction is with peers within Accenture before updating supervisors. In this role you may have limited exposure with clients and/or Accenture management. You will be given moderate level instruction on daily work tasks and detailed instructions on new assignments. The decisions you make impact your own work and may impact the work of others. You will be an individual contributor as a part of a team, with a focused scope of work. Please note that this role may require you to work in rotational shifts.<br>Qualifications<br>Any Graduation "},{"link":"https://www.monsterindia.com/job-vacancy-microsoft-dynamics-365-for-operations-finance-lead-wipro-limited-hyderabad-secunderabad-8-11-years-25292561.html","name":"Microsoft Dynamics 365 for Operations - Finance-Lead","companyName":"Wipro Limited","time":"an hour ago","location":"Hyderabad / Secunderabad","area":null,"country":"India"},{"link":"https://www.monsterindia.com/job-vacancy-microsoft-dynamics-365-for-operations-finance-developer-wipro-limited-hyderabad-secunderabad-5-8-years-25292559.html","name":"Microsoft Dynamics 365 for Operations - Finance-Developer","companyName":"Wipro Limited","time":"an hour ago","location":"Hyderabad / Secunderabad","area":null,"country":"India"},{"link":"https://www.monsterindia.com/job-vacancy-mcafee-antivirus-endpoint-protection-solution-eps-lead-administrator-wipro-limited-bengaluru-bangalore-5-8-years-25292551.html","name":"McAfee Antivirus Endpoint Protection Solution - EPS-Lead Administrator","companyName":"Wipro Limited","time":"an hour ago","location":"Bengaluru / Bangalore","area":null,"country":"India"},{"link":"https://www.monsterindia.com/job-vacancy-sap-ui5-and-fiori-lead-wipro-limited-bengaluru-bangalore-5-8-years-25292557.html","name":"SAP UI5 and Fiori-Lead","companyName":"Wipro Limited","time":"an hour ago","location":"Bengaluru / Bangalore","area":null,"country":"India"},{"link":"https://www.monsterindia.com/job-vacancy-telecom-service-provider-developer-wipro-limited-bengaluru-bangalore-3-5-years-25292555.html","name":"Telecom Service Provider-Developer","companyName":"Wipro Limited","time":"an hour ago","location":"Bengaluru / Bangalore","area":null,"country":"India"},{"link":"https://www.monsterindia.com/job-vacancy-soa-testing-developer-wipro-limited-pune-3-5-years-25292553.html","name":"SOA Testing-Developer","companyName":"Wipro Limited","time":"an hour ago","location":"Pune","area":null,"country":"India"},{"link":"https://www.monsterindia.com/job-vacancy-netapp-storage-lead-administrator-wipro-limited-pune-5-8-years-25292549.html","name":"Netapp Storage-Lead Administrator","companyName":"Wipro Limited","time":"an hour ago","location":"Pune","area":null,"country":"India"},{"link":"https://www.monsterindia.com/job-vacancy-vlsi-hvl-verification-vlsi-engineer-wipro-limited-bengaluru-bangalore-4-7-years-25292543.html","name":"VLSI HVL Verification-Vlsi Engineer","companyName":"Wipro Limited","time":"an hour ago","location":"Bengaluru / Bangalore","area":null,"country":"India"},{"link":"https://www.monsterindia.com/job-vacancy-utilities-transmission-and-distribution-partner-wipro-limited-bengaluru-bangalore-10-13-years-25292541.html","name":"Utilities Transmission and Distribution-Partner","companyName":"Wipro Limited","time":"an hour ago","location":"Bengaluru / Bangalore","area":null,"country":"India"},{"link":"https://www.monsterindia.com/job-vacancy-application-packaging-windows-lead-administrator-wipro-limited-pune-5-8-years-25292547.html","name":"Application Packaging - Windows-Lead Administrator","companyName":"Wipro Limited","time":"an hour ago","location":"Pune","area":null,"country":"India"},{"link":"https://www.monsterindia.com/job-vacancy-practice-delivery-head-crs-wipro-limited-bengaluru-bangalore-25292539.html","name":"Practice Delivery Head - CRS","companyName":"Wipro Limited","time":"an hour ago","location":"Bengaluru / Bangalore","area":null,"country":"India"},{"link":"https://www.monsterindia.com/job-vacancy-oracle-financials-cloud-revenue-management-and-collections-consultant-wipro-limited-hyderabad-secunderabad-5-8-years-25292535.html","name":"Oracle Financials Cloud - Revenue Management and collections-Consultant","companyName":"Wipro Limited","time":"an hour ago","location":"Hyderabad / Secunderabad","area":null,"country":"India"},{"link":"https://www.monsterindia.com/job-vacancy-telecom-service-provider-consultant-wipro-limited-noida-10-13-years-25292533.html","name":"Telecom Service Provider-Consultant","companyName":"Wipro Limited","time":"an hour ago","location":"Noida","area":null,"country":"India"},{"link":"https://www.monsterindia.com/job-vacancy-it-environment-management-support-lead-wipro-limited-hyderabad-secunderabad-5-8-years-25292527.html","name":"IT Environment Management Support-Lead","companyName":"Wipro Limited","time":"an hour ago","location":"Hyderabad / Secunderabad","area":null,"country":"India"},{"link":"https://www.monsterindia.com/job-vacancy-voip-testing-lead-wipro-limited-bengaluru-bangalore-5-8-years-25292525.html","name":"VoIP Testing-Lead","companyName":"Wipro Limited","time":"an hour ago","location":"Bengaluru / Bangalore","area":null,"country":"India"},{"link":"https://www.monsterindia.com/job-vacancy-websphere-admin-lead-administrator-wipro-limited-hyderabad-secunderabad-5-8-years-25292523.html","name":"WebSphere Admin-Lead Administrator","companyName":"Wipro Limited","time":"an hour ago","location":"Hyderabad / Secunderabad","area":null,"country":"India"},{"link":"https://www.monsterindia.com/job-vacancy-microsoft-dynamics-365-for-operations-finance-lead-wipro-limited-hyderabad-secunderabad-3-6-years-25292521.html","name":"Microsoft Dynamics 365 for Operations - Finance-Lead","companyName":"Wipro Limited","time":"an hour ago","location":"Hyderabad / Secunderabad","area":null,"country":"India"},{"link":"https://www.monsterindia.com/job-vacancy-privilege-password-management-ppm-cyberark-lead-wipro-limited-kolkata-5-8-years-25292529.html","name":"Privilege Password Management - PPM - CyberArk-Lead","companyName":"Wipro Limited","time":"an hour ago","location":"Kolkata","area":null,"country":"India"},{"link":"https://www.monsterindia.com/job-vacancy-fullstack-java-enterprise-developer-wipro-limited-bengaluru-bangalore-3-5-years-25292517.html","name":"Fullstack Java Enterprise-Developer","companyName":"Wipro Limited","time":"an hour ago","location":"Bengaluru / Bangalore","area":null,"country":"India"},{"link":"https://www.monsterindia.com/job-vacancy-linux-admin-lead-wipro-limited-pune-5-8-years-25292511.html","name":"Linux Admin-Lead","companyName":"Wipro Limited","time":"an hour ago","location":"Pune","area":null,"country":"India"},{"link":"https://www.monsterindia.com/job-vacancy-vlsi-hvl-verification-vlsi-lead-wipro-limited-cochin-kochi-ernakulam-5-8-years-25292501.html","name":"VLSI HVL Verification-Vlsi Lead","companyName":"Wipro Limited","time":"an hour ago","location":"Cochin / Kochi / Ernakulam","area":null,"country":"India"},{"link":"https://www.monsterindia.com/job-vacancy-microsoft-dynamics-365-customization-and-configuration-lead-wipro-limited-hyderabad-secunderabad-5-8-years-25292503.html","name":"Microsoft Dynamics 365 Customization and Configuration-Lead","companyName":"Wipro Limited","time":"an hour ago","location":"Hyderabad / Secunderabad","area":null,"country":"India"},{"link":"https://www.monsterindia.com/job-vacancy-telecom-service-provider-architect-wipro-limited-bengaluru-bangalore-10-13-years-25292505.html","name":"Telecom Service Provider-Architect","companyName":"Wipro Limited","time":"an hour ago","location":"Bengaluru / Bangalore","area":null,"country":"India"},{"link":"https://www.monsterindia.com/job-vacancy-fullstack-java-enterprise-lead-wipro-limited-pune-5-8-years-25292493.html","name":"Fullstack Java Enterprise-Lead","companyName":"Wipro Limited","time":"an hour ago","location":"Pune","area":null,"country":"India"},{"link":"https://www.monsterindia.com/job-vacancy-consulting-consultant-wipro-limited-bengaluru-bangalore-8-11-years-25292495.html","name":"Consulting-Consultant","companyName":"Wipro Limited","time":"an hour ago","location":"Bengaluru / Bangalore","area":null,"country":"India"},{"link":"https://www.monsterindia.com/job-vacancy-sap-basis-upgrade-consultant-wipro-limited-pune-5-8-years-25292497.html","name":"SAP Basis Upgrade-Consultant","companyName":"Wipro Limited","time":"an hour ago","location":"Pune","area":null,"country":"India"},{"link":"https://www.monsterindia.com/job-vacancy-infrastructure-cloud-computing-consulting-consultant-wipro-limited-hyderabad-secunderabad-5-8-years-25292483.html","name":"Infrastructure Cloud Computing Consulting-Consultant","companyName":"Wipro Limited","time":"an hour ago","location":"Hyderabad / Secunderabad","area":null,"country":"India"},{"link":"https://www.monsterindia.com/job-vacancy-linux-admin-administrator-wipro-limited-chennai-3-5-years-25292485.html","name":"Linux Admin-Administrator","companyName":"Wipro Limited","time":"an hour ago","location":"Chennai","area":null,"country":"India"},{"link":"https://www.monsterindia.com/job-vacancy-oracle-financials-cloud-revenue-management-and-collections-lead-wipro-limited-bengaluru-bangalore-5-8-years-25292487.html","name":"Oracle Financials Cloud - Revenue Management and collections-Lead","companyName":"Wipro Limited","time":"an hour ago","location":"Bengaluru / Bangalore","area":null,"country":"India"},{"link":"https://www.monsterindia.com/job-vacancy-microsoft-dynamics-365-for-operations-finance-developer-wipro-limited-hyderabad-secunderabad-8-11-years-25292481.html","name":"Microsoft Dynamics 365 for Operations - Finance-Developer","companyName":"Wipro Limited","time":"an hour ago","location":"Hyderabad / Secunderabad","area":null,"country":"India"},{"link":"https://www.monsterindia.com/job-vacancy-fullstack-java-enterprise-lead-wipro-limited-bengaluru-bangalore-5-8-years-25292469.html","name":"Fullstack Java Enterprise-Lead","companyName":"Wipro Limited","time":"an hour ago","location":"Bengaluru / Bangalore","area":null,"country":"India"},{"link":"https://www.monsterindia.com/job-vacancy-utilities-retail-industry-domain-consultant-wipro-limited-bengaluru-bangalore-8-10-years-25292477.html","name":"Utilities Retail Industry-Domain Consultant","companyName":"Wipro Limited","time":"an hour ago","location":"Bengaluru / Bangalore","area":null,"country":"India"},{"link":"https://www.monsterindia.com/job-vacancy-cloud-azure-admin-developer-wipro-limited-hyderabad-secunderabad-5-8-years-25292475.html","name":"Cloud Azure Admin-Developer","companyName":"Wipro Limited","time":"an hour ago","location":"Hyderabad / Secunderabad","area":null,"country":"India"},{"link":"https://www.monsterindia.com/job-vacancy-core-banking-project-manager-wipro-limited-bengaluru-bangalore-5-8-years-25292465.html","name":"Core Banking-Project Manager","companyName":"Wipro Limited","time":"an hour ago","location":"Bengaluru / Bangalore","area":null,"country":"India"},{"link":"https://www.monsterindia.com/job-vacancy-oracle-database-admin-administrator-wipro-limited-pune-10-13-years-25292457.html","name":"Oracle Database Admin-Administrator","companyName":"Wipro Limited","time":"an hour ago","location":"Pune","area":null,"country":"India"},{"link":"https://www.monsterindia.com/job-vacancy-lte-long-term-evolution-lead-wipro-limited-bengaluru-bangalore-5-8-years-25292459.html","name":"LTE-Long Term Evolution-Lead","companyName":"Wipro Limited","time":"an hour ago","location":"Bengaluru / Bangalore","area":null,"country":"India"},{"link":"https://www.monsterindia.com/job-vacancy-mscrm-functional-business-analyst-wipro-limited-hyderabad-secunderabad-5-8-years-25292467.html","name":"MSCRM Functional-Business Analyst","companyName":"Wipro Limited","time":"an hour ago","location":"Hyderabad / Secunderabad","area":null,"country":"India"},{"link":"https://www.monsterindia.com/job-vacancy-vlsi-verification-planning-vlsi-engineer-wipro-limited-bengaluru-bangalore-3-5-years-25292455.html","name":"VLSI-VERIFICATION PLANNING-Vlsi Engineer","companyName":"Wipro Limited","time":"an hour ago","location":"Bengaluru / Bangalore","area":null,"country":"India"},{"link":"https://www.monsterindia.com/job-vacancy-security-basics-lead-wipro-limited-chennai-5-8-years-25292449.html","name":"Security Basics-Lead","companyName":"Wipro Limited","time":"an hour ago","location":"Chennai","area":null,"country":"India"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637697&searchId=c7af840b-adcf-49ef-9ba7-a80f4c3372e5","name":"AWS SME/ Solution Architect","companyName":"Syntel Limited","time":"an hour ago","location":"Pune","area":null,"country":"India","description":"<br><strong>Roles and Responsibilities</strong><ul><li>Must have experience of 10-17 years in cloud platforms.</li><li>Able to Design modern data architecture using cloud platforms (AWS) and demonstrate Technical Cloud Architectural knowledge </li><li>Play a vital role in the design of production, staging, QA and development Cloud Infrastructures running in 24x7 environments.</li><li>Design and deploy enterprise-wide scalable operations on Cloud solution.</li><li>Deliver customer Cloud Strategies, aligned with customers business objectives and with a focus on Cloud Migrations.</li><li>Experience designing data architecture for private, public and hybrid cloud models </li><li>Provide leadership in infrastructure migration methodologies and techniques including mass application movements into the cloud including implementation of Azure or AWS within in large regulated enterprise environments.<br>Should have experience designing service management, orchestration, monitoring and management requirements of cloud platform</li><li>Nurture Cloud computing expertise internally and externally to drive Cloud Adoption</li><li>Strong understanding across Cloud and infrastructure components (server, storage, network, data, and applications) to deliver end to end Cloud Infrastructure architectures and designs.</li><li>Experience across multiple AWS Services, including S3, EC2, Redshift, RDS, EMR, DynamoDB, Neptune, Glue, Athena, Kinesis, Data Pipeline etc.</li><li>Excellent communication &amp; interpersonal skills</li><li>Ability to Understand and articulate the technical merits and value of Cloud computing<br></li></ul><br>Work Location: Pune<br>Interested professionals can share their profile directly on [HIDDEN TEXT]<br>"},{"link":"https://www.monsterindia.com/job-vacancy-java-solution-architect-synechron-technologies-private-limited-bengaluru-bangalore-14-18-years-25292445.html","name":"Java Solution Architect","companyName":"Synechron Technologies Private Limited","time":"an hour ago","location":"Bengaluru / Bangalore","area":null,"country":"India"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637699&searchId=c7af840b-adcf-49ef-9ba7-a80f4c3372e5","name":"Mulesoft Developer","companyName":"Aspire Systems India Private Limited","time":"an hour ago","location":"India","area":null,"country":"India","description":"<br>Job Description :<br>Qualification: Bachelor’s degree<br>Employment Type: (Permanent/Full-time)<br><strong>Pre-requisites</strong><ol><li>Experience working with business teams for Requirement Analysis</li><li>Expertise in design and development of MuleSoft, with real-time experience in DataWeave, SalesForce Connector, XSLT and API Management</li><li>Capable of building and deploying APIs independently</li><li>Skilled in building MuleSoft APIs with WSDL, XSD, REST and SOAP web-service</li><li>Ability to demonstrate JSON and XML Transformations</li><li>Proficiency in performing code review and complex code fixes</li><li>Hands-on experience in Integration Design Patterns; must have worked in a minimum of 2 projects, from inception to delivery</li><li>Exposure to API designer; able to design, create and implement API specifications along with mock services</li><li>Excellent communication skills</li><li>Mulesoft Certifications will be an added advantage</li></ol><br>We at Aspire Systems invest in health, career and future of our employees. Some of the key benefits we offer include medical insurance, professional development support, leadership development programs for women, cross-functional mobility for interested employees, mutual fund option (on completion of one year) and spot awards for outstanding performers.<br>If interested, please email your resume to "},{"link":"https://www.monsterindia.com/seeker/job-details?id=1521908&searchId=c7af840b-adcf-49ef-9ba7-a80f4c3372e5","name":"Software Engineer ","companyName":"Future Consultant Solutions","time":"2 hours ago","location":"Kolkata, Mumbai, Mumbai City, Navi Mumbai, Thane","area":null,"country":"India","description":"A standard Software Developer job description should include, but not be limited to: Researching, designing, implementing and managing software programs. Testing and evaluating new programs. Identifying areas for modification in existing programs and subsequently developing these modifications."},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637579&searchId=c7af840b-adcf-49ef-9ba7-a80f4c3372e5","name":"Identity And Access Management /IAM/TEAM LEAD/PROJECT MANAGER/Senior consultan/SYSTEM ADMIN/L3/","companyName":"3 Minds ESolutions Private Limited","time":"2 hours ago","location":"Bengaluru / Bangalore, Chennai","area":null,"country":"India","description":"<b>Position: Identity Access Management (L3)</b><br><b>Work Location:Chennai / Bangalore</b><br><b>Experience:4+years<br></b><br><b><br>Fulltime<br></b><br><b>Job Summary:<br></b><br>•Deep Level 3 SME knowledge of the following key MS infrastructure technologies and products: Active Directory, DNS.<br>. Experience in troubleshooting on-premises active directory infrastructure.<br>. Log analysis.<br>•Strong Windows 2003, Windows 2008 and Windows 2016 Administration experience working in large, rapidly changing environment.<br>•Design and implement with Windows 2003, Window 2008 and Windows 2016 AD infrastructures.<br>•Design and implement forest-level Group Policies and OU's.<br>•Actual design experience for a multiple forest environment.<br>•Must be able to assist in installation, configuration, tuning and troubleshooting of Active Directory on Win2K3/W2k8/W2016<br>•Experience in troubleshooting LDAP<br>•Must have experience working with <b>Windows 2003/2008/2016, Windows/AD support tools  </b>   <br>•Experience in Windows PowerShell scripting<br>· Working knowledge of AD LDS<br>· Must be self-motivated and able to work independently, often unsupervised<br>· Responsible for oversight of some projects assigned<br>· Assists management in the selection and retention of software applications, support staff, and on-going maintenance<br>· Provides project management assistance to the Project Manager for any project"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1094770&searchId=c7af840b-adcf-49ef-9ba7-a80f4c3372e5","name":"Identity And Access Management /IAM/TEAM LEAD/PROJECT MANAGER/Senior consultan/SYSTEM ADMIN/L3/","companyName":"3 Minds ESolutions Private Limited","time":"2 hours ago","location":"Gurgaon / Gurugram, Cochin / Kochi / Ernakulam","area":null,"country":"India","description":"<b>Position: Identity Access Management (L3)</b><br><b>Work Location:Cochin/Trivandrum</b><br><b>Experience:6+years<br></b><br><b><br>Fulltime<br></b><br><b>Job Summary:<br></b><br>•Deep Level 3 SME knowledge of the following key MS infrastructure technologies and products: Active Directory, DNS.<br>. Experience in troubleshooting on-premises active directory infrastructure.<br>. Log analysis.<br>•Strong Windows 2003, Windows 2008 and Windows 2016 Administration experience working in large, rapidly changing environment.<br>•Design and implement with Windows 2003, Window 2008 and Windows 2016 AD infrastructures.<br>•Design and implement forest-level Group Policies and OU's.<br>•Actual design experience for a multiple forest environment.<br>•Must be able to assist in installation, configuration, tuning and troubleshooting of Active Directory on Win2K3/W2k8/W2016<br>•Experience in troubleshooting LDAP<br>•Must have experience working with <b>Windows 2003/2008/2016, Windows/AD support tools  </b>   <br>•Experience in Windows PowerShell scripting<br>· Working knowledge of AD LDS<br>· Must be self-motivated and able to work independently, often unsupervised<br>· Responsible for oversight of some projects assigned<br>· Assists management in the selection and retention of software applications, support staff, and on-going maintenance<br>· Provides project management assistance to the Project Manager for any project"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637528&searchId=c7af840b-adcf-49ef-9ba7-a80f4c3372e5","name":"C++ Developer","companyName":"Emastech Consultancy services (OPC) Private Limited","time":"3 hours ago","location":"Hyderabad / Secunderabad","area":null,"country":"India","description":"<ul><li>Advanced C++ Programming Skills and strong in Data Structures and Algorithms</li><li>Advanced knowledge of Object Oriented Analysis and Design</li><li>Familiar with STL template</li><li>Hands on with with image processing libraries such as OpenCV</li><li>Hands on with audio processing libraries such as ffmpeg</li><li>Screening Questioners:</li><li>Need Strong experience in C++ Programming and Logic</li><li>End to End problem solving</li><li>Able to work in Linux OS</li><li>C++ Libraries experience is required</li><li>Experience with Integrating C++ &amp; Android</li><li>Should be strong hand on experience on any Image Libraries and Audio libraries (Good to have OpenCV/ ffmpeg experience)</li><li>Capture the libraries candidate has worked in Interview assessment sheet and rate his competency</li><li>Building libraries and worked on client side</li><li>Exposure on Android/IOS platform</li><li>Design, build, maintain efficient and reliable C++ code</li><li>Implement performance and quality modules</li><li>Good time management skills</li></ul><br>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637483&searchId=c7af840b-adcf-49ef-9ba7-a80f4c3372e5","name":" React Native Developer","companyName":"MNR Solutions Private Limited","time":"3 hours ago","location":"Pune","area":null,"country":"India","description":"<br>Job Description:<br>• Responsible for development of new highly-responsive, web-based user interface<br>• Construct visualizations that are able to depict vast amounts of data<br>• Learn and understand user interactions<br>• Develop a flexible and well-structured front-end architecture, along with the APIs to support it<br>• Understanding of REST APIs, the document request model, and offline storage<br>• Rock solid at working with third-party dependencies and debugging dependency conflicts<br>• Build pixel-perfect, buttery smooth UIs across both mobile platforms.<br>• Knowledge of Redux.<br>• Knowledge of ReactJS<br>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637460&searchId=c7af840b-adcf-49ef-9ba7-a80f4c3372e5","name":"Java Developer ","companyName":"Transtrack Aeroservices Private Limited","time":"4 hours ago","location":"Kolkata","area":null,"country":"India","description":"Position : Developer (Java, Angular 5+)<br>Location : Kolkata<br>Client : Ericsson Global<br>Employer : Transtrack Full TIme<br>Job Description:<br>1. Very good knowledge of Angular 5+<br>2. Very good knowledge of Java<br>3. Working knowledge of MySQL<br>4. Working knowledge of Sprint boot will be an added advantage<br>5. GitLab knowledge will be a big plus<br>6. Telecom domain knowledge would be a value add<br>Let me know if you would like to explore this opportunity and kindly share me below details :<br>Total years of experience:<br>Current Organization (Employer &amp; Client):<br>Current Designation:<br>Reporting to:<br>Present CTC (Fixed + Variable):<br>Expected CTC:<br>Notice Period:<br>Present Location:<br>Permanent Location:<br>Aadhar Card Number:<br>Interview availability:<br>Date of birth<br>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1547839&searchId=c7af840b-adcf-49ef-9ba7-a80f4c3372e5","name":"Java J2ee Developer ","companyName":"Company Name Confidential","time":"4 hours ago","location":"Mumbai","area":null,"country":"India","description":"Job Description :<br>- 4-9yrs relevant IT project experience.<br>- Agile project experience involving sprints &amp; continuous integration.<br>- Well-versed with Java 7+ platform &amp; scripting.<br>- Back-End Expertise<br>- Spring Framework expertise<br>- Spring Boot expertise<br>- Microservices Development<br>- Unit Testing (JUnit or equivalent)<br>Immediate to 15days joiners only"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637436&searchId=c7af840b-adcf-49ef-9ba7-a80f4c3372e5","name":"Software Engineers - Australia/Canada ","companyName":"A V Immigration And Careers Consultancy Private Limited","time":"4 hours ago","location":"Australia, Canada","area":null,"country":"India","description":"Tasks Include:<br><ul><li>researching, consulting, analysing and evaluating system program needs&nbsp;<br></li><li>identifying technology limitations and deficiencies in existing systems and associated processes, procedures and methods&nbsp;<br></li><li>testing, debugging, diagnosing and correcting errors and faults in an applications programming language within established testing protocols, guidelines and quality standards to ensure programs and applications perform to specification&nbsp;<br></li><li>writing and maintaining program code to meet system requirements, system designs and technical specifications in accordance with quality accredited standards&nbsp;<br></li><li>writing, updating and maintaining technical program, end user documentation and operational procedures&nbsp;<br></li><li>providing advice, guidance and expertise in developing proposals and strategies for software design activities such as financial evaluation and costings for recommending software purchases and upgrades&nbsp;<br></li></ul>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637434&searchId=c7af840b-adcf-49ef-9ba7-a80f4c3372e5","name":"Software Engineers - Australia/Canada ","companyName":"A V Immigration And Careers Consultancy Private Limited","time":"4 hours ago","location":"Australia, Canada","area":null,"country":"India","description":"Tasks Include:<br><ul><li>researching, consulting, analysing and evaluating system program needs&nbsp;<br></li><li>identifying technology limitations and deficiencies in existing systems and associated processes, procedures and methods&nbsp;<br></li><li>testing, debugging, diagnosing and correcting errors and faults in an applications programming language within established testing protocols, guidelines and quality standards to ensure programs and applications perform to specification&nbsp;<br></li><li>writing and maintaining program code to meet system requirements, system designs and technical specifications in accordance with quality accredited standards&nbsp;<br></li><li>writing, updating and maintaining technical program, end user documentation and operational procedures&nbsp;<br></li><li>providing advice, guidance and expertise in developing proposals and strategies for software design activities such as financial evaluation and costings for recommending software purchases and upgrades&nbsp;<br></li></ul>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637421&searchId=c7af840b-adcf-49ef-9ba7-a80f4c3372e5","name":"Mobile Application Developer ","companyName":"Js It Tech Solutions","time":"5 hours ago","location":"Hyderabad / Secunderabad","area":null,"country":"India","description":"Hi All,<br>GREETINGS FROM JS IT TECH SOLUTIONS!<br>We have an urgent requirement for Mobile App Developer<br>Position:Mobile App Developer<br>Exp:4-6 years<br>Notice period:Immediate to 15 days<br>Location: Hyderabad<br>Job Description:<br>SKILLS:<br>•\tHighly proficient with Ionic, Angular, Java Spring along with angular or react or Vue.js or flutter (any two of these skills), AWS or Azure, Kafka.<br>•\tExperience with Mobile App specifically hybrid model, MySQL, NoSQL<br>•\tGood exposure on scalable platform development<br>•\tExperience with agile methodologies<br>Contact : [HIDDEN TEXT]/ [HIDDEN TEXT]// 7893797028<br>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637417&searchId=c7af840b-adcf-49ef-9ba7-a80f4c3372e5","name":"Immediate Joinees Required for  Lead Data Engineer with Fintech Start-up in Bangalore","companyName":"Cerentral Consultants Private Limited","time":"5 hours ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"Responsibilities :<br>- Responsible to Ingest data from files, streams and databases. Process the data with Python and Pyspark and its storage into time series database.<br>- Develop programs in Python as part of data extraction, data cleaning, transformation and processing.<br>- Develop and maintain scalable data pipelines.<br>- Rest API's development.<br>Mandatory Skills :<br>- Overall 6 -8 years of experience as Data Engineer.<br>- Advanced working SQL knowledge to create complex queries.<br>- Experience in working with Time-series Database, relational databases as well as working familiarity with a variety of databases (structured &amp; Unstructured).<br>- Experience in designing and implementing scalable architecture.<br>- Good experience in doing object-oriented programming in python.<br>- Very strong in Object Oriented Analysis and Design (OOAD).<br>- Strong knowledge on REST APIs.<br>- Experience working on Azure Cloud services IaaS, PaaS.<br>- Hands on Experience in working on Microsoft Azure Services like ADLS/Blob Storage solutions, Event Hubs, Service Bus, scale sets, Load Balancers, Azure Functions, Databricks.<br>- Hands on Experience in working on Kafka.<br>- Knowledge on continuous integration/continuous deployment.<br>- Experience of data migration and deployment from On-Prem to Cloud environment and vice-versa.<br>- Individual Contributor.<br>Nice-to-Have Skills :<br>- Hands on experience on visualization tools like Grafana &amp; Power BI.<br>- Certification on any cloud platform.<br>- Hands on experience on Docker Containers and micro services architecture using Kubernetes.<br>- Hand on experience in Golang programming.<br>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637416&searchId=c7af840b-adcf-49ef-9ba7-a80f4c3372e5","name":"PHP Laravel AngularJs Developer","companyName":"Jupiter Consulting","time":"5 hours ago","location":"Pune","area":null,"country":"India","description":"Skills: PHP + Laravel +Angular JS<div><br></div><div>Remote Working(Work From Home facility available)</div><div><br></div><div>Exp: 5-10 yrs</div><div><br></div><div>Immediate Joiners preferred.</div><div><br></div><div>Interested candidates mail CV to [HIDDEN TEXT] with subject \"Full Stack\"</div>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637403&searchId=c7af840b-adcf-49ef-9ba7-a80f4c3372e5","name":"PHP Web Developer","companyName":"BitsNPixs Technologies Pvt. Ltd. ","time":"6 hours ago","location":"Nagercoil, Thiruvananthapuram / Trivandrum","area":null,"country":"India","description":"• Should be well versed with latest Laravel framework.<br>• Experience in Object oriented PHP programming, Understanding of MVC design patterns.<br>• Experience in web fundamentals HTML, JS, CSS and AJAX.<br>• Familiarity with front-end libraries and framework like jQuery, React, VueJs.<br>• Should be familiar with Git version control"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637332&searchId=c7af840b-adcf-49ef-9ba7-a80f4c3372e5","name":"Technical Analyst 3-Support","companyName":"Oracle","time":"7 hours ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"<br>Preferred Qualifications<br>Oracle%26#39;s Global Customer Support Team is seeking to add additional engineers to support Oracle customers with their respective technical issues and provide solutions working in Oracle facilities based in Bangalore, INDIA.<br>Position requires strong communication skills to assist in analyzing user requirements and understanding how customers apply application software to implement those requirements.<br>Must be able to:<br>- Understand, communicate and document complex technical issues and results.&nbsp;<br>- Apply diagnostic techniques to isolate specific scenarios to facilitate reproduction and correction of issues.<br>- Create and attempt alternate/experiments/approaches to help identify and/or workaround issues.<br>Preferred Skills include:<br>- Great customer service and communication skills<br>- Prior experience with Hyperion EPM products<br>- Strong troubleshooting skills<br>- Prior experience with enterprise class software applications<br>Detailed Description and Job Requirements<br>As a member of the Support organization, your focus is to deliver post-sales support and solutions to the Oracle customer base while serving as an advocate for customer needs. This involves resolving post-sales non-technical customer inquiries via phone and electronic means, as well as, technical questions regarding the use of and troubleshooting for our Electronic Support Services. A primary point of contact for customers, you are responsible for facilitating customer relationships with Support and providing advice and assistance to internal Oracle employees on diverse customer situations and escalated issues.<br>As a Sr. Support Engineer, you will be the technical interface to customers, Original Equipment Manufacturers (OEMs) and Value-Added Resellers (VARs) for resolution of problems related to the installation, recommended maintenance and use of Oracle products. Have an understanding of all Oracle products in their competencies and in-depth knowledge of several products and/or platforms. Also, you should be highly experienced in multiple platforms and be able to complete assigned duties with minimal direction from management. In this position, you will routinely act independently while researching and developing solutions to customer issues.<br>Job duties are varied and complex utilizing independent judgment. May have project lead role. 4 years experience with Core products or five years experience with Applications products and have a technical degree i.e., BS Computer Science/Management Information Systems/Science/ Engineering/Math/Physics/Chemistry with a 3.0 GPA OR (for Applications) proven professional/ technical experience, i.e., demonstrating an understanding of Applications at a functional and technical level (preferably Oracle)"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637329&searchId=c7af840b-adcf-49ef-9ba7-a80f4c3372e5","name":"Senior Software Engineer- Oracle Cloud Infrastructure (Join OCI-SDE)","companyName":"Oracle","time":"7 hours ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"<br>Preferred Qualifications<br>Detailed Description and Job Requirements<br>Design, develop, troubleshoot and debug software programs for databases, applications, tools, networks etc.<br>As a member of the software engineering division, you will assist in defining and developing software for tasks associated with the developing, debugging or designing of software applications or operating systems. Provide technical leadership to other software developers. Specify, design and implement modest changes to existing software architecture to meet changing needs.<br>Duties and tasks are varied and complex needing independent judgment. Fully competent in own area of expertise. May have project lead role and or supervise lower level personnel. BS or MS degree or equivalent experience relevant to functional area. 4 years of software engineering or related experience.<b>Oracle is an Affirmative Action-Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability, protected veterans status, age, or any other characteristic protected by law.</b><br>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637328&searchId=c7af840b-adcf-49ef-9ba7-a80f4c3372e5","name":"UI Principal Software Engineer - Oracle Cloud Infrastructure - Data Science","companyName":"Oracle","time":"7 hours ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"<br>Preferred Qualifications<br><b>Principal Software Engineer</b><br>The&nbsp;<b>Oracle Cloud Infrastructure (OCI)</b>&nbsp;team can provide you the opportunity to build and operate a suite of massive scale, integrated cloud services in a broadly distributed, multi-tenant cloud environment.&nbsp; OCI is committed to providing the best in cloud products that meet the needs of our customers who are tackling some of the world’s biggest challenges.&nbsp;<br>We offer unique opportunities for smart, hands-on engineers with the expertise and passion to solve difficult problems in distributed highly available services and virtualized infrastructure. &nbsp;At every level, our engineers have a significant technical and business impact&nbsp;designing and building innovative new systems to power our customer’s business critical applications.<br>This role is available on the&nbsp;<b>OCI Data Science&nbsp;</b>service. We are addressing exciting challenges at the intersection of data science and cutting-edge infrastructure. We are building a cloud service for data scientists, machine learning engineers and software engineers to help them every step of the way in their machine learning development and deployment lifecycle. Our product vision includes interactive notebooks, distributed machine learning on CPU/GPU supporting wide variety of ML algorithms/libraries, distributed model serving and robust monitoring and analytics of ML models.<br><b>What You’ll Do</b><ul><li>Build cloud service on top of the modern Infrastructure as a Service (IaaS) building blocks at OCI</li><li>Design and build distributed, scalable, fault tolerant software systems</li><li>Participate in the entire software lifecycle - development, testing, CI and production operations</li><li>Lead software projects without needing significant guidance and guide/mentor/coach junior engineers</li><li>Design software architecture for mission critical components and be able to get buy-in from the stakeholders on it including senior members of the team, software architects in the org and management</li><li>Balance between product feature development and production operational concerns like writing runbooks, ops automation, structured logging, instrumentation for metrics and events</li><li>Leverage plethora of internal tooling at OCI to develop, build, deploy and troubleshoot software</li><li>Participate in on-call for the service with the team</li></ul><br><b>Qualifications</b><ul><li>You have significant experience building distributed systems</li><li>You are highly proficient in Java</li><li>You are experienced at building highly available services, possessing knowledge of common service-oriented design patterns and service-to-service communication protocols</li><li>You are familiar with components of modern infrastructure like service discovery, secret storage, software-defined networking, etc.</li><li>You have experience with production operations on Cloud and good practices for putting quality code in production and troubleshoot issues when they arise</li><li>Take initiative and be responsible for delivering complex software by working effectively with the team and stakeholders. Proven track record of leading development with a team of individual contributors</li><li>You feel at home communicating technical ideas verbally and in writing (technical proposals, design specs, architecture diagrams and presentations)</li><li>Data science and machine learning knowledge would be very helpful</li></ul><br>&nbsp;<br>Detailed Description and Job Requirements<br>Design, develop, troubleshoot and debug software programs for databases, applications, tools, networks etc.<br>As a member of the software engineering division, you will take an active role in the definition and evolution of standard practices and procedures. You will be responsible for defining and developing software for tasks associated with the developing, designing and debugging of software applications or operating systems.<br>Work is non-routine and very complex, involving the application of advanced technical/business skills in area of specialization. Leading contributor individually and as a team member, providing direction and mentoring to others. BS or MS degree or equivalent experience relevant to functional area. 7 years of software engineering or related experience."},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637325&searchId=c7af840b-adcf-49ef-9ba7-a80f4c3372e5","name":"Applications Developer 5","companyName":"Oracle","time":"7 hours ago","location":"Bengaluru / Bangalore, Pune","area":null,"country":"India","description":"<br>Preferred Qualifications<br><strong>Description</strong><br>With tremendous market success in our Cloud Applications, especially in ERP Cloud, Higher Ed institutions have expressed unprecedented interest in embarking a cloud adoption journey with Oracle.&nbsp; Student Information Systems, a critical functional area to complete in our SaaS footprint for Higher Ed, is one top investment priority for Oracle.<br>The Senior Principal Software Engineer plays an important role in Oracle%26rsquo;s plan to disrupt the market. This role is responsible for developing key product features and differentiators for the Student Cloud. As part of the Higher Ed Development team, this role works with product strategy, product management, customers, development, UX, QA, etc.) and will also be mentoring and other developers.<br>This is a senior position. The successful candidate will develop a deep understanding of all (relevant) Oracle, industry and related technologies, Fusion tech stack and other cloud products, and will be responsible for the continuing development of a world class, scalable product architecture and intuitive Student Cloud products which will be used by institutions and students worldwide.<br>As a technical leader with the Oracle Student Cloud development team, you will work on and provide direction to projects that solve complex technical problems that provide substantial customer value and differentiator. You will be in regular interactions with other key executives, leaders and developers and work with team members spread across the globe. This is an extremely challenging, very fast paced, extremely rewarding and highly visible position.<br><strong>Responsibilities</strong><br>Build full stack prototypes and/or proof of concepts using libraries and frameworks.<br>Solve complex technical challenges and implement process amongst the development teams.<br>Provide technical and architectural leadership to a large, world-wide team.<br>Enforce application design patterns and development practices.<br>Leverage leadership abilities to inspire and influence others, internal and external teams<br>Build relationships and influence outside of authority while leveraging Oracle expertise and resources.<br>Research and present technical solutions to technical management and senior individual contributors.<br><strong>Requirements</strong><br>Deep architectural leadership experience in SaaS/Cloud as well as in enterprise software solutions.<br>Commercial experience as lead developer of complex cross application products and/or underlying infrastructure that has shipped and in use by large number of customers.<br>High degree of competence in written and verbal communication skills, including experience communicating with Executive audiences.<br>BS or MS degree or equivalent experience relevant to functional area, multiple domains preferred.<br>15+ years of software engineering and technical leadership experience.<br>Highly familiar with Agile methodologies and experience in guiding agile teams.<br>Excellent problem solving, critical thinking, and communication skills.<br>Self driven and highly motivated by meaningful and impactful work.<br>Ability to work in an extremely fast paced and challenging environment.<br>Excellent command of written and spoken English.<br>Passion and empathy for human/consumer centered design.<br><strong>Skills</strong><br>Backend<ul><br><li>Java/C#/Python or other object oriented language.</li><br><li>Deep knowledge of data modeling and query performance tuning.</li><br><li>Deep knowledge of REST service design and implementation.</li><br><li>Cloud Infrastructure design patterns.</li><br></ul><br>Front end<ul><br><li>Experienced with more than one JavaScript framework (Angular, React, etc%26hellip;).</li><br><li>Experienced with unit testing (Jasmine, Mocha, Chai, etc%26hellip;).</li><br><li>Experienced with functional automation testing, Selenium.</li><br><li>Experienced with JavaScript Build libraries.</li><br><li>Experienced in CSS/CSS pre compilers (SASS, LESS, etc%26hellip;).</li><br><li>Experienced in Mobile design and development.</li><br><li>UI Component design patterns.</li><br><li>JavaScript design patterns.</li><br><li>Experience with JavaScript ES5, JavaScript ES6, and/or TypeScript.</li><br><li>Experience with NPM, NodeJS, Deno</li><br></ul><br><strong>Bonus</strong><br>Expert in accessibility<br>Expert in data security<br>Expert in UI security<br>Advanced knowledge of pipeline tools (Jenkins, TeamCity)<br>Experience with: &nbsp;ADF, ADF REST, OCI, Oracle JET, Oracle Visual Builder<br>Detailed Description and Job Requirements<br>Analyze, design develop, troubleshoot and debug software programs for commercial or end user applications. Writes code, completes programming and performs testing and debugging of applications.<br>As a member of the software engineering division, you will specify, design and implement major changes to existing software architecture. Create new architecture for a moderate product or a portion of a major product. Build and execute unit tests and unit test plans. Review integration and regression test plans created by QA. Communicate with QA and porting engineering to ensure consistency, testability and portability across products in general.<br>Provide leadership and expertise in the development of new products/services/processes, frequently operating at the leading edge of technology. Recommends and justifies major changes to existing products/services/processes. BS or MS degree or equivalent experience relevant to functional area. 8 or more years of software engineering or related experience."},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637326&searchId=c7af840b-adcf-49ef-9ba7-a80f4c3372e5","name":"Software Developer 4","companyName":"Oracle","time":"7 hours ago","location":"Bengaluru / Bangalore, Pune","area":null,"country":"India","description":"<br>Preferred Qualifications<br><b>Preferred<br>Qualifications</b><br><b><br>Job Title:</b> Software DevOps Engineer 4<br><b><br>Job Location:</b> Budapest, Hungary - Texas, Frisco - India, Bengaluru, Pune<br><b><br>Organization:</b> GBU Cloud Development Services, Cloud Reliability Services<br><b><u><br>CRS Description</u></b><br><b><br>C</b>loud <b>R</b>eliability <b>S</b>ervices<br>(CRS) is a strategic component that will transform Oracle’s Global Business<br>Unit’s (GBU) cloud operations. As cloud service operations evolve from a<br>predominately re-active model (i.e., responding to emergencies with high levels<br>of human involvement) to a pro-active model (i.e., preventing emergencies and<br>outages with intelligent tools, services and automation), the mission of CRS<br>will ensure that all GBUs can efficiently operate ultra-scalable and<br>highly-reliable SaaS/Foundation services, across multiple operating models as<br>they iterate to become Cloud Native.<br><i><br>&nbsp;</i><br><b><u><br>Team description</u></b><br><i><br>&nbsp;</i><br>The<b> C</b>loud <b>R</b>eliability <b>S</b>ervices (CRS) team will build, deliver<br>and operate standardized services to enable Oracle’s GBUs to more effectively<br>operate their SaaS applications. &nbsp;The CRS team is a fast paced, highly<br>motivated team that embodies  We rather than  I.&nbsp; CRS will be a geo-diverse<br>team that will allow it to quickly respond to customer engagements and<br>challenges, and adapt quickly to incoming incidents while still delivering on<br>committed features and enhancements.<br><i><br>&nbsp;</i><br><b><u><br>Roles %26amp;<br>Responsibilities</u></b><br><i><br>&nbsp;</i><br>The candidate<br>will work with highly skilled, highly motivated engineers using Agile<br>methodologies based on Scrum or Kanban, and incorporating enterprise agile<br>practices from Scaled Agile Framework (SAFe). The team embraces a DevOps<br>environment - the Developers are the Operators. The work environment is to<br>treat everything as code (code, configuration, infrastructure, pipelines,<br>everything) to achieve the highest quality product in the most efficient amount<br>of time.&nbsp;<br>You will work<br>alongside a software development team within the greater Oracle Cloud<br>Reliability Engineering team where you will develop new features as well as<br>expand and support existing features. One week you may be writing automated<br>tests for an existing feature. The next week you may be developing a new<br>feature (design, code, test, and deploy) for a customer in our environment. The<br>next week you may be providing support to a customer on your new feature. You<br>will learn new technologies based on what we already deploy and use. You will<br>also learn about and research new technologies that you bring to the team to<br>better our offerings. You will play a key role in building more intelligence,<br>into CRS services that we deliver, so that SaaS services function more and more<br>autonomously over time.<br><b><u><br>Per team<br>roles and responsibilities</u></b><br><li>Work with the Product Owner and team members to build<br>new features and enhancements, while supporting existing capabilities<br>being heavily utilized across all Oracle Global Business Units</li><br><li>Planning, designing, coding, documenting and testing of<br>new Oracle Cloud Reliability services used by multiple Oracle Software as<br>a Service products</li><br><li>Develop software using Agile methodologies and<br>participate as a member of scrum development teams</li><br><li>Use Everything-As-Code methodologies to ensure<br>traceability, configurability, immutability, repeatability, and<br>governability</li><br><li>Participate in a follow-the-sun model for 24x7 support<br>of CRS services for designated engineers on a rotating basis</li><br><li>Manage and continuously improve existing CRS<br>capabilities</li><br><li>Review and approve the work products of other team<br>members</li><br><li>Supporting the operation of services using DevOps<br>methodologies for the rapid introduction to production of new services and<br>operational enhancements</li><br><li>Technical thought leadership and mentoring of junior<br>colleagues</li><br><li>Attend training as required to meet Oracle and CRS<br>compliance and regulatory standards. Perform daily tasks in accordance<br>with compliance and regulatory standards</li><br><li>Other duties as assigned</li><br><br><b><u><br>General<br>Qualifications</u></b><br>The candidate will:<br><li>Explore and learn multiple, cutting edge technologies<br>in the cloud industry</li><br><li>Solve complex technical problems and communicate<br>effectively in a team environment&nbsp;<br>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Understand CI/CD best practices</li><br><li>Be self-motivated</li><br><li>Advance automation of standard/recurring tasks</li><br><li>Assimilate and apply new technologies </li><br><li>Work with remote, global teams as well as individually</li><br><li>Produce documentation for application engineers in<br>support of developed work]</li><br><li>Experience with development / test in an open source<br>environment including operation of SSH and shell functions&nbsp;</li><br><li>Strong networking knowledge</li><br><li>Experience with SCM tools and software engineering best<br>practices</li><br><li>Agile methodology knowledge</li><br><br><b><u><br>Preferred Qualifications</u></b><br>An ideal candidate will have<br>expertise with:<br><li>Linux/Unix development (Oracle Linux preferred)</li><br><li>Oracle database</li><br><li>CI/CD (Jenkins and GitLab CI)</li><br><li>Containers and orchestration (Docker, Kubernetes, and<br>docker-compose)</li><br><li>Cloud computing platform (Oracle Cloud Infrastructure<br>Services)</li><br><li>Programming and scripting languages (Python, bash, Java<br>Script - additional experience with Java, Ansible, and/or Go is a plus)</li><br><li>Terraform language knowledge is an advantage</li><br><li>Knowledge and experience in virtual cloud networks is a<br>plus </li><br><li>Git version-control and collaboration (GitLab)</li><br><li>Issue tracking and collaboration (Jira and Confluence)</li><br><li>Product/Service ownership or Project Management<br>experience a plus</li><br><li>Experienced with ITIL V3-V4, Foundation Level certified<br>preferred</li><br><br><b><u><br>Support</u></b><br>Oracle GBUs provide services to many<br>critical systems globally requiring 24x7 support.&nbsp;DevOps engineers will<br>rotate with other team members in a designated, on-call status following<br>in-country requirements. CRS’s primary support model is follow the sun, utilizing<br>geographically diverse team members during normal working hours to provide<br>support.&nbsp;CRS will strive to have subject matter experts distributed<br>globally.&nbsp;With geographic diversity, countries and regions have a broader<br>array of holidays requiring a flexible support schedule across multiple<br>geographies.&nbsp; Additionally, coverage is required through the weekend.<br>To provide the required support to<br>Oracle customers, CRS will use additional compensation to cover extended<br>business hours and/or on-call pay based on in-country laws and Oracle<br>policy.&nbsp;In general, there will be a Primary and Secondary engineer<br>designated in advance to provide coverage for select services.&nbsp;If numerous<br>services are supported in a specific geographic region, there may be more than one<br>set of Primary/Secondary engineers selected.&nbsp;Software engineers and<br>database administrators will engage in activities to restore services that are<br>down or degraded.&nbsp;This may be as simple as running an existing script to<br>restart a service or executing a standard operating procedure, or may require<br>code changes with review steps, integration, testing, and software deployments<br>to restore a service to normal operation.&nbsp;In addition, engagement with<br>other Oracle development and support teams may be needed.<br>Detailed Description and Job Requirements<br>Design, develop, troubleshoot and debug software programs for databases, applications, tools, networks etc.<br>As a member of the software engineering division, you will take an active role in the definition and evolution of standard practices and procedures. You will be responsible for defining and developing software for tasks associated with the developing, designing and debugging of software applications or operating systems.<br>Work is non-routine and very complex, involving the application of advanced technical/business skills in area of specialization. Leading contributor individually and as a team member, providing direction and mentoring to others. BS or MS degree or equivalent experience relevant to functional area. 7 years of software engineering or related experience.<b>As part of Oracle%27s employment process candidates will be required to successfully complete a pre-employment screening process. This will involve identity and employment verification, professional references, education verification and professional qualifications and memberships (if applicable).</b><b>Oracle is an Affirmative Action-Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability, protected veterans status, age, or any other characteristic protected by law.</b><br>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637327&searchId=c7af840b-adcf-49ef-9ba7-a80f4c3372e5","name":"QA Analyst 3-ProdDev","companyName":"Oracle","time":"7 hours ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"<br>Preferred Qualifications<br>Job Description for ORACLE SDWAN QA Engineer in Bangalore.&nbsp;<br>Oracle SDWAN %26ndash;QA &nbsp;team is seeking experienced test engineer with automation experience. We are seeking candidates with 4-9 years QA experience in a Linux environment and prior telecom or networking experience. &nbsp;<br>Location: Prestige Tech Park, Bangalore, India<br><strong>About us:</strong><br>Oracle Failsafe SD-WAN delivers both MPLS-class high availability and high QoE (Quality of Experience) predictable application performance for both TCP-based apps and real-time apps like VoIP and videoconferencing, whether built on a hybrid MPLS plus Internet WAN fabric, or a WAN made up only of Internet connections.<br><strong>RESPONSIBLITIES </strong><ul><br><li>Develop test plans and tools to thoroughly test Oracle software on Linux platform.</li><br><li>Execute manual and automated tests and improve test coverage.</li><br><li>Work/Co-ordinate/collaborate with global Oracle Communications team. </li><br><li>Participate in discussions and maintenance to improve the software performance, maintainability, serviceability, and reliability.&nbsp;</li><br><li>Other duties may be assigned.</li><br></ul><br><strong>DESIRED QUALIFICATIONS:</strong><br>The Oracle SDWAN-QA team is currently seeking someone with 4-9 years of test engineering in a Linux environment. Prior telecom, networking, database experience is expected.<br>Mandatory Skills:<ul><br><li>Bachelors or MCA equivalent engineering/computer science education spanning 4 years.</li><br><li>Good experience on Automation Testing, Knowledge of various automation tools </li><br><li>Good knowledge on Python/Perl Automation, docker, kubernetes, kibana</li><br><li>OSI Stack: L1-L5, open stack, third party Clouds %26ndash; AWS, Azure,OCI. SAAS </li><br><li>Protocols: IPv4, VLAN, GRE, TCP</li><br><li>Strong background on Linux.</li><br></ul><br>Good to have:<ul><br><li>Protocols: IPv6, PQ, VXlan, HTTPS, DNS, DHCP%26hellip;</li><br><li>Routing protocols: e.g. BGP, OSPF</li><br><li>Schedulers: WFQ, AltQ, CFQ, RED, Policing, Shaping, %26hellip;</li><br><li>Firewalls/NAT, PF Sense</li><br><li>Security: Encryption, Ipsec, AES, OpenSSL, TLS, %26hellip;</li><br></ul><br>Soft Skills:<ul><br><li>Strong command on spoken and written English.</li><br><li>Ability to multi-task and handle changing priorities.&nbsp;</li><br><li>Excellent team skills, can-do attitude, focus on quality and drive to make a difference in a dynamic, fast paced organization.&nbsp;</li><br></ul><br>Detailed Description and Job Requirements<br>Responsible for developing, applying and maintaining quality standards for company products with adherence to both internal and external standards. Develops and executes software test plans. Analyzes and writes test standards and procedures. Maintains documentation of test results. Analyzes test results and recommends corrective actions.<br>As a member of the technical/process QA division, you will develop quality standards, control methods and theories to be utilized during manufacturing, testing and inspection to access product quality. Develop standards and procedures to provide quality guidance methods.<br>Duties and tasks are varied and complex needing independent judgment. Fully competent in own area of expertise. May have project lead role and or supervise lower level personnel. BS or MS degree or equivalent experience relevant to functional area. 4 years of software engineering or related experience."},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637323&searchId=c7af840b-adcf-49ef-9ba7-a80f4c3372e5","name":"Senior Software Engineer","companyName":"Oracle","time":"7 hours ago","location":"Bengaluru / Bangalore, Hyderabad / Secunderabad","area":null,"country":"India","description":"<br>Preferred Qualifications<br>Would you like to be part of a team that focuses on empowering customers to move applications from on-premise to the cloud while ensuring no performance issues and no functional regressions? If yes, come join our team. We are looking for highly motivated and hardcore software engineers to join our team.&nbsp;<br><strong>About the team</strong><br>Oracle Application Developer Tools group provides a suite of tools which allows customers to perform automated regression and scalability testing. With Oracle Application Testing Suite, customers can rapidly create automated scripts by recording scripts against web applications without writing a line of code.&nbsp; These scripts can be used as part of a regression suite or used as part of a high scale performance test which can simulate thousands of users interacting with the application under test.<br><strong>Key Responsibilities</strong><br>You will work in a team of highly capable developers who are responsible for all stages of the development life-cycle. You are expected to own architecture, design and implementation to deliver high-quality features. You are expected to work across teams in a highly collaborative environment. You will be responsible for providing technical leadership, participate in design/code reviews and mentor others on the team.<br><strong>Preferred Qualifications</strong><ul><br><li>Strong development experience in Java, C#, C++</li><br><li>Experience in building 3-tiered web applications based on Java EE and Oracle Database</li><br><li>Knowledgeable in at least two of these areas: HTTP protocol, regular expression syntax, DOM, JavaScript</li><br><li>Experience in developing Eclipse plug-ins is a plus</li><br><li>Experience in developing Firefox or Chrome extensions is a plus</li><br><li>Ability to learn quickly, passion for driving for results and strong customer empathy</li><br><li>Deep understanding of data structures, designing algorithms, programming patterns and solving complex issues</li><br><li>Experience using Oracle products such as e-Business Suite is a plus.</li><br></ul><br>Detailed Description and Job Requirements<br>Design, develop, troubleshoot and debug software programs for databases, applications, tools, networks etc.<br>As a member of the software engineering division, you will assist in defining and developing software for tasks associated with the developing, debugging or designing of software applications or operating systems. Provide technical leadership to other software developers. Specify, design and implement modest changes to existing software architecture to meet changing needs.<br>Duties and tasks are varied and complex needing independent judgment. Fully competent in own area of expertise. May have project lead role and or supervise lower level personnel. BS or MS degree or equivalent experience relevant to functional area. 4 years of software engineering or related experience."},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637322&searchId=c7af840b-adcf-49ef-9ba7-a80f4c3372e5","name":"Principal Software Engineer","companyName":"Oracle","time":"7 hours ago","location":"Bengaluru / Bangalore, Hyderabad / Secunderabad","area":null,"country":"India","description":"<br>Preferred Qualifications<br>Would you like to be part of a team that focuses on empowering customers to move applications from on-premise to the cloud while ensuring no performance issues and no functional regressions? If yes, come join our team. We are looking for highly motivated and hardcore software engineers to join our team.&nbsp;<br><strong>About the team</strong><br>Oracle Application Developer Tools group provides a suite of tools which allows customers to perform automated regression and scalability testing. With Oracle Application Testing Suite, customers can rapidly create automated scripts by recording scripts against web applications without writing a line of code.&nbsp; These scripts can be used as part of a regression suite or used as part of a high scale performance test which can simulate thousands of users interacting with the application under test.<br><strong>Key Responsibilities</strong><br>You will work in a team of highly capable developers who are responsible for all stages of the development life-cycle. You are expected to own architecture, design and implementation to deliver high-quality features. You are expected to work across teams in a highly collaborative environment. You will be responsible for providing technical leadership, participate in design/code reviews and mentor others on the team.<br><strong>Preferred Qualifications</strong><ul><br><li>Strong development experience in Java, C#, C++</li><br><li>Experience in building 3-tiered web applications based on Java EE and Oracle Database</li><br><li>Knowledgeable in at least two of these areas: HTTP protocol, regular expression syntax, DOM, JavaScript</li><br><li>Experience in developing Eclipse plug-ins is a plus</li><br><li>Experience in developing Firefox or Chrome extensions is a plus</li><br><li>Ability to learn quickly, passion for driving for results and strong customer empathy</li><br><li>Deep understanding of data structures, designing algorithms, programming patterns and solving complex issues</li><br><li>Experience using Oracle products such as e-Business Suite is a plus.</li><br></ul><br>Detailed Description and Job Requirements<br>Design, develop, troubleshoot and debug software programs for databases, applications, tools, networks etc.<br>As a member of the software engineering division, you will take an active role in the definition and evolution of standard practices and procedures. You will be responsible for defining and developing software for tasks associated with the developing, designing and debugging of software applications or operating systems.<br>Work is non-routine and very complex, involving the application of advanced technical/business skills in area of specialization. Leading contributor individually and as a team member, providing direction and mentoring to others. BS or MS degree or equivalent experience relevant to functional area. 7 years of software engineering or related experience."},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637321&searchId=c7af840b-adcf-49ef-9ba7-a80f4c3372e5","name":"Value Realization Director","companyName":"Oracle","time":"7 hours ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"<br>Preferred Qualifications<br><u>Value Realization Program Director</u>: The&nbsp;Customer Experience Strategy&nbsp;organization has the overall charter to drive improvements&nbsp;throughout Oracle. To help ensure customers get the most out of their Oracle investment, the team regularly listens to customers, engages with key decision makers and analyzes customer feedback to address systemic customer concerns in close cooperation with other Lines of Business (LoB%26rsquo;s) leaders.&nbsp;&nbsp;The Customer Experience Strategy function also helps customers measure the business value realized when using Oracle solutions in order to promote and celebrate their successful business transformation.&nbsp;&nbsp;<br>The Value Realization Program Director role supports a value-based program, continuing the group%26rsquo;s involvement in the strategic account planning process for Oracle%26rsquo;s cloud customers, and its strong collaboration with the Sales and Customer Success Manager (CSM) organizations. Value realization covers two areas %26ndash; the targeting / measuring of business benefits and the on-going planning to promote further adoption of Oracle cloud solutions either to realign to the expected business impact or to further expand beyond these goals.<br>The person conducts or reviews customer decision-maker level interviews or workshops in order to develop insightful comparative benchmark deliverables %26ndash; intending to show the customer where they stand vs. peers in business impact realized from cloud solutions.&nbsp;&nbsp;&nbsp;This role takes a business-minded person who understands how to guide a customer forward from their current level of cloud adoption.&nbsp;&nbsp;Given the role often involves collaborating with customers to understand potential and realized benefits, this person must ask the right questions and be able to communicate concisely across a variety of business disciplines (sales, marketing, finance as well as IT operations).&nbsp;&nbsp;Moreover, this person should be experienced enough to feel comfortable engaging with senior executives both at the customer and within Oracle.<br>The role develops and manages a pipeline of customer value realization interviews, defines and operates under clear responsibilities / accountabilities with other Oracle value practitioner organizations and establishes the communications and harvested repository of customer interview details.<br>There is a high degree of focus on quality and process improvement. The nature of the role is non-routine and very complex, involving the initiation of customer specific interviews and related read-back deliverables.&nbsp;&nbsp;The person will be a leading individual contributor individually who works as a peer-leader providing direction and mentoring to others. This person will also help develop and drive new Value Realization offerings (e.g., self-reporting benefit data). In addition, the role will be responsible for delivering key element of the team%26rsquo;s content roadmap (targeted thought leadership pieces build on the foundation of customer evidence.<br>Masters degree or 15+ years of equivalent experience relevant to functional area preferred.&nbsp;<br>Responsibilities:<br>%26middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Engage with customers and internal value practitioner teams to proactively assist customers with product adoption, ongoing consumption of new Cloud services features, and value realization so that Oracle achieves a high level of consistency in global execution of Cloud adoption programs.&nbsp;<ul><br><li>Define %26amp; manage the needed customer interview pipeline effort, which includes leveraging best practices and techniques in identifying, quantifying and tracking customers for these business value reviews.</li><br><li>Help develop value realization capabilities and relationships with Oracle%26rsquo;s technology solutions, and diverse geographies.</li><br><li>Design %26amp; develop innovative new ways of harvesting %26amp; analyzing results of customer interviews and other business value assets, as well as new ways of communicating actionable insights.</li><br><li>Evaluate customer%26rsquo;s business value drivers and clearly and consistently communicate the customer%26rsquo;s viewpoint back to Customer Experience Strategy and Go-to-Market function management %26ndash; ever tactful in presentation of sensitive issues and considerate of customer confidentiality.</li><br><li>Lead the identification and implementation of program methods, tools, guidelines and standards to establish a stable framework that supports the value realization effort.&nbsp;&nbsp;Solicit ideas, discuss methodology and conclusions in a collaborative, consensus-oriented environment in order to affectively address change management.</li><br><li>Communicate succinctly and effectively, using a consistent framework to synthe and make meaningful recommendations to audiences ranging from individual account team leaders to senior management.</li><br><li>Lead/facilitate customer value engagements with the goal of quantifying and communicating the value achieved by the customer. Be able to guide/train different Oracle stakeholders (CSMs, global marketing/advocacy organization) in delivering value realization services.</li><br><li>Lead the creation of best practice %26ldquo;how to%26rdquo; assets from customer interviews (e.g., top 10 practices to increase HCM adoption).</li><br><li>Overcome corporate inertia, resistance to change and other objections.&nbsp;</li><br></ul><br>Detailed Description and Job Requirements<br>Development and implementation of business plans, marketing strategy, and forecasts for a product/service or vertical market.<br>As a product analyst you will participate in every stage of the product life cycle to ensure product meets the needs of users. Drive the implementation of programs in support of the marketing strategy, business plans, and forecasts for assigned product lines. Maintains current status of customer specifications for existing and future products. Identify, evaluate, and recommend marketing opportunities in support of product line objectives. Drive product functionality delivering high quality product documentation. Lead products through scheduled release assisting others to manage commitments and resources. Measure and report progress and review deliverables.<br>Acknowledged authority within the Corporation. Provides leadership and expertise in the development of new products/services/processes, frequently operating at the leading edge of technology. Demonstrated product/project management experience. Ability to work with Executives. Strong interpersonal skills. Excellent written and verbal communication. Demonstrated product/project management experience. Creative, energetic, and enthusiastic. Team player. Experience using or implementing Oracle, SAP, or Peoplesoft applications. Basic HTML and web technology skills a plus. BA/BS/MBA degree."},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637320&searchId=c7af840b-adcf-49ef-9ba7-a80f4c3372e5","name":"Senior Software Engineer- Oracle Cloud Infrastructure (Join OCI-SDE)","companyName":"Oracle","time":"7 hours ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"<br>Preferred Qualifications<br>Detailed Description and Job Requirements<br>Design, develop, troubleshoot and debug software programs for databases, applications, tools, networks etc.<br>As a member of the software engineering division, you will assist in defining and developing software for tasks associated with the developing, debugging or designing of software applications or operating systems. Provide technical leadership to other software developers. Specify, design and implement modest changes to existing software architecture to meet changing needs.<br>Duties and tasks are varied and complex needing independent judgment. Fully competent in own area of expertise. May have project lead role and or supervise lower level personnel. BS or MS degree or equivalent experience relevant to functional area. 4 years of software engineering or related experience.<b>Oracle is an Affirmative Action-Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability, protected veterans status, age, or any other characteristic protected by law.</b><br>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637324&searchId=c7af840b-adcf-49ef-9ba7-a80f4c3372e5","name":"SaaS Cloud Site Reliability Engineer","companyName":"Oracle","time":"7 hours ago","location":"Noida, US","area":null,"country":"India","description":"<br>Preferred Qualifications<br>Oracle%26rsquo;s SaaS Engineering organization are expanding our N. AMER team supporting a customer-sited Software-as-a-Service Cloud technology (SaaS@customer) which enables our customers to leverage the Oracle SaaS Cloud applications suite from their site by utilizing our hardware in their data center. Our mission is to provide the customer with best in class compute, storage, networking, database, security and support both onsite and remotely.<br>Oracle Cloud Operations are looking self-motivated individual contributors and dynamic team players&nbsp;capable of working as part of our global team.&nbsp;<ul><br><li>Degree level education in one of the following disciplines: Computer Science / Management Information Systems/Science / Engineering / Mathematics / Physics / Chemistry</li><br></ul><ul><br><li>Be able to demonstrate relevant Industry experience of at least 5 years.</li><br></ul><ul><br><li>Excellent System Admin skills in Linux/Unix including commands and shell scripting. OEL/Redhat preferred.</li><br></ul><ul><br><li>Strong analytical/troubleshooting skills supporting the OS, Storage and Hardware for Applications platforms and Database</li><br></ul><ul><br><li>Some NAS and/or SAN Storage administration experience</li><br></ul><ul><br><li>Exceptional understanding of fundamental Network concepts (e.g. Routing, DNS, Firewalls)</li><br></ul><ul><br><li>Excellent oral and written communication skills</li><br></ul><ul><br><li>The ability to work both independently and with members of a global team without close supervision</li><br></ul><ul><br><li>A minimum of 3 years experience and advanced skills in several of the areas listed below:</li><br></ul><br>As the Oracle SaaS Infrastructure Operations engineer, you will be providing the first line of site based system support that includes Hardware, System software and Networking to customers and Field personnel based at the customer premises.<br>You are able to work autonomously with attention to all details involved and following standard operating procedures and agreed time frames to execute. &nbsp;Expected to continually improve current processes, and introduce automation with the aim towards simplification and maximising service up-time.<br>Act as technical liaison for our technical teams. champion standardization, innovate to simplify, increase efficiency while driving down cost. &nbsp;Ensure that the team are delivering quality services and that all&nbsp;SLAs are being met. You will need to understand all aspects of the equipment you support and provide a professional and customer focused service.&nbsp; &nbsp;<br>Role is based in the USA, candidate <strong>must</strong> hold a <strong>US Green Card</strong> to be able to support some US customers.<br>The role also involves participation in Out of Hours&nbsp;support/ Pager to respond to critical issues.&nbsp;<br>Candidates should have:<br>1.Networking %26amp; Switches (Cisco/Juniper (DNS, TCP/IP)<br>2.Core OS Services: SSH, SFTP, NFS, NDS, DHCP, LDAP,<br>3.Scripting in Python or bash<br>4.Proficient managing Virtualisation technology, Xen preferred<br>5.Supporting X86 based technology including fundamental hardware triage skills. Understanding Monitoring and diagnostics to maintain equipment health and reacting appropriately<br>6.Using Change Control tools to manage the site-service workflow&nbsp;<br>7.Exposure to Exadata or RAC desirable<br>8.Key filesystem concepts %26ndash; Ext, NFS, HW RAID and SCSI<br>9.Experience of performance monitoring and capacity management<br>10.Data Center familiarity desirable<br>11.Essential awareness of operations in a secure environment<br>12.Backup/Restore operations<br>Detailed Description and Job Requirements<br>Work with Oracle%27s world class technology to develop, implement, and support Oracle%27s global infrastructure.<br>As a member of the IT organization, assist with the analyze of existing complex programs and formulate logic for new complex internal systems. Prepare flowcharting, perform coding, and test/debug programs. Develop conversion and system implementation plans. Recommend changes to development, maintenance, and system standards.<br>Leading contributor individually and as a team member, providing direction and mentoring to others. Work is non-routine and very complex, involving the application of advanced technical/business skills in area of specialization. BS or equivalent experience in programming on enterprise or department servers or systems.<b>Oracle is an Affirmative Action-Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability, protected veterans status, age, or any other characteristic protected by law.</b><br>"},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637317&searchId=c7af840b-adcf-49ef-9ba7-a80f4c3372e5","name":"Principal Technical Program Manager- Cloud Development (Join OCI-PPM)","companyName":"Oracle","time":"7 hours ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"<br>Preferred Qualifications<br><strong>Principal Technical Program Manager</strong><br><strong>Oracle Public Cloud Infrastructure</strong><br><strong>Technical Program Manager, Developer Life Cycle Team</strong><br>We are building the next-gen cloud;&nbsp;Infrastructure-as-a-Service technologies that operate at high scale in a broadly distributed multi-tenant cloud&nbsp;environment.&nbsp;&nbsp;<br>Our mission is to provide our customers with best-in-class compute, storage, networking, database, security&nbsp;and an ever-expanding set of foundational cloud-based services.<br>This new entity is being constructed with an entrepreneurial spirit:&nbsp;you%26rsquo;ll be joining near the ground floor of a fast-growing new venture that offers a great deal of autonomy with a variety in the work to be done. This role offers high visibility and fast career growth with the pace of a start-up and the heft of Oracle behind it.<br>We are specifically looking for a&nbsp;<strong>Technical Program Manager&nbsp;</strong>to join our Dev LifeCycle&nbsp;team. You will own overall Rythm of Business for our team.<br><strong>Key Responsibilities:</strong><br>%26middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Drive leaders in the team to&nbsp;delivery features and services on time.<br>%26middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Ensure high standards and consistency for the Oracle customer experience.<br>%26middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Recommend process improvements and serve as an escalation point for all issues and questions associated with a project.<br>%26middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Ensure that resource requirements needed to support a particular project are in place.<br>%26middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Provide on-going written and verbal release status updates to senior leadership.&nbsp;<br><strong>Minimum Qualifications:</strong><br>%26middot;&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Bachelor%26rsquo;s or Master%26rsquo;s degree in Computer Science, Information Technology, Business Administration or related field<br>%26middot;&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;9+ years%26rsquo; experience in a technical project or program management role<br>%26middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Understanding of SDLC and modern application development with services<br>%26middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Ability to work with cross-functional teams to establish and maintain our&nbsp; roadmap, setting appropriate expectations and insuring our product and &nbsp;services meet our high operational excellence standards<br>%26middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;A demonstrated ability to think broadly and strategically<br>%26middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Superior written communication skills are a must&nbsp; &nbsp;<br>%26middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Judgement, maturity, negotiation/influence skills, analytical skills and leadership skills<br>%26middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Must be comfortable working with large amounts of data&nbsp;<br><strong>Preferred Qualifications:</strong><br>%26middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Experience managing software and/or hardware development<br>%26middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Experience managing cloud development projects &nbsp;<br>%26middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Experience in enterprise cloud solutions (Azure, AWS, Etc.)<br>Detailed Description and Job Requirements<br>Manage the development and implementation process of a specific company product.<br>Manage the development and implementation process of a specific company product involving departmental or cross-functional teams focused on the delivery of new or existing products. Plan and direct schedules and monitor budget/spending. Monitor the project from initiation through delivery. Organize the interdepartmental activities ensuring completion of the project/product on schedule and within budget constraints. Assign and monitor work of systems analysis and program staff, providing technical support and direction.<br>Work is non-routine and very complex, involving the application of advanced technical/business skills in area of specialization. Leading contributor individually and as a team member, providing direction and mentoring to others. BS or MS degree or equivalent experience relevant to functional area. Seven years of project management, product design or related experience preferred."},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637318&searchId=c7af840b-adcf-49ef-9ba7-a80f4c3372e5","name":"Applications Developer 5","companyName":"Oracle","time":"7 hours ago","location":"Bengaluru / Bangalore, Pune","area":null,"country":"India","description":"<br>Preferred Qualifications<br><strong>Description</strong><br>With tremendous market success in our Cloud Applications, especially in ERP Cloud, Higher Ed institutions have expressed unprecedented interest in embarking a cloud adoption journey with Oracle.&nbsp; Student Information Systems, a critical functional area to complete in our SaaS footprint for Higher Ed, is one top investment priority for Oracle.<br>The Senior Principal Software Engineer plays an important role in Oracle%26rsquo;s plan to disrupt the market. This role is responsible for developing key product features and differentiators for the Student Cloud. As part of the Higher Ed Development team, this role works with product strategy, product management, customers, development, UX, QA, etc.) and will also be mentoring and other developers.<br>This is a senior position. The successful candidate will develop a deep understanding of all (relevant) Oracle, industry and related technologies, Fusion tech stack and other cloud products, and will be responsible for the continuing development of a world class, scalable product architecture and intuitive Student Cloud products which will be used by institutions and students worldwide.<br>As a technical leader with the Oracle Student Cloud development team, you will work on and provide direction to projects that solve complex technical problems that provide substantial customer value and differentiator. You will be in regular interactions with other key executives, leaders and developers and work with team members spread across the globe. This is an extremely challenging, very fast paced, extremely rewarding and highly visible position.<br><strong>Responsibilities</strong><br>Build full stack prototypes and/or proof of concepts using libraries and frameworks.<br>Solve complex technical challenges and implement process amongst the development teams.<br>Provide technical and architectural leadership to a large, world-wide team.<br>Enforce application design patterns and development practices.<br>Leverage leadership abilities to inspire and influence others, internal and external teams<br>Build relationships and influence outside of authority while leveraging Oracle expertise and resources.<br>Research and present technical solutions to technical management and senior individual contributors.<br><strong>Requirements</strong><br>Deep architectural leadership experience in SaaS/Cloud as well as in enterprise software solutions.<br>Commercial experience as lead developer of complex cross application products and/or underlying infrastructure that has shipped and in use by large number of customers.<br>High degree of competence in written and verbal communication skills, including experience communicating with Executive audiences.<br>BS or MS degree or equivalent experience relevant to functional area, multiple domains preferred.<br>15+ years of software engineering and technical leadership experience.<br>Highly familiar with Agile methodologies and experience in guiding agile teams.<br>Excellent problem solving, critical thinking, and communication skills.<br>Self driven and highly motivated by meaningful and impactful work.<br>Ability to work in an extremely fast paced and challenging environment.<br>Excellent command of written and spoken English.<br>Passion and empathy for human/consumer centered design.<br><strong>Skills</strong><br>Backend<ul><br><li>Java/C#/Python or other object oriented language.</li><br><li>Deep knowledge of data modeling and query performance tuning.</li><br><li>Deep knowledge of REST service design and implementation.</li><br><li>Cloud Infrastructure design patterns.</li><br></ul><br>Front end<ul><br><li>Experienced with more than one JavaScript framework (Angular, React, etc%26hellip;).</li><br><li>Experienced with unit testing (Jasmine, Mocha, Chai, etc%26hellip;).</li><br><li>Experienced with functional automation testing, Selenium.</li><br><li>Experienced with JavaScript Build libraries.</li><br><li>Experienced in CSS/CSS pre compilers (SASS, LESS, etc%26hellip;).</li><br><li>Experienced in Mobile design and development.</li><br><li>UI Component design patterns.</li><br><li>JavaScript design patterns.</li><br><li>Experience with JavaScript ES5, JavaScript ES6, and/or TypeScript.</li><br><li>Experience with NPM, NodeJS, Deno</li><br></ul><br><strong>Bonus</strong><br>Expert in accessibility<br>Expert in data security<br>Expert in UI security<br>Advanced knowledge of pipeline tools (Jenkins, TeamCity)<br>Experience with: &nbsp;ADF, ADF REST, OCI, Oracle JET, Oracle Visual Builder<br>Detailed Description and Job Requirements<br>Analyze, design develop, troubleshoot and debug software programs for commercial or end user applications. Writes code, completes programming and performs testing and debugging of applications.<br>As a member of the software engineering division, you will specify, design and implement major changes to existing software architecture. Create new architecture for a moderate product or a portion of a major product. Build and execute unit tests and unit test plans. Review integration and regression test plans created by QA. Communicate with QA and porting engineering to ensure consistency, testability and portability across products in general.<br>Provide leadership and expertise in the development of new products/services/processes, frequently operating at the leading edge of technology. Recommends and justifies major changes to existing products/services/processes. BS or MS degree or equivalent experience relevant to functional area. 8 or more years of software engineering or related experience."},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637315&searchId=c7af840b-adcf-49ef-9ba7-a80f4c3372e5","name":"Principal Software Engineer","companyName":"Oracle","time":"7 hours ago","location":"Hyderabad / Secunderabad","area":null,"country":"India","description":"<br>Preferred Qualifications<br>Would you like to be part of a team that focuses on empowering customers to move applications from on-premise to the cloud while ensuring no performance issues and no functional regressions? If yes, come join our team. We are looking for highly motivated and hardcore software engineers to join our team.&nbsp;<br><strong>About the team</strong><br>Oracle Application Developer Tools group provides a suite of tools which allows customers to perform automated regression and scalability testing. With Oracle Application Testing Suite, customers can rapidly create automated scripts by recording scripts against web applications without writing a line of code.&nbsp; These scripts can be used as part of a regression suite or used as part of a high scale performance test which can simulate thousands of users interacting with the application under test.<br><strong>Key Responsibilities</strong><br>You will work in a team of highly capable developers who are responsible for all stages of the development life-cycle. You are expected to own architecture, design and implementation to deliver high-quality features. You are expected to work across teams in a highly collaborative environment. You will be responsible for providing technical leadership, participate in design/code reviews and mentor others on the team.<br><strong>Preferred Qualifications</strong><ul><br><li>Strong development experience in Java, C#, C++</li><br><li>Experience in building 3-tiered web applications based on Java EE and Oracle Database</li><br><li>Knowledgeable in at least two of these areas: HTTP protocol, regular expression syntax, DOM, JavaScript</li><br><li>Experience in developing Eclipse plug-ins is a plus</li><br><li>Experience in developing Firefox or Chrome extensions is a plus</li><br><li>Ability to learn quickly, passion for driving for results and strong customer empathy</li><br><li>Deep understanding of data structures, designing algorithms, programming patterns and solving complex issues</li><br><li>Experience using Oracle products such as e-Business Suite is a plus.</li><br></ul><br>Detailed Description and Job Requirements<br>Design, develop, troubleshoot and debug software programs for databases, applications, tools, networks etc.<br>As a member of the software engineering division, you will take an active role in the definition and evolution of standard practices and procedures. You will be responsible for defining and developing software for tasks associated with the developing, designing and debugging of software applications or operating systems.<br>Work is non-routine and very complex, involving the application of advanced technical/business skills in area of specialization. Leading contributor individually and as a team member, providing direction and mentoring to others. BS or MS degree or equivalent experience relevant to functional area. 7 years of software engineering or related experience."},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637316&searchId=c7af840b-adcf-49ef-9ba7-a80f4c3372e5","name":"Senior Software Engineer","companyName":"Oracle","time":"7 hours ago","location":"Hyderabad / Secunderabad","area":null,"country":"India","description":"<br>Preferred Qualifications<br>Would you like to be part of a team that focuses on empowering customers to move applications from on-premise to the cloud while ensuring no performance issues and no functional regressions? If yes, come join our team. We are looking for highly motivated and hardcore software engineers to join our team.&nbsp;<br><strong>About the team</strong><br>Oracle Application Developer Tools group provides a suite of tools which allows customers to perform automated regression and scalability testing. With Oracle Application Testing Suite, customers can rapidly create automated scripts by recording scripts against web applications without writing a line of code.&nbsp; These scripts can be used as part of a regression suite or used as part of a high scale performance test which can simulate thousands of users interacting with the application under test.<br><strong>Key Responsibilities</strong><br>You will work in a team of highly capable developers who are responsible for all stages of the development life-cycle. You are expected to own architecture, design and implementation to deliver high-quality features. You are expected to work across teams in a highly collaborative environment. You will be responsible for providing technical leadership, participate in design/code reviews and mentor others on the team.<br><strong>Preferred Qualifications</strong><ul><br><li>Strong development experience in Java, C#, C++</li><br><li>Experience in building 3-tiered web applications based on Java EE and Oracle Database</li><br><li>Knowledgeable in at least two of these areas: HTTP protocol, regular expression syntax, DOM, JavaScript</li><br><li>Experience in developing Eclipse plug-ins is a plus</li><br><li>Experience in developing Firefox or Chrome extensions is a plus</li><br><li>Ability to learn quickly, passion for driving for results and strong customer empathy</li><br><li>Deep understanding of data structures, designing algorithms, programming patterns and solving complex issues</li><br><li>Experience using Oracle products such as e-Business Suite is a plus.</li><br></ul><br>Detailed Description and Job Requirements<br>Design, develop, troubleshoot and debug software programs for databases, applications, tools, networks etc.<br>As a member of the software engineering division, you will assist in defining and developing software for tasks associated with the developing, debugging or designing of software applications or operating systems. Provide technical leadership to other software developers. Specify, design and implement modest changes to existing software architecture to meet changing needs.<br>Duties and tasks are varied and complex needing independent judgment. Fully competent in own area of expertise. May have project lead role and or supervise lower level personnel. BS or MS degree or equivalent experience relevant to functional area. 4 years of software engineering or related experience."},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637319&searchId=c7af840b-adcf-49ef-9ba7-a80f4c3372e5","name":"Principal DevOps Engineer","companyName":"Oracle","time":"7 hours ago","location":"Noida","area":null,"country":"India","description":"<br>Preferred Qualifications<br>As a member of Corporate Tools Engineering (CTE) DevOps and Automation team, you%26#39;ll be required to provide excellent solutions for Cloud operations. You%26#39;ll be managing and supporting internal/external systems as well as systems on the Cloud. As a member of DevOps team, you%26#39;ll be responsible for Continuous Integration of Development changes, and making sure that the health of all systems is great. You%26#39;ll also be responsible for the patchings, upgrades of all components of the system. As a member of Automation team, you%26#39;ll be tasked with automation of each and every Operational task so that the manual intervention/effort can be eliminated.<br>The job requires you to be well accustomed with different DevOps tools and technologies. An aptitude towards fast learning, adapting to fast changes, and motivation towards automation of everything is a must. Past experience in managing databases, administering middle and web tiers, programming/scripting knowledge for automation of tasks is a must. You should be motivated to work in an independent environment, curious to learn and implement new tools/technologies with a confidence to work and fix any technical issue that comes along.<br>Experience:<br>- Experience of working in a challenging work environment and track record of meeting project timelines<br>- Minimum of 8-10 years of work experience in technologies listed below<br>- Excellent communication skills. English language.<br>Must-have/Key Skill Requirements (candidate should be strong in these):<br>- Programming/Scripting language (Bash/shell, Python, pl/sql etc)<br>- Database administration (upgrades, patchings, monitoring, maintenance, exadata, dataguard, clonings&nbsp; etc)<br>- Weblogic administration (upgrades, monitoring, SOA/BPM etc)<br>- OBIEE (upgrades, monitoring etc)<br>- Oracle Enterprise Manager<br>- Version control systems (Git etc)<br>- Very comfortable with Linux<br>- Jenkins/Hundson, ant builds etc<br>- Oracle APEX<br>- Confluence<br>Preferred Skills (added advantage)<br>- Experience in DevOps tools like Ansible, Terraform, Chef, Kubernetes, Puppet/MCollective/RabbitMQ etc<br>- Docker<br>Education:<br>- Bachelor%26#39;s degree or above in Computer Science Engineering or Equivalent<br>Detailed Description and Job Requirements<br>Design, develop, troubleshoot and debug software programs for databases, applications, tools, networks etc.<br>As a member of the software engineering division, you will take an active role in the definition and evolution of standard practices and procedures. You will be responsible for defining and developing software for tasks associated with the developing, designing and debugging of software applications or operating systems.<br>Work is non-routine and very complex, involving the application of advanced technical/business skills in area of specialization. Leading contributor individually and as a team member, providing direction and mentoring to others. BS or MS degree or equivalent experience relevant to functional area. 7 years of software engineering or related experience."},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637314&searchId=c7af840b-adcf-49ef-9ba7-a80f4c3372e5","name":"Hardware Developer 2","companyName":"Oracle","time":"7 hours ago","location":"Bengaluru / Bangalore","area":null,"country":"India","description":"<br>Preferred Qualifications<br>Preferred Qualifications<br>Oracle is searching for highly motivated engineers who want to maximize their skills developing cutting edge hardware systems for secure, diverse, content rich networks.&nbsp;<br>Department Description:<br>As part of the Communications Global Business Unit On-Premise Hardware Development Team, the applicant will be involved in developing the next generation of Oracle hardware underlying secure, efficient and highly scalable networks. These systems utilize cutting edge technology to deliver best in class performance, simplified management, and cost-saving efficiencies in both enterprise and communication service provider deployments.<br>Position Overview:<br>Our organization is looking for highly motivated, dedicated team members to drive hardware design %26amp; development for these products. Engineers will utilize a broad skillset to implement designs and participate in all phases of product development including:<br>- Initial concept and platform architecture<br>- Component selection and qualification<br>- Design implementation (FPGA design and simulation)<br>- Manufacturing, assembly, test<br>- Rapid prototyping, bringup and debug<br>- Design Verification Testing<br>- Troubleshooting and fault identification&nbsp;<br>Job Responsibilities:<br>Engineers on our team have broad opportunity to explore multiple areas of electrical systems design including:<br>- High speed I/O bus architecture (PCI Express, USB, SAS/SATA)<br>- Network and Security Processors, DSP technology<br>- I/O interfaces (USB, 10GbE)<br>- Processor interfaces<br>- Control and Datapath FPGA design<br>Candidate Profile:<br>- BS or MS in Electrical Engineering or Computer Engineering plus 3&nbsp;- 5&nbsp;years of relevant experience<br>- Expertise in FPGA Design of control and datapath functions<br>- Experience with Xilinx or Altera/Intel FPGAs<br>- Expertise in Verilog and/or VHDL<br>- Strong background in digital simulation and design verification &nbsp;<br>- Experience with Computer Architecture/Systems<br>- Familiarity with x86 architecture, DDR4, PCIe<br>- Experience with lab debug/bringup and associated equipment (logic analyzers, high speed oscilloscopes)<br>- Experience in high speed design concepts (10 - 20 Gbps)<br>Detailed Description and Job Requirement<br>Evaluates reliability of materials, properties and techniques used in production; plans, designs and develops electronic parts, components, integrated circuitry, mechanical systems, equipment and packaging, optical systems and/or DSP systems.<br>Responsible for designing, developing, modifying and evaluating electronic, electro-mechanical or mechanical components, assemblies or integrated circuitry for hardware systems for the external market. Includes new design, as well as modification activities that results in significant product enhancement. Activities encompass design, analysis, testing and process development using engineering principles and methods. Technical disciplines may include electrical and logical design of printed circuit boards or integrated circuits; mechanical design of electronics enclosures or integrated circuit packaging; and embedded software/firmware design.<br>Work is non-routine and very complex, involving the application of advanced technical/business skills in area of specialization. Leading contributor individually and as a team member, providing direction and mentoring to others. BS or MS degree or equivalent experience relevant to functional area. 3 - 5&nbsp;years of engineering or related experience.<br>Preferred Qualifications<br>Oracle is searching for highly motivated engineers who want to maximize their skills developing cutting edge hardware systems for secure, diverse, content rich networks.&nbsp;<br>Detailed Description and Job Requirements<br>Evaluates reliability of materials, properties and techniques used in production; plans, designs and develops electronic parts, components, integrated circuitry, mechanical systems, equipment and packaging, optical systems and/or DSP systems.<br>Responsible for designing, developing, modifying and evaluating electronic, electro-mechanical or mechanical components, assemblies or integrated circuitry for hardware systems for the external market. Includes new design, as well as modification activities that results in significant product enhancement. Activities encompass design, analysis, testing and process development using engineering principles and methods. Technical disciplines may include electrical and logical design of printed circuit boards or integrated circuits; mechanical design of electronics enclosures or integrated circuit packaging; and embedded software/firmware design.<br>Duties and tasks are standard with some variation; displays understanding of roles, processes and procedures. Performs moderately complex problem solving with assistance and guidance in understanding and applying company policies and processes. BS degree or equivalent experience relevant to functional area. 1 year of engineering or related experience."},{"link":"https://www.monsterindia.com/seeker/job-details?id=1637334&searchId=c7af840b-adcf-49ef-9ba7-a80f4c3372e5","name":"Apps Dev Tech Lead Analyst 1","companyName":"Citi","time":"7 hours ago","location":"Chennai","area":null,"country":"India","description":"<br>Job Description :<br>The Applications Development Technology Lead Analyst is a senior level position responsible for establishing and implementing new or revised application systems and programs in coordination with the Technology team. The overall objective of this role is to lead applications systems analysis and programming activities.<br><b><u>Responsibilities:</u></b><ul><li>Partner with multiple management teams to ensure appropriate integration of functions to meet goals as well as identify and define necessary system enhancements to deploy new products and process improvements</li><li>Resolve variety of high impact problems/projects through in-depth evaluation of complex business processes, system processes, and industry standards</li><li>Provide expertise in area and advanced knowledge of applications programming and ensure application design adheres to the overall architecture blueprint</li><li>Utilize advanced knowledge of system flow and develop standards for coding, testing, debugging, and implementation</li><li>Develop comprehensive knowledge of how areas of business, such as architecture and infrastructure, integrate to accomplish business goals</li><li>Provide in-depth analysis with interpretive thinking to define issues and develop innovative solutions</li><li>Serve as advisor or coach to mid-level developers and analysts, allocating work as necessary</li><li>Appropriately assess risk when business decisions are made, demonstrating particular consideration for the firm's reputation and safeguarding Citigroup, its clients and assets, by driving compliance with applicable laws, rules and regulations, adhering to Policy, applying sound ethical judgment regarding personal behavior, conduct and business practices, and escalating, managing and reporting control issues with transparency.</li></ul><br><b><u>Qualifications:</u></b><ul><li>6-10 years of relevant experience in Apps Development or systems analysis role</li><li>Extensive experience system analysis and in programming of software applications</li><li>Experience in managing and implementing successful projects</li><li>Subject Matter Expert (SME) in at least one area of Applications Development</li><li>Ability to adjust priorities quickly as circumstances dictate</li><li>Demonstrated leadership and project management skills</li><li>Consistently demonstrates clear and concise written and verbal communication</li></ul><br><b><u>Education:</u></b><ul><li>Bachelor’s degree/University degree or equivalent experience</li><li>Master’s degree preferred</li></ul><br>This job description provides a high-level review of the types of work performed. Other job-related duties may be assigned as required.<br>-------------------------------------------------<br><b>Job Family Group: </b>Technology<br>-------------------------------------------------<br><b>Job Family:</b>Applications Development<br>------------------------------------------------------<br><b>Time Type:</b><br>------------------------------------------------------<br>Citi is an equal opportunity and affirmative action employer.<br>Qualified applicants will receive consideration without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.<br>Citigroup Inc. and its subsidiaries (\"Citi) invite all qualified interested applicants to apply for career opportunities. If you are a person with a disability and need a reasonable accommodation to use our search tools and/or apply for a career opportunity review .<br>View the \"\" poster. View the .<br>View the .<br>View the "}]